{
  "meta": {
    "title": "THE HOOD INTERNET presents '79 - '99",
    "description": "Samples of 50 or 60 songs from a single calendar year, distilled into something new."
  },
  "videos": [
    {
      "contentDetails": {
        "duration": 200
      },
      "id": "N9jU8JLziaY",
      "snippet": {
        "title": "60 Songs From 1998 Remixed Into 3½ Minutes",
        "description": "Samples of more than 60 songs from 1998 mixed together into one 3½-minute song by The Hood Internet. Watch the whole ongoing playlist here: http://bit.ly/thi-79-99\n\nFeaturing: \n2Pac, Aaliyah, Aerosmith, Air, Alanis Morisette, Barenaked Ladies, Beastie Boys, Belle and Sebastian, Big Pun and Joe, Boards of Canada, Brandy and Monica, Britney Spears, Cake, Cardigans, DMX, Eve 6, Fastball, Fatboy Slim, The Flys, Garbage, Goo Goo Dolls, Hieroglyphics, Hole, Jay Z (ft Amil and Ja Rule), Jimmy Eat World, Juvenile (ft Mannie Fresh, Lil Wayne), Korn, Lauryn Hill, Lenny Kravitz, Local H, The LOX (ft DMX and Lil' Kim), Madonna, Manic Street Preachers, Massive Attack, Mercury Rev, Moby, Monifah, N.O.R.E., Neutral Milk Hotel, New Radicals, Nicole Wray (ft Missy Elliott and Mocha), The Offspring, OutKast, Pras Michel (ft Ol' Dirty Bastard, Mýa), Pulp, Refused, Semisonic, Silkk Tha Shocker, The Smashing Pumpkins, Stardust, Whitney Houston",
        "publishedAt": "2021-03-25T05:00:13Z",
        "thumbnails": {
          "default": {
            "url": "https://i.ytimg.com/vi/N9jU8JLziaY/default.jpg",
            "width": 120,
            "height": 90
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/N9jU8JLziaY/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "high": {
            "url": "https://i.ytimg.com/vi/N9jU8JLziaY/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/N9jU8JLziaY/sddefault.jpg",
            "width": 640,
            "height": 480
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/N9jU8JLziaY/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          }
        }
      },
      "comments": [
        {
          "id": "UgxAthNYZaZMaZllcFB4AaABAg",
          "snippet": {
            "videoId": "N9jU8JLziaY",
            "topLevelComment": {
              "snippet": {
                "textDisplay": "Can you help figure out which songs are which? \n\n0:02 Mercury Rev \"Holes\" (Audio: Violin drone) \n\n0:06 Fatboy Slim \"Praise You\" (Lyric: \"We've come a long long way together...\" + Video: Dance group)\n0:07 Outkast “Rosa Parks” (Lyric: “Uh huh, uh huh, baby, yeah yeah ...” + Video: People dancing in the street with red shirts) \n0:16 Big Pun \"Still Not A Player\" (Audio: drums) \n0:16 Belle and Sebastian \"The Boy With The Arab Strap\" (Audio: Faint organ line, repeated a note higher) \n0:17 Madonna “Ray of Light” (Audio: Guitar riff + Video: Madonna in front of a sunrise) \n0:24 Lenny Kravitz “Fly Away” (Lyric: “Oh. Oh. Oh yeah!”)\n\n0:28 Neutral Milk Hotel “King of Carrot Flowers, Part 1” (Lyric: “When you were young, you were the king of carrot flowers”)\n0:31 Air “Sexy Boy” (Video: Monkey toy looming over animated city)\n0:37 Stardust \"Music Sounds Better With You\" (Audio: Two guitar notes + Video: 3 white aliens on the moon in front of a rainbow) \n0:40 Semisonic “Closing Time” (Audio: Piano riff + Video: Split-screen)  \n\n0:45 Jay-Z ft. Amil & Ja Rule - Can I Get A... (Lyric: \"Bounce with me\") \n0:46 Eve 6 \"Inside Out\" (Lyric: \"Ooooo\" + Video: Bassist in red/yellow shirt coming in and out of focus) \n0:47 Neutral Milk Hotel \"Holland, 1945\" (Audio: Drone sound)\n0:48 Hole “Celebrity Skin” (Audio: Courtney Love falls into the void, chandelier smashes)\n0:48 Beastie Boys “Intergalactic” (Audio: Robotic voice “Intergalactic, planetary” + Video: Cardboard robot attacks the city)\n0:52 Korn “Freak on a Leash” (Audio: Guitar solo + Video: Bullet goes through a lava lamp)  \n0:56 Jay-Z \"Hard Knock Life (The Ghetto Anthem)\" (Video: Jay-Z with a couple of girls on a sidestep)\n1:01 Madonna “Frozen” (Video: Madonna in blue)  \n\n1:03 Barenaked Ladies - One Week (String sound)\n1:04 Lauryn Hill “Ex-Factor” (Video: Lauryn stands in front of a window)  \n1:07 Monifah \"Touch It\" (Video: Monifah dances in a red dress, in front of four backup dancers in white, in front of a helicopter)\n1:08 Massive Attack \"Teardrop\" (drums) \n\n1:10 Lauryn Hill “Doo Wop (That Thing)” (Lyrics: “Girls you know you better, watch out”) \n1:10 Smashing Pumpkins “Ava Adore” (Audio: Glitchy drums + Video: Panning shot)\n1:10 Massive Attack “Teardrop” (Audio: Percussion + Video: Inside a womb)\n1:24 Manic Street Preachers “If You Tolerate This Your Children Will Be Next” (Audio: Guitar chord + Video: Red lights)  \n\n1:27 Big Pun ft. Joe \"Still Not A Player\" (Lyrics: “I don’t wanna be a player no more” + Video: Big Pun and Joe singing and dancing around many girls)  \n1:27 Juvenile (ft Mannie Fresh, Lil Wayne) \"Back That Azz Up\" (Strings and record scratches)  \n1:30 Silkk tha Shocker \"Just Be Straight With Me\" (Lyric: OOOoooOOO OOOoooOOO)\n\n1:37 Air \"Kelly Watch the Stars\" (Lyrics: \"Kelly watch the stars\" + Video: Ping Pong game)  \n1:37 DMX \"Ruff Ryders Anthem\" (Audio: Melody + Video: Gang of people on quad bikes)  \n1:40 The Offspring \"Pretty Fly (For a White Guy)\" (Audio: Drum fill + Video: Breakdancing guy) \n1:41 Big Pun ft Joe \"Still Not A Player\" reprise (Lyric: \"Boricua, Morena\") \n1:41 Boards of Canada \"Roygbiv\" (Audio: Deep synth pad riff)\n1:41 Nicole Wray ft. Missy Elliott & Mocha \"Make It Hot\" (Lyric: \"Aaah\" + Video: Nicole and dancers in white)\n1:46 N.O.R.E. \"Superthug\" (Audio: Beat + Trivia: This is one of the songs that put producers The Neptunes in the mainstream scene and would later produce for Timberlake, Britney, Nelly and would spark Pharrell's solo career)\n1:50 Garbage “I Think I’m Paranoid” (Audio: Guitar riff + Video: Black and white guitarist) \n\n1:51 Fatboy Slim \"The Rockefeller Skank\" (lyrics: “Right about now… check it out now”) \n1:51 Cake \"Never There\" (Video: Line dancing cowboy boots)\n1:51 Aaliyah \"Are You That Somebody?\" (Lyrics: “Can y’all really feel me.. West coast  feel me\" + Audio: Drums) \n1:57 Refused \"New Noise\" (Audio: Guitar riff + Video: Men in bunny costumes walk through hallway.)  \n2:00 Belle and Sebastian \"The Boy With The Arab Strap\" (Audio: Hand claps)\n2:02 Cake \"Never There\" reprise (Audio: Drums + Video: Phone in the foreground while a couple dance in the background)\n2:02 The LOX ft. Lil' Kim & DMX \"Money, Power, Respect\" (Audio : Violin + Video : The LOX in black outfits) \n\n2:09 Britney Spears \"Baby One More Time\" (lyrics: “I must confess ... that my loneliness, is killing me now...\")  \n2:10 Alanis Morrisette \"Thank U\" (Audio: Spacey chords)\n2:11 Refused \"New Noise\" reprise (Audio: Guitar riff + Video: Men in bunny costumes walk through hallway.)  \n2:14 Korn “Freak On A Leash” reprise (Audio: sparse guitar notes) \n2:20 Pulp \"This Is Hardcore\" (Video: Jarvis Cocker lying down surrounded by showgirls in gold with blue feathers) \n2:20 The Flys \"Got You\" (Audio: Bass guitar)\n2:21 Fastball “The Way” (Audio: Guitar riff) \n2:22 Hieroglyphics \"You Never Knew\" (Audio: Faint \"You never knewwww\" sample)\n2:27 Moby \"Honey\" (snare and record scratch transition)  \n\n2:29 New Radicals \"You Get What You Give\" (lyrics: “Don’t let go, you got the music in you” + Video: Gregg Alexander singing in the elevator) \n2:29 2Pac \"Changes\" (Audio: Drums)   \n2:30 Lauryn Hill “Everything Is Everything” (Audio: Strings + Video: Newspapers floating around in the city)\n2:33 Fatboy Slim “Praise You” reprise (Lyric: “Through the hard times and the good”)\n2:35 The Cardigans \"My Favourite Game\" (Audio: Faint Guitar riff + Video: Cars crashing) \n2:38 Jimmy Eat World “Lucky Denver Mint” (Lyric: You’re not bigger than this, not better, why can’t you learn?”)\n2:40 Brandy & Monica \"The Boy Is Mine\" (Video: Brandy and Monica come out of door) \n\n2:47 Whitney Houston \"It’s Not Right But It’s Okay\" (Lyrics: \"It’s not right, but it’s okay”)  \n2:48 Aerosmith \"I Don't Wanna Miss a Thing\" (powerful string chords)\n2:52 Goo Goo Dolls \"Iris\" (Audio: Guitar solo + Video: Band playing in tunnel)\n2:53 Pras Michel (ft Ol' Dirty Bastard, Mýa) \"Ghetto Supastar (That Is What You Are)\" (Lyrics: \"We can rely on each other, uh huh\" + Video: Woman with a red, blue and white background) \n3:14 Local H “All The Kids Are Right” (Audio: Guitar riff)\n\nThanks to the contributors: The Geecy Project, Nickster, Legolordfilms, Jakob Mueller, Brayan Puma, Blackhammer 123, WWS12, Joey Alvestad, Steve Pettifer, Sara Kaiser, kansai27, thisisdomino, Tony Pellum and GasparLewis! \n\nNot figured out yet: Nothing! 1998 is officially Sorted Out. Well done everyone!!",
                "publishedAt": "2021-03-25T05:35:57.000Z"
              }
            }
          }
        }
      ]
    },
    {
      "contentDetails": {
        "duration": 201
      },
      "id": "T4Zy3qFo_s0",
      "snippet": {
        "title": "60 Songs From 1997 Remixed Into 3½ Minutes",
        "description": "Samples of more than 60 songs from 1997 mixed together into one 3½-minute song by The Hood Internet. Watch the whole ongoing playlist here: http://bit.ly/thi-79-99\n\nFeaturing:\nBackstreet Boys, Ben Folds Five, Björk, Blink-182, Blur, Busta Rhymes, Changing Faces, Chemical Brothers, Chumbawamba, Cornershop, Da Brat, Daft Punk, The Dandy Warhols, Depeche Mode, Destiny's Child, Everclear, Fiend, Foo Fighters, Green Day, Hanson, Harvey Danger, Janet Jackson, K-Ci & JoJo, Kelly Price, Lil' Kim, Ma$e, Master P, The Mighty Mighty Bosstones, Mia X, Missy Elliott, Modest Mouse, Mystikal, Natalie Imbruglia, Next, Notorious B.I.G., Pavement, The Prodigy, Puff Daddy, Radiohead, Sarah McLachlan, Shania Twain, Silkk the Shocker, Sixpence None The Richer, Smash Mouth, Somethin' for the People, Spiritualized, Stereolab, Sugar Ray, Third Eye Blind, Total, Usher, Veruca Salt, The Verve, White Town, Will Smith, Wu Tang Clan, Wyclef Jean, Yo La Tengo",
        "publishedAt": "2021-03-18T05:00:14Z",
        "thumbnails": {
          "default": {
            "url": "https://i.ytimg.com/vi/T4Zy3qFo_s0/default.jpg",
            "width": 120,
            "height": 90
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/T4Zy3qFo_s0/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "high": {
            "url": "https://i.ytimg.com/vi/T4Zy3qFo_s0/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/T4Zy3qFo_s0/sddefault.jpg",
            "width": 640,
            "height": 480
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/T4Zy3qFo_s0/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          }
        }
      },
      "comments": [
        {
          "id": "UgwS8jbFEPjpFsAjxgx4AaABAg",
          "snippet": {
            "videoId": "T4Zy3qFo_s0",
            "topLevelComment": {
              "snippet": {
                "textDisplay": "Can you help figure out which songs are which?  \n\n0:00 The Notorious B.I.G. \"Sky's The Limit\"  (Lyric: \"Good evening ladies and gentlemen\" + Video : Kids walking around)  \n0:02 ? ? (Lyric: \"Ladiiiiiiiiiies aaaaaand gentlemeeeeeeen\")\n0:04 Radiohead \"Paranoid Android\" (Audio: Beeping and shaker behind the title card)\n\n0:07 Spritualized \"Ladies and Gentlemen We Are Floating In Space\" (Lyric: Woman's voice \"Ladies and gentlemen we are floating in space\" + Video: Black and white video)\n0:07 Pavement \"Stereo\" (Audio: Bass, from the opening notes of the song)\n0:07 The Prodigy \"Smack My Bitch Up\" (Audio: Bass + Video: Man and woman walking down a red and blue corridor)  \n0:09 Destiny's Child ft. Wyclef Jean \"No, No, No Part 2\" (Audio: 3 high-pitched beeps, repeated + Video: 4 women in shadow) \n\n0:11 Depeche Mode \"It's No Good\" (Two note synth pad sound)  \n0:15 Missy Elliot \"The Rain (Supa Dupa Fly)\" (Missy with big latex costumes)  \n0:16 Veruca Salt \"Volcano Girl\" (Audio: Fuzzy guitar riff + Video: Blonde and brunette ladies, white sheet pulled back at 0:25, bungee jumping at 0:30) \n0:16 Usher \"U Make Me Wanna\" (Audio: Drums)\n0:21 Destiny's Child ft. Wyclef Jean \"No, No, No Part 2\" (Lyric: \"This is the remix\" by Wyclef Jean, \"Ahhh-ah-ah-ah\" by Destiny's Child) \n0:23 User \"U Make Me Wanna (Lyrics \"This is what you do\"  + Video: Usher with dancers)\n0:27 Somethin' for the People \"My Love is the Shhhh!\" (Lyric: \"Lemme work that body baby\" + Video: Man in green shirt standing in front of pink neon letters)\n0:33 Puff Daddy ft. Lil Kim \"It's All About The Benjamins\" (Lyric : \"It's all about the Benjamins baby\" x3 by Lil' Kim)\n0:39 The Chemical Brothers \"Block Rockin' Beats\" (Lyric: \"Back with another one of those Block Rockin' BEATS!\" + Artist with purple lips) \n\n0:40 Blur \"Song 2\" (Lyrics: \"Woo-oo!\")  \n0:40 Cornershop \"Brim Full of Asha\" (Audio: Guitar + Video: Girl with record player)\n0:41 Busta Rhymes \"Dangerous\" (Lyrics : \"One time ya'll, throw yo hands real high ya'll ...\")\n0:43 Will Smith \"Gettin' Jiggy Wit It\" (Lyrics: \"Na na na na, na na\") \n0:54 Changing Faces \"G.H.E.T.T.O.U.T.\" (Video: Woman with earring and blue background)\n0:58 Shania Twain \"Man, I Feel Like A Woman\" (Lyric, \"Let's Go\", Brassy melody)  \n1:00 Wu Tang Clan \"Triumph\" (Video: Club with Wu Tang sign) \n1:01 Master P ft. Fiend, Slikk The Shocker, Mia X & Mystikal \"Make Em Say Ugh\" (Audio : Ugh na-na-na + Video: Men in basketball jerseys) \n\n1:06 Third Eye Blind \"Semi-Charmed Life\" (Drums)\n1:06 The Verve \"Bitter Sweet Symphony\" (Audio: strings + Video: Man crossing street, bumping into people, stepping over car)\n1:07 Backstreet Boys \"Everybody (Backstreet's Back)\" (Audio: Drums)\n1:08 Shania Twain \"Man, I Feel Like A Woman\" (Lyric: \"Oh, yeah yeah\")  \n1:10 Hanson \"Mmmbop\" (Lyric: \"Yay-ee yeah-uh\" + Video: Rollerblading)  \n1:15 The Notorious BIG \"Hypnotize\" (Lyrics: \"oohh\" + 1:26´s \"Biggie Biggie Biggie can't u see?\")\n1:15 The Dandy Warhols “Not If You Were The Last Junkie On Earth” (Video: Band playing against pink background) \n1:16 Björk “Bachelorette” (Audio: Descending harp riff)  \n\n1:17 The Notorious B.I.G. feat. Puff Daddy & Mase & Kelly Price \"Mo Money, Mo Problems\" (Lyrics: \"Now, who's hot, who not ...\") \n1:17 Missy Elliott ft. Da Brat \"Sock it 2 Me\" (Audio: Horns + Video: Missy, dressed as an email icon, in space. Because email is the future!)\n​1:17 Blur \"Song 2\" (Audio: Drums) \n1:21 Stereolab \"Miss Modular\" (Video: Tic-tac-toe grid with flashing lights floating in space)\n1:21 Smash Mouth - Walkin' On The Sun (Audio: Synth melody + Video: Girls dancing, steve harwell with hat and glasses) \n1:25 White Town \"Your Woman\" (Audio: Faint violin riff + Video: Black and white video) \n\n1:35 Daft Punk \"Around the World\" (Lyric: \"Around the world ... \" repeat until the heat death of the universe)\n​1:35 Natalie Imbruglia - Torn (Audio: Acoustic guitar strum) \n1:36 Green Day “Good Riddance (Time of Your Life)” (Audio: Strings + Video: Woman washes a window sadly) \n1:38 Yo La Tengo \"Autumn Sweater\" (Audio: Drums) \n\n1:41 Usher \"Nice and Slow\" (Lyric: \"It's 7 o'clock on the dot\") \n1:43 Ben Folds Five \"Brick\" (Audio: Beautiful piano riff)  \n1:43 Ma$e feat. Total \"What You Want\" (Audio: Shaker and record scratch) \n1:48 Missy Elliott \"The Rain (Supa Dupa Fly)\" (Lyrics: \"Vrrrooom\" + Video: Jeep getting close to camera) \n1:55 Modest Mouse \"Trailer Trash\" (Audio: Faint guitar line)\n​1:55 Third Eye Blind \"Semi-Charmed Life\" (Lyric: \"Doo doo doo. Do. Doo doo dooooo.\" Note: This song was written as an update to Lou Reed's \"Take a Walk on the Wild Side\")   \n\n2:00 Sugar Ray \"Fly\" (Lyric \"All around the world...\")  \n2:00 Natalie Imbruglia \"Torn\" (Audio: Guitar solo + Video: Short haired woman in a track suit top dancing)\n2:03 Beck \"Deadweight\" (Audio: Guiro + Video: Man on ground, shadow standing up. From https://youtu.be/vptfm9D6owo?t=193 ) (Note: Not on list)  \n\n​2:08 Ma$e \"Feel So Good\" (Lyrics: \"Ready Mase? Party people. In the place to be! It's about that time.\" + Audio: Horns)\n2:14 Janet Jackson \"Together Again\" (Audio: harp sounds + Video: dancing) \n\n​2:17 Foo Fighters \"Everlong\" (Vocals: \"If everything could ever feel this real forever...\" + Video: Man wakes up to find legs are logs) \n2:17 Third Eye Blind \"Jumper\" (Audio: Drums)  \n2:20 K-Ci and JoJo \"All My Life\" (Video: Man playing cello)\n​2:22 Chumbawumba \"Tubthumping\" (Lyric: \"We'll be singing. When we're winning\")  \n​2:25 Everclear \"Everything To Everyone\" (Audio: synths + Video: Rotating blue room with siren)  \n2:25 Sarah McLachlan \"Sweet Surrender\" (Audio: Beeping-siren sound) \n2:27 Ben Folds Five \"Brick\" reprise (Audio: Beautiful piano riff)  \n2:40  Harvey Danger “Flagpole Sitta” (Audio: Drum riff)\n\n2:43 Radiohead “Karma Police” (Lyric: “For a minute there, I lost myself” + Video: Man on hands and knees / Car backs up as fire starts)  \n2:43 Blink 182 \"Dammit (Growing Up)\" (Audio: Very faint acoustic guitar riff that continues until 3:09. From https://youtu.be/mybAEqGPQyg?t=122)\n​2:42 Chumbawumba \"Tubthumping\" (Horns)  \n2:47 Next \"Too Close\" (Lyric: \"See that you like it like that ha-ha-ha\" + Video: 3 girls walking on the dance floor)\n​2:51 The Notorious B.I.G. feat. Puff Daddy & Mase & Kelly Price \"Mo Money Mo Problems\" (Lyric: \"I don't know what they want from me…\") \n2:54 Sixpence None The Richer \"Kiss Me\" (Video: Face with accordion, Red-haired woman touches her lips at 3:06) \n3:01 The Mighty Mighty Bosstones \"The Impression That I Get\" (Ska band playing in a white background) \n3:08 Blink 182 \"Dammit (Growing Up)\" (Video: Mark Hoppus spills his popcorn) \n\n3:11 Radiohead \"No Surprises\" (Audio: Epic chord progression to end the song + Video: Man's head in red light & shadow) \n3:17 The Notorious B.I.G. \"Sky's the Limit\" reprise (Video: One last image of (the actor playing) Notorious B.I.G., who was shot and killed in March 1997. Note: The last image in the 1996 video is 2Pac. RIP)\n\nThanks to the contributors:  Ice Climbers, Legolord Films, Sara Kaiser, Chris RJ, Nickster, Blackhammer 123, Peter Sime, Jakob Mueller, unknownlatitude, MorningAngel, The Geecy Project, Brayan Puma, Robert Mahon, Mack R, tinau n., Joey Alvestad, TitaniumNikes, Samuel Mattson, Dalton Randall and thisisdomino!\n\nIn video but not on list: Beck, \"Deadweight\" at 2:03\n\nNot figured out yet: Monifah (probably \"I Still Love You\")  The compilation is based on the year the single was released.",
                "publishedAt": "2021-03-18T05:02:34.000Z"
              }
            }
          }
        }
      ]
    },
    {
      "contentDetails": {
        "duration": 207
      },
      "id": "pnodS29q-Cs",
      "snippet": {
        "title": "60 Songs From 1999 Remixed Into 3½ Minutes",
        "description": "Samples of more than 60 songs from 1999 mixed together into one 3½-minute song by The Hood Internet. Watch the whole ongoing playlist here: http://bit.ly/thi-79-99\n\nFeaturing:\n702, Aimee Mann, Alice Deejay, American Football, Aphex Twin, B.G., Backstreet Boys, Basement Jaxx, Beck, Blink 182, The Bloodhound Gang, Chemical Brothers, Christina Aguilera, Citizen King, Dead Prez, Destiny's Child, Dido, The Dismemberment Plan, DMX, Dr. Dre and Snoop Dogg, Eiffel 65, Eminem, Fiona Apple, The Flaming Lips, Foo Fighters, Guided by Voices, Hot Boys ft. Big Tymers, Jay-Z and UGK, Jennifer Lopez, Kelis, Le Tigre, Len, Lit, Macy Gray, The Magnetic Fields, Mariah Carey and Jay-Z, Missy Elliott, Nas, Eve and Q-Tip, Moby, Montell Jordan, Mr. Oizo, Nas, Nine Inch Nails, No Doubt, Ol' Dirty Bastard (feat. Kelis), Q-Tip, Red Hot Chili Peppers, Santana (feat. Rob Thomas), Sigur Rós, Sisqo, Smash Mouth, Tal Bachman, TLC, Vertical Horizon, Wilco",
        "publishedAt": "2021-03-18T02:49:51Z",
        "thumbnails": {
          "default": {
            "url": "https://i.ytimg.com/vi/pnodS29q-Cs/default.jpg",
            "width": 120,
            "height": 90
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/pnodS29q-Cs/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "high": {
            "url": "https://i.ytimg.com/vi/pnodS29q-Cs/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/pnodS29q-Cs/sddefault.jpg",
            "width": 640,
            "height": 480
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/pnodS29q-Cs/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          }
        }
      },
      "comments": [
        {
          "id": "UgzZwEifXPd_NAlRnDh4AaABAg",
          "snippet": {
            "videoId": "pnodS29q-Cs",
            "topLevelComment": {
              "snippet": {
                "textDisplay": "Let's try this again. Can you help figure out which songs are which?  \n\n0:00 Dr Dre ft Snoop Doog \"Still D.R.E.\" (Audio: Piano riff + Video: Bouncy cars) \n0:02 Sisqo \"Thong Song\" (Audio: Violin + Video: Car)  \n0:05 Dead Prez \"Hip Hop\" (Lyric: \"Uh 1, 2, 1, 2\")   \n\n0:10 TLC \"No Scrubs\" (Lyrics: \"A scrub is a guy that thinks he's fly and is also known as a buster ...\")  \n0:10 Destiny's Child \"Bug-A-Boo\"\n0:13 Citizen King \"Better Days (And the Bottom Drops Out)\" (Audio: Drum fill) \n0:14 Hot Boys ft Big Tymers \"I Need A Hot Girl\" (Audio: Clap-based beat)\n0:18 Moby \"Why Does My Heart Feel So Bad\" (Audio: Piano riff) \n0:19 Destiny's Child \"Bills, Bills, Bills\" (Audio: ) \n0:19 702 \"Where My Girls At\" (Audio: Beat)\n\n0:29 Eminem \"My Name Is\" (Lyric: \"What?\")  \n0:30 Kelis \"Caught Out There\" \n0:36 Red Hot Chili Peppers \"Californication\" (Video: 3d man lying on the ground)\n0:36 Eiffel 65 \"Blue\" (Audio: Laser sound / Piano riff + Video: Blue alien presses button)  \n\n0:45 Lit \"My Own Worst Enemy\" (Audio: Guitar intro) \n0:54 Backstreet Boys \"I Want It That Way\" (Lyrics: \"Tell Me Why\")  \n1:03 Mariah Carey and Jay Z \"Heartbreaker\" (Lyric: \"Give me your love\" + Video: Mariah in a pink top requesting, nay _demanding_, that you give her your love) \n1:07 Blink 182 \"All The Small Things\" (Lyrics: \"Na-na, na-na, na-na\")  \n1:11 Fiona Apple \"Fast As You Can\" (Video: Fiona eats a lit match)  \n\n1:12 Len \"Steal My Sunshine\" (Audio: Piano riff + Lyrics \"Steal my sunshine\")   \n1:16 Red Hot Chilli Peppers \"Scar Tissue\" (Audio: Guitar riff)  \n1:29 The Flaming Lips \"Race For The Prize\" (Audio: Synth strings + Video: Gong hit, conductor in yellow, monster puppet in megaphone, and tuba players)\n1:32 American Football \"Never Meant\" (Audio: Guitar riff + Video: Video with camcorder date stamp, from their performance at the Fireside Bowl)\n1:38 Blink 182 \"Adam's Song\" (Video: Blink walk down the street)  \n1:43 Sigur Rós \"Starálfur\" (Audio: strings and piano)\n1:45 Destiny's Child \"Say My Name\" (Lyric: \"Say my name say my name\")  \n\n2:00 Santana \"Smooth\" (Audio: Iconic guitar riff)  \n2:01 Bloodhound Gang \"The Bad Touch\" (Audio: Bass riff + video: People in monkey costumes dancing)  \n2:02 Backstreet Boys \"Larger Than Life\" (Audio: Talkbox riff + video: Dancers in futuristic blue hall) \n2:19 Dr Dre \"The Next Episode\" (Audio: Horn and string intro)\n2:19 Missy Elliot \"Hot Boyz\" (Video: Fireworks) \n\n2:27 Dr Dre ft Snoop Dogg & Nate Dogg (Lyric: \"Hold up, hey!\")  \n\n2:27 Christina Aguilera \"Genie in a Bottle\" (Audio: Piano riff + Video: Christina lying on a beach) \n2:31 Jay-Z and UGK \"Big Pimpin'\" (Audio: Flute riff) \n2:33 DMX \"Party Up (Up in here)\" (Lyric: \"Woo!\")\n2:36 Chemical Brothers \"Hey Boy Hey Girl\" (Lyric: \"Here we go!\")  \n2:38 Basement Jaxx \"Red Alert\" (Audio: House beat with bass slap) \n2:40 Alice Deejay \"Better Off Alone\" (Audio: Synth melody) \n2:44 Eiffel 65 \"Blue\" (Video: Maury throwing a ball of light at the camera)\n\n2:55 Aphex Twin \"Windowlicker\" (Audio: Beat + Video: Richard D James dances with women with his face) \n2:58 Tal Bachman \"She's So High\" (Video: Woman takes off her cape) \n3:01 Macy Gray \"I Try\" (Video: Macy holding flowers)\n\n3:04 Smash Mouth \"All Star\" (Audio: Whistling + Video: Man dancing)  \n3:06 Blink 182 \"What's My Age Again\" (Video: Band members running naked)\n3:12 Mr Oizo \"Flat Beat\" (Audio: Faint synthy bass + Video: Flat Eric (the yellow puppet) thinking at a desk)  \n3:16 Dido \"Thank You\" (Video: House being bulldozed)\n3:19 Foo Fighters \"Learn To Fly\" (Dave Grohl flying outside a plane window)\n\nThanks to everyone who contributed: Legolordfilms, Nickster, The Geecy Project, Blackhammer 123, WWS12, Jakob Mueller, unknownlatitude and Carver Cordes!\n\nNot figured out yet: Aimee Mann,  B.G., Beck, The Dismemberment Plan, Guided by Voices, Jennifer Lopez, Le Tigre, The Magnetic Fields, Missy Elliott, Nas, Eve and Q-Tip, Montell Jordan, Nas, Nine Inch Nails, No Doubt, Ol' Dirty Bastard (feat. Kelis), Q-Tip, Vertical Horizon, Wilco",
                "publishedAt": "2021-04-01T05:48:15.000Z"
              }
            }
          }
        }
      ]
    },
    {
      "contentDetails": {
        "duration": 206
      },
      "id": "FwnuuFW8Cfk",
      "snippet": {
        "title": "60 Songs From 1996 Remixed Into 3½ Minutes",
        "description": "Samples of more than 60 songs from 1996 mixed together into one 3½-minute song by The Hood Internet. Watch the whole ongoing playlist here: http://bit.ly/thi-79-99\n\nFeaturing:\n112, 2Pac, A Tribe Called Quest, Aaliyah, Aphex Twin, Beck, Belle & Sebastian, BLACKstreet, Busta Rhymes, Butthole Surfers, Cake, The Cardigans, Celine Dion, The Chemical Brothers, Cibo Matto, Coolio, Crucial Conflict, DJ Kool, DJ Shadow, Dr. Dre, Dr. Octagon, Eels, Erykah Badu, Fiona Apple, The Fugees, Ghost Town DJ's, Ginuwine, Goldfinger, Jamiroquai, K-Ci & JoJo, Keith Sweat, Los Del Rio, Mark Morrison, Mase, Monica, Nas, The Notorious B.I.G., Outkast, Paula Cole, Primitive Radio Gods, The Prodigy, Quad City DJ's, Queen Pen, R.E.M., Rage Against The Machine, Reel Big Fish, Republica, Sheryl Crow, Soul Coughing, Spacehog, Spice Girls, Sublime, Supergrass, Toni Braxton, Tool, Tori Amos, The Verve Pipe, Weezer, Xzibit",
        "publishedAt": "2021-03-11T06:00:13Z",
        "thumbnails": {
          "default": {
            "url": "https://i.ytimg.com/vi/FwnuuFW8Cfk/default.jpg",
            "width": 120,
            "height": 90
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/FwnuuFW8Cfk/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "high": {
            "url": "https://i.ytimg.com/vi/FwnuuFW8Cfk/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/FwnuuFW8Cfk/sddefault.jpg",
            "width": 640,
            "height": 480
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/FwnuuFW8Cfk/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          }
        }
      },
      "comments": [
        {
          "id": "UgxG_ecxdS497HlDm394AaABAg",
          "snippet": {
            "videoId": "FwnuuFW8Cfk",
            "topLevelComment": {
              "snippet": {
                "textDisplay": "The complete list of songs with time stamps, as figured out by our excellent community. Well done everyone!!! \n\n0:00 Primitive Radio Gods \"Standing Outside A Broken Phone Booth With Money In My Hand\" (Audio: A coin drops. Faint rattling)\n0:00 Weezer \"El Scorcho\" (Audio: Gargling and Toms)  \n\n0:05 Mark Morrison \"Return of the Mack\" (Lyric: \"Ooooh. Come on. Ooh yeah ...\")\n0:05 Spacehog \"In The Meantime\" (Audio: Guitar, plus faint telephone busy signal)\n0:09 Celine Deion \"It's All Coming Back To Me Now\" (Piano)  \n0:10 Dr. Octagon “Blue Flowers” (growling synth)\n\n0:14 Sublime \"What I Got\" (Lyrics: \"Early in the morning, rising to the street ... \")\n0:14 The Fugees \"Killing Me Softly\" (Audio : Beat) \n0:18 Goldfinger \"Here In Your Bedroom\" (\"Audio: Guitar scratch + Video: Guitarist on a chessboard floor) \n0:21 Tori Amos \"Caught a Light Sneeze\" (Audio: Background percussion + Video: Skyscrapers)\n0:23 Eels \"Novocaine for the Soul\" (Audio: Piano clink + Video: Floating man)  \n0:25 Cibo Matto “Know Your Chicken” (Audio: Drums + Video: Chicken man with Anarchy shirt surprises a couple) \n\n0:35 Butthole Surfers “Pepper” (Fuzzy bassline) \n0:36 2Pac ft.  K-Ci & Jojo \"How Do You Want It\" (Audio : Drum like intro + Video : 2Pac in limo)\n0:40 Cake “The Distance” (Drum fill)\n0:43 Rage Against The Machine \"Bulls On Parade\" (Lyric: \"Come wit it now!\" + Audio: Complex guitar scratching from Tom Morello)\n\n0:44 Beck “Where It’s At” (Lyric: “Where it’s at! I got two turntables and a microphone”) \n0:45 Spacehog \"In The Meantime\" (Lyrics: \"Woo-oo-oo-oo-oo-oo-oo-ooooo\") \n0:45 Reel Big Fish \"Sell Out\" (Audio: Trumpets)\n0:51 Busta Rhymes “Woo Hah! I Got You All In Check” (Lyric : \"Woo hah! Woo hah! Got you all in check. Ha ha\")\n0:53 Quad City DJs “C’mon Ride It (The Train)” (Lyric: “woo-woo!”)\n\n1:00 Los Del Rio \"Macarena\" (Lyric: \"Ah-aight\", repeated)  \n1:00 The Chemical Brothers \"Setting Sun\" (Audio: Sitar from the song's intro + Video: Surprised black cat)\n1:01 Tool “Stinkfist” (Video: A man in a dark room touches a TV)  \n1:03 Sheryl Crow - If It Make You Happy (Sheryl in a red room with a leopard print coat, and a closeup of a rhinoceros at 1:07)\n1:06 DJ Kool \"Let Me Clear My Throat\" (Lyric: \"eh-huh eh-huh eh-huh!\")  \n\n1:07 BLACKstreet ft. Dr Dre and Queen Pen \"No Diggity\" (Lyric : \"Shawty get down, good lord\".... + Video : Puppet playing piano) \n1:09 Spice Girls “Wannabe” (Audio: Organ/piano riff)\n1:10 Toni Braxton \"You're Making Me High\" (Lyric : Uh Uh + Video : Blue background)\n1:13 Ginuwine \"Pony\" (Audio: Drums and bass)  \n1:23 Soul Coughing - Super Bon Bon (drum fill, reddish tinged fish eye view of band in narrow hallway) \n\n1:28 112 ft. The Notorious B.I.G. and Mase \"Only You\" (Audio: beat + Video: Puff Daddy dancing with 112) \n1:30 Fiona Apple “Criminal” (Video: Fiona takes a photo in a dark room, swims in a swimming pool)  \n1:31 Aphex Twin \"Girl/Boy Song\" (Audio: Shaker sound, which is actually incredibly fast drums)\n1:39 A Tribe Called Quest \"1nce Again\" (\"ooh, on and on and on, ooh\")\n1:44 The Fugees “Fu-Gee-La” (Video: People running in a forest setting)\n1:46 Jamiroquai “Virtual Instanity” (Video: Jamiroquai slides along the floor of a futuristic room)\n\n1:50 The Cardigans “Lovefool” (Lyric: “Lately I have desperately pondered...” + Video: Girl reads a newspaper)\n1:50 Outkast \"Elevators\" (Audio: Beat + Video: Andre 3000 with green eyes) \n1:51 Keith Sweat \"Twisted\" (Audio: Synth + Video: Keith as a cop)  \n1:54 Fiona Apple “Sleep To Dream” (Audio: Clicking percussion + Video: Fiona on the floor, looking up)\n1:58 Erykah Bady \"On & On\" (Audio: Beat + Video : Erykah in head scarf performing. Trivia: Andre from Outkast was dating Erykah around this time their breakup inspired Ms. Jackson in 2000)\n2:00 DJ Shadow \"Building Steam With A Grain of Salt\" (Audio: Piano notes)\n\n2:08 Sublime \"Santeria\" (Guitar solo)\r\n2:08 Ghost Town DJs \"My Boo\" (Lyric: \"No\" repeated + Video: Girl washing car, and a party scene)  \n2:10 Nas \"If I Ruled the World (Imagine That)\" (Lyrics: \"ooh\" from Lauryn Hill)  \n2:10 DJ Shadow \"Midnight in a Perfect World\" (Audio: Drums)  \n2:12 Paula Cole \"Where Have All The Cowboys Gone\" (Faint lyric: \"Doo doo doo. Doo doo doo\")\n\n2:19 The Fugees \"Ready or Not\" (Lyrics: \"Ready or not here I come...\")\r  \n2:19 Mark Morrison \"Return of the mack\" (Audio: beat + Lyric: I'm on + Fun fact: The beat of Mark Morrison’s “Return Of The Mack” samples Tom Tom Club’s “Genius Of Love” which appears on the 1981 mashup. “Genius Of Love” was also sampled on Mariah Carey’s “Fantasy” which appears on the 1995 mashup.) \n2:32 Coolio \"1, 2, 3, 4, (Sumpin' New)\" (Video: Car jerking forward)\r\n2:36 Spice Girls \"Wannabe\" (Lyric: \"ha! ha! ha! ha!\")\n\n2:38 Nas ft Lauryn Hill \"If I Ruled The World\" (Lyrics: \"If I ruled the world (imagine that)\" + Video: Lauryn and Nas on top of a car)\n2:38 Weezer \"Falling For You\" (guitar line from the song's intro)  \n2:40 The Wallflowers \"One Headlight\" (Audio: 3-note guitar + Video: clip of a flag dropping down)  \n2:42 Aaliyah \"If Your Girl Only Knew\" (Video: Motorcycles)\n2:43 Monica ft. Treach \"Ain't Nobody\" (Video: Treach in front of a light blue skyline)\n2:44 Outkast \"ATLiens\" (Audio : Beat + Video : Outkast with group of people) \n2:44 Paula Cole - I Don't Want To Wait (Audio: drums)\n2:45 Primitive Radio Gods \"Standing Outside a Broken Phone Booth with Money in My Hand\" (Lyrics: \"I've been downhearted babe, ever since the day we met\")   \n2:44 Belle and Sebastian \"If You're Feeling Sinister\" (Audio: Piano riff)\n2:46 Crucial Conflict \"Hay\" (Video: Dance party in a barn)\n2:52 Republica \"Ready to Go\" (Lyric: \"I'm ready to go\") \n2:56 The Prodigy “Breathe” (Audio: Faint guitar line + Video: Man falling in reverse) \n3:06 The Verge Pipe \"The Freshmen\" (Video: Forlorn guy with the Meg Ryan haircut)\n3:09 Xzibit \"Paparazzi\" (Lyric : \"1996. Like this\" + Video : Xzibit with orchestra group)\n\n3:12 Supergrass \"Going Out\" (Video: Bandstand at night)\n3:14 2Pac ft Danny Boy \"I Ain't Mad At Ya\" (Audio : Piano + Video: Man in white in heaven)  \n3:18 REM \"How the West Was Won and Where It Got Us\" (Video: Camera pan of lights)  \n3:22 Primitive Radio Gods \"Standing Outside A Broken Phone Booth With Money In My Hand\" (Audio: A phone hangs up.)\n\nThanks to all who contributed: Legolordfilms, Ice Climbers, Nickster, Joey Alvestad, Blackhammer 123, The Geecy Project, Chris RJ, Geoff Bartlett, Jakob Mueller, Brayan Puma, Sara Kaiser, Sea Men, Tony Pellum, just a guy and Robert Wile!  \n\nIn video, but not on list: The Wallflowers\n\nNot figured out yet: Nothing! We've found at least one song for each artist on the list. Well done everyone!!",
                "publishedAt": "2021-03-11T06:07:15.000Z"
              }
            }
          }
        }
      ]
    },
    {
      "contentDetails": {
        "duration": 215
      },
      "id": "3uXDh_Ghdso",
      "snippet": {
        "title": "60 Songs From 1995 Remixed Into 3½ Minutes",
        "description": "Samples of more than 60 songs from 1995 mixed together into one 3½-minute song by The Hood Internet. Watch the whole ongoing playlist here: http://bit.ly/thi-79-99\n\nFeaturing:\n2Pac, Alanis Morissette, Annie Lennox, Better Than Ezra, Björk, Blur, Bone Thugs 'n' Harmony, The Boo Radleys, Cap'n Jazz, The Chemical Brothers, Coolio, D'Angelo, Daft Punk, Del Amitri, Dr. Dre, Everclear, The Folk Implosion, Garbage, Gin Blossoms, Goo Goo Dolls, Goodie Mobb, GZA/Genius, Janet Jackson, Junior M.A.F.I.A. and The Notorious B.I.G., LL Cool J, Luniz, Mad Season, Mariah Carey, Matthew Sweet, Method Man & Redman, Mobb Deep, Natalie Merchant, No Doubt, Oasis, Ol' Dirty Bastard, OMC, Pavement, The Pharcyde, PJ Harvey, The Presidents of the United States of America, Pulp, Radiohead, Rancid, The Rentals, Skee-Lo, Smashing Pumpkins, Soul Asylum, Underworld, Van Halen, The Verve, White Zombie",
        "publishedAt": "2021-03-04T06:00:15Z",
        "thumbnails": {
          "default": {
            "url": "https://i.ytimg.com/vi/3uXDh_Ghdso/default.jpg",
            "width": 120,
            "height": 90
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/3uXDh_Ghdso/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "high": {
            "url": "https://i.ytimg.com/vi/3uXDh_Ghdso/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/3uXDh_Ghdso/sddefault.jpg",
            "width": 640,
            "height": 480
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/3uXDh_Ghdso/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          }
        }
      },
      "comments": [
        {
          "id": "Ugy4582Kw3x8JH2YR4V4AaABAg",
          "snippet": {
            "videoId": "3uXDh_Ghdso",
            "topLevelComment": {
              "snippet": {
                "textDisplay": "Alright let's do this! Can you help figure out what songs are in the video, and what time code they're at?  Update: We did it! Well done everyone!!\n\n0:00 Skee-Lo - “I Wish” (Video: man tuning radio)  \n0:00 Soul Asylum \"Misery\" (Lyric: \"1, 2, 1, 2 3 4)\n0:02 Björk \"Army of Me\" (Audio: Crashing sound as title card is displayed)  \n\n0:04 Mariah Carey \"Fantasy\"  (Lyric: \"Oh when you walk by ev-e-ry night...\")\n0:04 No Doubt \"I'm Just A Girl\" (Synth & guitar riff)\n0:09 Mobb Deep \"Shook Ones\" (Audio: Hi Hats)  \n0:11 Mad Season \"River of Deceit\" (Audio: Guitar lick + Video: Fisheye lens with black and grey background)  \n0:11 Matthew Sweet \"Sick of Myself\" (Audio: Noteless guitar strum + Video: Black and white video of man playing guitar) \n0:17 2Pac \"Dear Mama\" (Audio: High three note guitar lick)  \n0:20 Daft Punk \"Da Funk\" (Video: Man with dog head walking around the city)  \n\n0:23 Everclear \"Santa Monica\" (Audio: Guitar riff from cheerful upbeat song about being haunted by the ghost of his dead high school sweetheart.)\n0:25 Björk \"Army of Me\" (Crashing Sound + video of metal truck)  \n0:25 Junior M.A.F.I.A. and the Notorious B.I.G. \"Players Anthem\" (Audio: Clave pattern)\n0:26 Natalie Merchant \"Carnival\" (Video: Woman takes a photo)\n\n0:27 Alanis Morissette \"You Oughta Know\" (Truly, 1995 has entered the house! Lyric: \"I want you to know that I'm happy for you ... \")  \n0:27 The Folk Implosion \"Natural One\" (Audio: Faint bassline and drums + Video: Men in space suits)    \n0:30 Goodie Mob \"Cell Therapy\" (Audio: Piano + Video: Guy standing next to piano with a green background)\n0:36 White Zombie \"More Human Than Human\" (Audio: Synth riff + video: Dancing Jack-o-Lantern)  \n0:43 LL Cool J \"Doin' It\" (Video: Two girls in shorts and crop top)\n0:44 PJ Harvey \"Down By The Water\" (Lyric: \"I lost my heart ...\" + Video: Woman in a red dress)  \n\n0:45 Alanis Morissette \"You Oughta Know\" (Lyric: \"Cos the love that you gave that we made was enabled ... \")\n0:45 Coolio ft L.V. \"Gangsta's Paradise\" (Lyric: \"Aaah\")\n\n1:05 Garbage \"Vow\" (Video: Three TV screens against an orange background) \n1:13 Cap'n Jazz \"Little League\" (Lyric: \"Heeeey!\" + Video: Band playing live from Chicago in 1995)\n1:16 Garbage \"Stupid Girl\" (Audio: Guitars + Video: Shirly Manson walks to the mic stand) \n1:22 Radiohead \"High and Dry\" (Audio: Drums)  \n\n1:23 2Pac ft. Dr Dre \"California Love\" (Lyric: \"California knows how to party\" )  \n1:24 Luniz \"I Got 5 On It\" (Bass and synth bells) \n1:24 Mariah Carey \"Always Be My Baby\" (Lyric: \"Doo doo doo\")  \n1:26 Montell Jordan \"This Is How We Do It\" (Lyric: \"This Is How We Do It\")   \n1:27 The Pharcyde \"Runnin'\" (Lyric: \"Come on come on\")\n1:32 Van Halen \"Can't Stop Loving You\" (Audio: Guitar riff)\n1:33 Oasis “Wonderwall” (Guitar chords + video of Noel Gallagher playing in the guitar)\n1:39 Annie Lennox “No More I Love Yous” (High pitched “ah!” + video of ballerina’s feet)  \n1:42 Oasis “Don’t Look Back In Anger” (drum fill + drummer  playing in pool)\n\n1:42 Montell Jordan \"This is How We Do It\" (Lyric: \"I'm kinda buzzed and it's all because ...\") \n1:42 Oasis \"Wonderwall (Guitar chords continue)  \n1:42 D'Angleo \"Lady\" (Audio: Beat)\n1:43 The Rentals - “Friends of P” (“woo-hoo-hoo” + B&W video of two women singing in front of a man)  \n1:55 Ol Dirty Bastard - “Shimmy Shimmy Ya” (dancers on a dance floor with purple background)  \n1:57 Janet Jackson \"Runaway\" (Lyric: \"And I know we'll have a good time\" + Video: Janet dancing with people of many cultures against a blue cloud / backflip at 2:04)  \n\n2:00 Better Than Ezra - “Good” (Lyric: \"So good\"  + Audio: Bassline)   \n2:00 The Chemical Brothers \"Leave Home\" (Audio: Beat with record scratches)\n2:00 GZA / Genius \"Liquid Swords\" (Pulsing guitar)  \n2:00 The Presidents Of The United States Of America \"Peaches\" (Audio: 2 note guitar riff + Video: Overhead shot of 3 man band)\n2:02 Method Man & Redman \"How High\" (Video : Meth and Red in front of smoking van) \n2:05 Pulp \"Sorted for E's and Wizz\" (Video: Group performing on Top of the Pops)\n\n2:10 Smashing Pumpkins “1979” (Percussion + kids rolling in a giant wheel”)\n2:10 Underworld “Born Slippy” (Audio: Synth chords)   \n2:11 The Boo Radleys \"Wake Up Boo!\" (Lyric: Wake up, it's a beautiful morning + Video: Band plays in front of a sun)  \n2:16 Bone Thugs N Harmony “1st of tha Month” (Lyrics: “Wake up, wake up”)  \n2:19 Bjork \"Hyperballad\" ( Lyric: “I go through all this before you wake up” + Video of Björk lying down as the camera pans around her head)\n\n2:32 Rancid \"Time Bomb\" (Audio: Organ Riff + Video: Man running down the street)\n2:33 Pulp - “Common People” (Piano notes + woman shaking her hair on the dance floor)  \n2:35 Pavement \"Father To A Sister Of Thought\" (Clean guitar riff)\n2:40 Alanis Morrissette - “Ironic” (Alanis looks behind her car to find...the kids in the 1979 video.)  \n2:44 No Doubt \"Spiderwebs\" (guitar riff with pinch harmonics, drum fill)  \n\n2:46 Oasis \"Champagne Supernova\" (lyrics: “Slowly walkin down the hall, faster than a cannonball ...” )  \n2:46 The Presidents of the United States of America \"Lump\" (Audio: drum part with a lot of splash cymbal)  \r\n2:47 Smashing Pumpkins - “Tonight, Tonight” (String quartet + Video: Old-timey couple jumping. Fun fact: The man is Tom Kenny, better known as the voice actor for Spongebob Squarepants)  \n2:58 Goo Goo Dolls \"Name\" (Video: Black & white video of a man playing acoustic guitar)\n2:59 Del Amitri \"Roll To Me\" (Video: Blonde woman with short hair sultrily pushing a pram in somewhere like California)  \n\n3:02 Blur \"The Universal\" (Audio: Strings + Video: Blur playing in the white milk bar from A Clockwork Orange) \n3:05 Radiohead “Fake Plastic Trees” (Lyric: “She looks like the real thing” + Video: Thom Yorke sitting in a shopping trolley) \n3:09 The Verve \"History\"\n3:15 OMC \"How Bizarre\" (Lyric: \"Every time I look around\")  \n\n3:22 Gin Blossoms \"Until I Hear It From You\" (Guitar riff)\n3:23 Alanis Morrisette \"Ironic\" (Lyric: \"Yeah. Yeah eh eh eh\")\n\nThanks Ice Climbers, Legolord Films, The Geecy Project, Joey Alvestad, Chris RJ, Steve Pettifer, Jakob Mueller, Blackhammer 123, KillDeer, Geoff Bartlett, David White and Tobias Brown!\n\nNot found yet: Nothing! We've found at least one song for each artists in the list! Well done everyone!!",
                "publishedAt": "2021-03-04T06:19:18.000Z"
              }
            }
          }
        }
      ]
    },
    {
      "contentDetails": {
        "duration": 211
      },
      "id": "yAux93_DROw",
      "snippet": {
        "title": "60 Songs From 1994 Remixed Into 3½ Minutes",
        "description": "Samples of more than 60 songs from 1994 mixed together into one 3½-minute song by The Hood Internet. NEW! Spotify playlist of all the samples used → http://spoti.fi/2MHNqI3\nWatch the whole ongoing playlist here: http://bit.ly/thi-79-99\n\nFeaturing:\nAaliyah, Alice In Chains, Beastie Boys, Blur, Bone Thugs-n-Harmony, Boyz II Men, Brandy, Brownstone, Bush, Common, Craig Mack, The Cranberries, Crystal Waters, Da Brat, Dinosaur Jr, The Dust Brothers, Edwyn Collins, Elastica, Elton John, Gang Starr, Green Day, Hole, Ini Kamoze, Jawbreaker, Jeff Buckley, The Jesus and Mary Chain (feat. Hope Sandoval), Jon Spencer Blues Explosion, Lisa Loeb and Nine Stories, Madonna, MC 900 ft Jesus, Method Man, Nas, Nine Inch Nails, Nirvana, NOFX, Notorious B.I.G., Oasis, The Offspring, Pavement, Pearl Jam, Portishead, R.E.M., Seal, Sonic Youth, Sophie B. Hawkins, Soundgarden, Stone Roses, Stone Temple Pilots, Sunny Day Real Estate, TLC, Veruca Salt, Warren G (feat. Nate Dogg), Weezer",
        "publishedAt": "2020-10-29T05:00:21Z",
        "thumbnails": {
          "default": {
            "url": "https://i.ytimg.com/vi/yAux93_DROw/default.jpg",
            "width": 120,
            "height": 90
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/yAux93_DROw/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "high": {
            "url": "https://i.ytimg.com/vi/yAux93_DROw/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/yAux93_DROw/sddefault.jpg",
            "width": 640,
            "height": 480
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/yAux93_DROw/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          }
        }
      },
      "comments": [
        {
          "id": "UgyewSDdkDE-Yugc9ut4AaABAg",
          "snippet": {
            "videoId": "yAux93_DROw",
            "topLevelComment": {
              "snippet": {
                "textDisplay": "The complete list:  \n0:00 Bone Thugs n Harmony \"Thuggish Ruggish Bone\" (Guitar harmonics)\n0:03 Weezer “Undone (The Sweater Song)” (Audio: Drum roll + Video: Band silhouettes)\n\n0:05 Portishead “Sour Times” (Audio: Chiming bell and Bassline + Video: Black and white Beth Gibbons lying on a hospital bed)\n0:06 Stone Temple Pilots \"Interstate Love Song\" (Audio: Lead guitar + Video: Rooftop of the New Million Dollar Hotel, with a violet sky)\n0:10 Beastie Boys “Sure Shot” (Audio: Flute + Video: 3 men in tuxedos)\n0:13 Weezer “Say It Ain’t So\" (Lyric: “Oh yeah, alright”)\n\n0:19 Weezer “Say It Ain’t So” (Audio: Guitar noise and riff)\n0:19 TLC “Creep\" (Lyric: “Oh ah, oh ah, oh ah.\"+ Video: Woman wearing silk in front of pink, red and black backgrounds) \n\n0:28 TLC \"Creep\" (Lyric: \"So I creep. Yeah-air.\") \n0:29 Warren G feat. Nate Dogg “Regulate\" (Audio: Whistling. + Note: The keyboard riff is from Michael McDonald's \"I Keep Forgetting\", featured in the 1982 mashup)\n0:31 Brandy “Baby” (Lyric: \"Yeah yeah yeah yeah yeah yeah\" Video: Brandy in all white) \n0:34 The Offspring “Self Esteem” (Lyric: “Yeah! Yeah! Yeah!\" + Video: Guitarist with black t-shirt and dreads)\n\n0:37 Edwyn Collins “A Girl Like You\" (Audio: Lead guitar riff + Video: Guitarist with white guitar)\n0:38 Brandy “Baby\" (Lyric: “Baby baby baby baby.\" + Video: White-clothed woman singing “Baby baby baby etc”) \n0:41 TLC \"Creep\" (Lyric: \"Baby\" + Video: Blue silk woman next to maroon wall)\n0:42 Brandy \"Baby\" (Lyric: \"Don’t you know that you’re so fine?” + Video: Woman in white again)\n0:44 Boys II Men “On Bended Knee” (Lyric: “Baby” + Video: Red-tinted video of man with painting)\n0:46 The Notorious B.I.G. “Juicy” (Lyric” Baby baby” + Video: Yellow basketball shirt man in front of a doorway)\n0:47 Edwyn Collins “A Girl Like You” (Audio: Guitar riff continues + Video: Silhouette of a woman against a white backdrop) \n0:47 Brandy \"Baby\" (Lyric: \"Baby baby baby baby\")\n0:50 Seal “Kiss From A Rose” (Lyric: “Baby!” + Video: Black-clothed man)\n0:51 Brandy \"Baby\" (Lyric: \"Think about you all the time\")\n0:54 The Notorious B.I.G. “Big Poppa” (Lyric: “Baby!” + Video: Red tinted big guy in grandpa cap)\n\n0:56 Aaliyah “Back and Forth” (Lyric” Let me see you back and forth, now check it” (x4) + Video: Woman in mask dances)  \n0:57 Method Man \"Bring the Pain\" (Audio: Single piano note)\n0:56 Craig Mack “Flava In Ya Ear” (Audio: Faint Horn + Video: Man stands beneath a globe wearing a lightning bolt shirt)\n0:58 Stone Roses “Love Spreads” (Video: Silver dolphin toy)\n1:01 Soundgarden “Spoonman” (Lyric: “Come on come on” + Video: Man performs with spoons)\n1:02 The Notorious B.I.G. “Big Poppa” (Audio: High Synth + Video: Big man in red light)\n\n1:06 Da Brat \"Funkdafied\" (Lyric: “So. So. So funkdafied”)\n1:06 Nine Inch Nails “Closer” (Trent Reznor has a nice sing-song about what brings him closer to The Lord + Video: Trent Reznor spinning in mid air, video of pig’s head spinning + Audio: Big beats and baseline)\n1:10 The Notorious B.I.G. “Big Poppa” (Audio: High Synth)\n1:15 Jon Spencer Blues Explosion “Bellbottoms” (Audio: Bass riff + Video: Man in red plays the guitar, diagonally + Note: This track appears in the opening scene of the movie Baby Driver)\n\n1:15 Weezer “Undone (The Sweater Song)” (Lyric: “If you want to destroy my sweater…” + Video: Geeky band in blue room)\n1:15 Green Day “When I Come Around (Audio: Guitar/ bass riff )\n1:16 Soundgarden “Spoonman” (Audio: Subtle percussion - hitting spoons together)\n1:17 Oasis “Live Forever” (Audio: guitar riff + Video: Noel Gallagher plays guitar with psychedelic colours) \n1:18 Weezer \"Buddy Holly\" (Lyric: \"Oh, oh\" + Video: Guitarist wearing a tie and beige cardigan)\n1:20 Bush “Glycerine\" (Video: Guitarist with red t-shirt on black stage)\n1:25 Nas  “It Ain’t Hard To Tell” (Video: Man in red with red sideways cap)\n1:33 Weezer “Buddy Holly” (Lyric “Woah woah-oh” + Video: Old fashioned band wear matching cardigans at the diner from Happy Days) \n\n1:35 Boyz II Men “On Bended Knee” (Audio: Piano riff + Men in purple in the rain with horn players in the background)\n1:36 Madonna “Secret\" (Lyric: \"Mmmm mmm\"  + Video: Madonna in black and white)\n1:37 Nine Inch Nails “Closer” (Audio: Percussion)\n1:38 Green Day “Longview\" (Audio: Guitar riff + Video: Feathers fall through the air)\n\n1:41 The Notorious B.I.G. “Juicy\" (Lyric: “It was all a dream, I used to read Word Up magazine”)\n1:41 Elton John “Can You Feel The Love Tonight” (Audio: Synth piano + Video: Elton John superimposed onto a cartoon)\n1:41 Dinosaur Jr “Feel The Pain (Audio: Clean guitar riff and chugs + Video: A golf cart drives backwards down a street / Man by streetlight at 1:47) \n1:46 Green Day “Basket Case” (Audio: Bass lick + Video: Bass guitarist in orange plays a riff)\n1:47 Pavement “Cut Your Hair” (Lyric: “woo-oo oo-oo oo-oo” + Video: Group walks into a room)\n1:49 Soundgarden “Black Hole Sun” (Audio: Drum Fill + Video: A meeting for People With Terrifying Smiles)\n\n1:51 Notorious B.I.G. “Juicy” (Lyric: “I let my tape rock til my tape pop…”)\n1:51 Madonna “Secret\" (Madonna lying down)\n1:54 Jesus and Mary Chain feat Hope Sandoval “Sometimes Always” (Audio: Hope Sandoval sings + Video: Man and woman at a bar)\n1:55 Green Day “Basket Case\" \n1:56 Gang Starr \"Mass Appeal\" (Video: Record spins)\n1:57 Common \"I Used To Love H.E.R.\" (Lyric: “Yes yes y'all, and you don’t stop. To the beat y’all, and you don’t stop…”)\n\n2:00 Notorious B.I.G. “Juicy” (Lyric: \"Remember Rappin' Duke? Duh-ha, duh-ha. You never thought that hip-hop would take it this far\")\n2:01 REM “Whats the Frequency Kenneth” (Audio: Guitar riff + video: Flashing red and blue lights \n2:06 Beastie Boys “Sure Shot” reprise (Lyric: “Cos you can’t, you won’t and you don’t stop…” x 2)\n\n2:10 Notorious B.I.G. “Juicy” (Lyric: \"I'm blowin up like you thought I would. Call the crib, same number, same hood, it's all good\")\n2:10 The Cranberries “Ode To My Family\" (Lyric: “Doo doo-doo doo” + Black & white video of Dolores O’ Riordan (Rest In Peace) \n2:10 Pavement \"Cut Your Hair\" (Audio: Guitar solo + Video: A man holds a cat at 2:14)\n2:12 Boyz II Men \"Water Runs Dry\" (Video: String orchestra dressed in white)\n2:15 Pearl Jam \"Better Man\" (Video: Guitarist wearing a yellow t-shirt at a live concert)\n2:17 NOFX “Don’t Call Me White\" (Video: Drummer with green hair)\n\n2:20 TLC “Waterfalls” (Lyric: “Don’t go chasing waterfalls…” + Video: A cloud, close up)\n2:20 Sophie B Hawkins “As I Lay Me Down” (Audio: Shaker and Clave beat)\n2:23 Boyz II Men \"Water Runs Dry\" (Lyric: “Don’t do it baby”)\n2:26 Weezer “Undone (Sweater Song)” (Audio: Feedback)\n2:29 Lisa Loeb and Nine Stories “Stay (I Missed You)” (Video: Woman in black stands against a wall, near a cat)\n2:33 Brownstone \"If You Love Me\" (Three people behind a window, wet with rain)\n2:36 Pavement “Cut Your Hair” (Lyric: “Oo-oo oo-oo oo-oo.”)\n\n2:39 TLC \"Waterfalls\" (Lyric: \"Moving too fast... .\" (repeated) )\n2:39 Elastica “Connection” (Audio: Synth guitar riff + Video: Elastica on television)\n2:39 Nine Inch Nails \"Closer\" (Audio: Chords + Video: Insects)\n2:40 Jeff Buckley “Last Goodbye\" (Audio: Slide guitar + Video: Man waves his hand in front of his face)\n2:42 ? ? (Black dots explode on grey background)\n2:43 Weezer “Buddy Holly” (Audio: Claps + Video: The Fonz from Happy Days)\n2:47 Blur “Girls and Boys\" (Video: An incandescent light and two hands+ Fun fact: Blur’s Damon Albarn and Elastica’s Justine Frischmann dated in the 90’s so it’s great they were put together here)\n2:47 The Offspring – “Come Out And Play (Keep ‘Em Separated)” (Audio: drum clicking + Video of drummer hitting hi-hat stand) \n2:51 Jawbreaker \"Boxcar\" (Video: Live band on a dark stage. From \"Live in Dayton\".)\n2:53 Elastica “Connection” (Audio: Synth guitar riff anacrusis)\n\n2:54 Veruca Salt “Seether” (Lyric: “ow!” + Video: cat jumping onto another cat)\n2:54 Elastica “Connection” continues (Audio: Synth guitar riff)\n2:55 Hole “Miss World” (Video: Band in front of “Cleanliness is next to Godliness” sign) \n2:57 Dust Brothers \"Chemical Beats\" (Audio: Bass drum beats, which replace the synthy bass drums from Elastica's \"Connection\". The Hood Internet can mix!)\n2:57 Sonic Youth “Bull in The Heather” (Audio: guitar riff + Video of band jumping around in pink background)\n3:01 Weezer “Buddy Holly” (Audio: Rivers Cuomo’s sick guitar riff)\n\n3:03 Crystal Waters “100% Pure Love” (Lyric: “From the back to the middle and around again...” + Video: Decibel Meter)\n3:04 MC 900 ft Jesus “If I Only Had A Brain” (Video: Man tumbling around inside a cardboard box)\n3:07 Ini Kamoze “Here Comes The Hotstepper” (Audio: echoed “Hey!”)\n\n3:11 Beastie Boys “Sabotage” (Audio: bass riff + Video of three moustached cops driving a vintage car, jumping downs staircases, jumping into pools)\n3:11 Nirvana “The Man Who Sold The World” (Audio: guitar riff + Video of Kurt Cobain in the band’s iconic MTV Unplugged set)\n3:18 Beastie Boys “Sabotage” (Lyric: “Wooooahhhhh!” + Video: Car chase / detective tackles man into a pool)  \n3:23 Alice In Chains \"No Excuses\" (Audio: Drums + Video: Man and monkey)\n3:23 Crystal Waters \"100% Pure Love\" (Video: Male dancers silhouetted against white wall)\n3:24 Sunny Day Real Estate “Seven” (Video: Blond Drummer in black and white)\n\nThanks to the amazing contributors: The Geecy Project, Julio Diaz, Jakob Mueller, Joey Alvestad, Legolordfilms, Pete Sturman, Jen S, thecandidcastaway, tubusaur, CrazyRaider77, Dylan Wilbanks, Waylon Baumgardnen, davebrubeck and C/!\n\nNot figured out yet: \nNothing! We've figured it all out! Well done everybody!!",
                "publishedAt": "2020-10-29T05:09:03.000Z"
              }
            }
          }
        },
        {
          "id": "UgxTy-VMwFarlHrg_JR4AaABAg",
          "snippet": {
            "videoId": "yAux93_DROw",
            "topLevelComment": {
              "snippet": {
                "textDisplay": "2:20 - right after the heart of the song...\n2:39 - ...they hype you up with an \"intro to the grand finale\".  That's masterful.  \n......... but DON'T let it be the end!!!",
                "publishedAt": "2020-11-18T23:55:58.000Z"
              }
            }
          }
        }
      ]
    },
    {
      "contentDetails": {
        "duration": 211
      },
      "id": "IKu6LXIaOpk",
      "snippet": {
        "title": "60 Songs From 1993 Remixed Into 3½ Minutes",
        "description": "Samples of more than 60 songs from 1993 mixed together into one 3½-minute song by The Hood Internet. NEW! Spotify playlist of all the samples used → http://spoti.fi/3e2Ec4x\nWatch the whole ongoing playlist here: http://bit.ly/thi-79-99\n\nFeaturing: \n2Pac (feat. Digital Underground), 95 South, Ace Of Base, Aerosmith, Beck, Billy Joel, Björk, The Breeders, Buffalo Tom, Collective Soul, Counting Crows, Cranberries, Crash Test Dummies, Cypress Hill, De La Soul, Dinosaur Jr., En Vogue, Enigma, Haddaway, Ice Cube, James, Janet Jackson, KRS-One, The Lemonheads, Lenny Kravitz, Liz Phair, Mariah Carey, Mazzy Star, Meat Loaf, The Mighty Mighty Bosstones, Naughty by Nature, New Order, Nirvana, Onyx, Pearl Jam, PJ Harvey, Red Hot Chili Peppers, Robin S., Salt-n-Pepa, Sheryl Crow, Smashing Pumpkins, Snoop Doggy Dogg, Souls of Mischief, Suede, Tag Team, Teenage Fanclub, Tom Petty & the Heartbreakers, Toni Braxton, Tool, U2, Wu-Tang Clan, Zhane",
        "publishedAt": "2020-10-22T05:00:12Z",
        "thumbnails": {
          "default": {
            "url": "https://i.ytimg.com/vi/IKu6LXIaOpk/default.jpg",
            "width": 120,
            "height": 90
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/IKu6LXIaOpk/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "high": {
            "url": "https://i.ytimg.com/vi/IKu6LXIaOpk/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/IKu6LXIaOpk/sddefault.jpg",
            "width": 640,
            "height": 480
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/IKu6LXIaOpk/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          }
        }
      },
      "comments": [
        {
          "id": "UgxXlJXGybeUo-SYDlJ4AaABAg",
          "snippet": {
            "videoId": "IKu6LXIaOpk",
            "topLevelComment": {
              "snippet": {
                "textDisplay": "Here's my first pass, I know I'm missing a lot but it's a strong start. Great year!\n\n0:00 The Breeders - \"Cannonball\" (percussion, video: cannonball rolls down street)\n0:08 U2 - \"Numb\" (guitar, video: The Edge looks at camera in black and white)\n0:17 \"Cannonball\" again (bassline, women with guitars)\n0:19 Ace of Base - \"The Sign\" (video: Very Swedish people, lyrics \"I saw the sign\" come in at 0:25 )\n0:27 Aerosmith - \"Cryin' \" (Alicia Silverstone prepares to bungee jump, gets robbed, takes revenge, gets set to get pierced)\n0:38 Liz Phair - \"Never Said\" (Liz on the beach with guitar)\n0:44 En Vogue w. Salt N Pepa - \"Whatta Man\" (ladies dance, \"whoop!\")\n0:45 Tom Petty - \"Mary Jane's Last Dance\" (Tom dances with dead girl)\n1:02 Lenny Kravitz - \"Are You Gonna Go My Way\" (Lenny sings \"But what I really wanna know is...\")\n1:05 Haddaway - \"What is Love?\" (Lyric: \"What is love?\")\n1:15 Onyx - \"Slam\" (cars bounce, lyrics: \"Dut duh-duh\")\n1:16 Snoop Doggy Dogg - \"Gin & Juice\" (lyric: \"With my mind on my money and my money on my mind, video: Snoop on a bike)\n1:22 Smashing Pumpkins - \"Disarm\" (child's toy in black and white)\n1:31 Crash Test Dummies - \"Mmm Mmm Mmm Mmm\" (band with guitars)\n1:32 \"Disarm\" again (drums)\n1:41 \"Mmm Mmm Mmm Mmm\" again (band)\n1:43 Cypress Hill - \"Insane in the Brain\" (group on stage, distorted visuals, bassline)\n1:46 Salt N Pepa - \"Shoop\" (ladies on stage, lyrics \"Shoop, shoop-ay-oop\")\n1:51 Beck - \"Loser\" (guitar, Beck in black and white)\n2:00 Tag Team - \"Whoomp! There It Is\" (Whoomp! appears on screen, lyric \"Whoomp! There it is\")\n2:10 Bjork - \"Human Behavior\" (giant teddy bear nearly hit by a car)\n2:18 Smashing Pumpkins - \"Today\" (guitar line starts, desert road)\n2:19 \"Cannonball\" again (\"Check check check awoooo-oooo,\" lips underwater)\n2:23 Collective Soul - \"Shine\" (guitars on screen and in mix)\n2:26 Tool - \"Sober\" (stop-motion animation)\n2:37 Mariah Carey - \"Dreamlover\" (Mariah sings in the tall grass)\n2:48 \"Slam\" again (people pogoing and chanting \"dut-duh-duh:\")\n2:54 Naughty By Nature - \"Hip Hop Hooray\" (Video: Rappers in front of Naught By Nature graffiti, lyric \"Hip hop hooray\")\n3:01 \"Today\" again (Billy Corgan paints the ice cream truck, the guitar line has been constant since 2:18)\n3:09 Mighty Mighty Bosstones - \"Someday I Suppose\" (horn players)\n3:13 James - \"Laid\" (guitar line starts, video kicks in at 3:18 with man dancing in kitchen)",
                "publishedAt": "2020-10-22T05:38:36.000Z"
              }
            }
          }
        },
        {
          "id": "UgzCZxWV5GMWllPC0vF4AaABAg",
          "snippet": {
            "videoId": "IKu6LXIaOpk",
            "topLevelComment": {
              "snippet": {
                "textDisplay": "Let’s figure out which songs are which. Can you help fill in the blanks?\n\n0:00 Pearl Jam \"Daughter\" (Lyric: “Ready?” + Audio: Drum sticks)\n0:01 Enigma \"Return to Innocence\" (Lyric: \"Ooo why yiy hi. You why eye ya\"+ Video of apple rising up to trees + Video of girl and horse running backwards in forest)\n0:01 ? ? (Audio: Footsteps)\n0:02 The Breeders \"Cannonball\" (Audio: percussion + Video: A cannonball rolling down street / A guy hits a microphone stand with a stick) \n0:05 ? ? (Audio: Bass drum and record scratches)\n\n0:08 Zhane \"Hey Mr DJ\" (Lyric: “Everybody. Move your body. That’ll do it….”)\n0:08 U2 \"Numb\" (Audio: Flanged guitar stab + Video of The Edge in a bandana looking at the camera while people stick their feet in his face) \n0:10 Ace of Base \"The Sign\" (Lyric: “Ooh ooh ooh ooh ooh”, with black and white video of women)\n \n0:12 Zhane \"Hey Mr DJ\" (Lyric: \"Here is something. That's gonna make you move and groove\")\n0:13 Sheryl Crow \"All I Wanna Do\" (Audio: Scraped guiro + Video: Scraped guiro at 0:16)\n\n0:17 Zhane \"Hey Mr DJ\" (Lyric: “Hey DJ keep playing this song. Of mine.”) \n0:17 Mazzy Star \"Fade Into You\" (Audio: Piano note)\n0:17 Wu-Tang Clan \"Method Man\" (Lyric \"Hey\" repeated)\n0:17 The Breeders \"Cannonball\" (Audio: Bassline + Video: 2 female guitarists) \n0:21 Ace of Base \"The Sign\" (Video: Very Swedish People) \n\n0:22 Zhane \"Hey Mr DJ\" (Lyrics: \"On and on and on and on\")\n0:23 Dinosaur Jr \"Start Choppin'\" (Audio: Strummed guitar chord)\n0:24 Ace of Base \"The Sign\" (Lyric: “Is enough enough?”)\n\n0:26 Ace of Base “The Sign” (Lyric: “I saw the sign. And it opened up my eyes I saw the sign.”) \n0:26 Aerosmith \"Cryin'\" (Audio: Harmony with a lot of “oohs” + Video: Alicia Silverstone prepares to bungee jump, get robbed at 0:33, take revenge with flying kick at 0:34, and get a piercing from a bike courier at 0:38) \n0:30 Buffalo Tom \"Sodajerk\" (Video: Guitarist in black and white, and tree at 0:39) \n0:35 Liz Phair \"Never Said\" (Lyric: “Aaah-aah-aaee” + Video: Woman playing a guitar on a beach) \n0:43 Ace of Base \"The Sign\" (Video: Man points at the camera. Woman in red dress points up)\n\n0:44 En Vogue with Salt n Pepa “What a Man” (Lyric: Short “Ooh” + Audio: Guitar, bass and drum riff)\n0:46 Tom Petty and the Heartbreakers \"Mary Jane's Last Dance\" (Audio: Long \"Woo\" + Video: Tom Petty dances with a corpse in an room full of candles) \n0:46 ? ? (Lyric: “Alright”)\n0:47 Ace of Base \"All That She Wants\" (Lyric: “But where do you belong?” + Audio: Brass Sting + Video: Woman putting on lipstick) \n0:47 Nirvana \"Scentless Apprentice\" (Audio: Drum riff and again at 0:52)\n0:50 Counting Crows “Mr Jones” (Lyric: “Wah ha”) \n0:53 Ace of Base \"All That She Wants\" (Bass saxophone riff) \n0:54 Haddaway \"What is Love\" (Lyric: “Woah-oh oh-oh wahahaha ho” + Video: Woman wrapping herself in a black cloak ) \n1:01 ? ? (Video: Someone is having a bath)\n\n1:02 Lenny Kravitz \"Are You Gonna Go My Way\" (Lyric: “But what I really want to know is…”) \n1:05 Haddaway \"What Is Love\" (Lyric: “What is love?”) \n1:05 2pac feat. Digital Underground \"I Get Around\" (Audio: Warm synths & Hip Hop beat + Video: 2pac, the man with the Thug Life tattoo, dances in the park)\n1:06 Janet Jackson \"That's The Way Love Goes\" (Lyric: “That’s the way love goes”) \n1:09 De La Soul \"Breakadawn\" (Lyric: \"a-one-two, a-one-two\") \n1:12 ? ? (Video: A crowded dance floor)\n\n1:13 Janet Jackson \"That's The Way Love Goes\" (Lyric: “That’s the way love goes”) \n1:14 Wu-Tang Clan \"C.R.E.A.M.\" (Audio: Piano ) \n1:15 Onyx \"Slam\" (Lyric: \"Duh duh duh. Duh duh duh.\" + Video: Rappers in front of a factory next to bouncy cars)\n1:16 Snoop Dogg \"Gin and Juice\" (Lyric: “Got my mind on my money and my money on my mind” + Video: Snoop on a bike with a friend) \n1:22 Billy Joel \"River of Dreams\" (Video: Man plays a hand drum in front of a river)\n1:23 Smashing Pumpkins \"Disarm\" (Video: Dude's face from below / Mask / Black and white video of a spinning toy)  \n\n1:24 Robin S \"Show Me Love\" (Lyric: “I’m tired of getting caught up. In those one night affairs.”) \n1:24 Souls of Mischief \"93 Til Infinity\" (Audio: Siren + Video: Man in a white v-necked jumper looks annoyed, )\n1:24 Smashing Pumpkins \"Disarm\" (Video: Dude's face from below / Mask)\n1:28 Janet Jackson \"Because of Love\" (Lyric: \"Shoop da nam. Shoop shoop da nam”)\n1:31 Crash Test Dummies \"Mmm Mmm Mmm Mmm\" (Lyric: \"aaaAAAH\" + Video: Long haired band in theatre) \n1:31 Smashing Pumkins \"Disarm\" (Black and white Timpani drums)  \n\n1:32 Robin S \"Show Me Love\" (Lyric: “What I really need is somebody. Who will always be there.”)\n1:32 Smashing Pumpkins \"Disarm\" (Audio: subtle orchestral hits + Video: Billy Corgan in black and white) \n1:37 Janet Jackson \"Because of Love\" (Dancer in a purple video) \n\n1:40 Tag Team \"Whoomp! There it is!\" (Lyric: \"par-TY peo-PLLLLLe, yeahhhh) \n1:41 Cypress Hill \"Insane in the Brain\" (Audio: High pitched neighing. DJ scratch + Video: Hip hop artists in front of a crowd. Bearded man.)\n1:41 ? ? (An underwater camera looks up to the surface)\n1:41 PJ Harvey \"50ft Queenie\" (Someone wears a leopard skin top) \n1:46 ? ? (Girl band)\n\n1:46 Salt n Pepa \"Shoop\" (Lyric: “Shoop. Shoop eh doop…”) \n1:46 Beck “Loser” (Audio: Guitar riff + Video: A skeleton cleans someone’s windscreen)  \n1:55 Beck “Loser” (Lyric: “I’m a driver, I’m a winner. Things are gonna change. I can feel it.”) \n1:55 Aerosmith \"Livin on the Edge\" (Audio: Guitar riff)\n\n2:00 Tag Team \"Whoomp! There It Is\" (Lyric: “Whoomp! There it is!”) \n2:00 Aerosmith \"Livin' on the Edge\" continues (Audio: High guitar riff) \n2:00 Nirvana \"All Apologies\" (Audio: Low guitar riff)\n2:00 Beck “Loser” continues (Audio: Guitar rhythm riff and percussion + Video: Beck dances) \n2:00 Cypress Hill \"Insane in the Brain\" continues (Audio: Squeals)  \n2:03 Aerosmith \"Livin' on the Edge\" (Lyric: “Everybody”) \n\n2:07 95 South \"Whoot There It Is\" (Lyric: \"Whoot! There it is!\")\n2:10 Bjork \"Human Behaviour\" (Video of giant teddy bear, woman with car passing above her, butterfly at window) \n2:00 Beck \"Loser\" (Lyric: \"Cut it\")\n\n2:18 Smashing Pumpkins \"Today\" (Audio: Guitar riff + Video: An ice cream truck on a desert road) \n2:18 The Breeders \"Cannonball\" (Lyric: \"Check check check. A-oooh-oooh ...\" + Video: Purple lips underwater)\n2:21 Smashing Pumpkins \"Cherub Rock\" (Audio: Drum roll) \n2:22 Collective Soul \"Shine\" (Audio: Guitar riff)\n2:27 Tool \"Sober\" (Audio: Bass riff + Video: An astronaut carries a crate) \n2:31 Collective Soul \"Shine\" (Lyric: “Yeah” + Audio: High bass riff) \n\n2:32 Nirvana \"All Apologies\" (Audio: Guitar Riff + Video: Kurt Cobain in a yellow dress)\n2:34 Smashing Pumpkins \"Cherub Rock\" (Audio: Rising bass and drums + Video of multi-coloured lights in forest) \n2:36 Red Hot Chili Peppers \"Soul to Squeeze\"  (Audio: High Bass riff + Video: Black and white guitarist sits in a doorway) \n2:37 Mariah Carey \"Dreamlover (Lyric: “Doo Do-do-do Do-do Doo. Ooh-ooh-oooooh. Baby” + Video of woman singing in field?)\n2:37 The Lemonheads \"Into Your Arms\" (Audio: Slow strummed guitar + Video: Evan Dando next to a tree looking up) \n2:43 New Order \"Regret\" (Audio: Bassline + Video: Headless Peter Hook) \n2:47 Onyx \"Slam\" (Lyric: \"Duh duh duh. Duh duh duh. \"  + Video: Black and white crowd jumping)\n\n2:53 Naughty By Nature \"Hip Hop Hooray\" (Lyric: “So hip hop hooray\" + Video: Two figures in black in front of a colourful graffiti wall)\n2:54 Suede \"Animal Nitrate\" (Lyric: “Oh oh oh” + video: A goth in front of a brown frilly curtain) \n2:54 Naughty By Nature \"Hip Hop Hooray\" (Lyric: “Ho. Hey. Ho. Hey. Ho.” etc + Video of rappers saying \"Hey. Ho.\" etc) \n2:54 Smashing Pumpkins \"Cherub Rock\" (Video: Psychedelic colours)\n2:56 ? ? (Video: Keyboards)\n2:57 Counting Crows \"Mr Jones\" (Lyric: “Sha la la la la la la…”)\n3:01 Smashing Pumpkins \"Today\" (Video: Man paints red stripe on ice cream truck) \n3:02 ? ? (Drummer on a plastic bucket) \n3:05 Snoop Doggy Dogg \"Who Am I (What's My Name)\" (Snoop chilling with a lot of people in a house) \n3:07 Teenage Fanclub \"Radio\" (Audio: Guitars) \n3:09 The Mighty Mighty Boss Tones \"Someday I Suppose\" (Video: Two saxophones and a trombone) \n3:11 KRS-One \"Sound of Da Police\" (Lyric: \"Woop woop woop!\", indicating the police are arriving in the next section ...)\n\n3:13 Meat Loaf \"I'd Do Anything For Love (But I Won't Do That)\" (Video: Police bike smashes through a wall, police carrying a shotgun) \n3:13 The Cranberries \"Linger\" (Audio: Synth + Video: Black and white video of woman walking through house with projectors)\n3:14 ? ? (Video: An old fashioned car headlight. Which by all logic, ought to be from Toni Braxton's \"Another Sad Love Song\", but isn't.)\n3:13 James \"Laid\" (Audio: Guitar Line + Video: Man in a dress dances in a kitchen)\n3:17 Janet Jackson \"Again\"  \n\n3:22 Teenage Fanclub & De La Soul \"Fallin'\" (Audio: Finger clicks & TR808 drum + Video: A paper mache sun falls down) \n3:22 Meat Loaf \"I'd Do Anything For Love (But I Won't Do That)\" (Video: Bike rides into sunset)\n3:23 Sheryl Crow \"All I Wanna Do\" (Someone levitates in front of a theatre)\n\nThanks to all who contributed. I'd put your name by each contribution, but it got too long to post. So thanks The Geecy Project, Jakob Mueller, we3shu4, Julio Diaz, Legolordfilms, LB, Pete Sturman, thecandidcastaway, Chris Avery, Joey Alvestad, davebrubeck, Brayan Puma, Andrew Huff, Robert Mahon and Chris RJ! \n\nNot figured out yet: Ice Cube, Toni Braxton",
                "publishedAt": "2020-10-22T06:10:52.000Z"
              }
            }
          }
        }
      ]
    },
    {
      "contentDetails": {
        "duration": 214
      },
      "id": "0fKG6TbpeLY",
      "snippet": {
        "title": "60 Songs From 1992 Remixed Into 3½ Minutes",
        "description": "Samples of more than 60 songs from 1992 mixed together into one 3½-minute song by The Hood Internet. NEW! Spotify playlist of all the samples used → http://spoti.fi/3c0u49I\nWatch the whole ongoing playlist here: http://bit.ly/thi-79-99\n\nFeaturing:\n10,000 Maniacs, 4 Non Blondes, Alice in Chains, Annie Lennox, Aphex Twin, Arrested Development, Beastie Boys, Black Crowes, Blind Melon, Charles & Eddie, The Cure, Das EFX, Def Leppard, Digable Planets, Dr. Dre, Dream Theater, En Vogue, Faith No More, Geto Boys, House of Pain, Ice Cube, INXS, Jade, King Missile, Kris Kross, L7, Mary J. Blige, Megadeth, Neil Young, Opus III, Paperboy, Peabo Bryson & Regina Belle, Pearl Jam, Pete Rock & C.L. Smooth, Pharcyde, Positive K, Prince, R.E.M., Radiohead, Rage Against The Machine, Screaming Trees, Sir Mix-a-Lot, Snap, Sophie B. Hawkins, Soul Asylum, Stereo MC's, Stone Temple Pilots, Sublime, Sublime, Ugly Kid Joe, Us3, White Zombie, Whitney Houston, Wreckx-N-Effect, Wu-Tang Clan",
        "publishedAt": "2020-10-15T05:00:23Z",
        "thumbnails": {
          "default": {
            "url": "https://i.ytimg.com/vi/0fKG6TbpeLY/default.jpg",
            "width": 120,
            "height": 90
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/0fKG6TbpeLY/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "high": {
            "url": "https://i.ytimg.com/vi/0fKG6TbpeLY/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/0fKG6TbpeLY/sddefault.jpg",
            "width": 640,
            "height": 480
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/0fKG6TbpeLY/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          }
        }
      },
      "comments": [
        {
          "id": "Ugw4YtO3H_c8_reOUdZ4AaABAg",
          "snippet": {
            "videoId": "0fKG6TbpeLY",
            "topLevelComment": {
              "snippet": {
                "textDisplay": "Let's figure out which songs are which. Can you fill in the blanks?  \n\n0:00 House of Pain \"Jump Around\" (Fife band) [Thanks Af Hy and Jakob Mueller!] \n0:00 Megadeth \"Symphony of Destruction\" (Audio: Chord + Video: Crowd) [Thanks thecandidcastaway!]\n0:04 The Black Crowes \"Remedy\" (Audio: Guitar Riff + Video: Band playing in a green room / Singer with red trousers) [Thanks The Geecy Project!]\n0:10 ? ? (Scratch sound)\n0:10 White Zombie \"Thunder Kiss '65\" (Audio: Guitar riff + Video: Guitarist and dancers in green with a white background) [Thanks The Geecy Project!]\n0:11 Kriss Kross \"Jump\" (Audio: Backbeat + Video: Figures in hoods jump.) [Thanks Jakob Mueller!]\n0:15 Neil Young \"Harvest Moon\" (Lyric: “Ooooh”) [Thanks thecandidcastaway!]\n0:16 ? ? (Guitarist in blue woolen hat)\n0:16 The Cure \"Friday I'm In Love\" (Lyric: “Doo doo doo bom”) [Thanks Jakob Mueller!]\n0:18 ? ? (Singer in white long-sleeved t-shirt says “bom”)\n0:19 Arrested Development \"Tennessee\" (Rapper waves a tablecloth) [Thanks Sara Kaiser!]\n0:20 Charles & Eddie \"Would I Lie To You\" (Lyric: “LA la LA la LAA LAAA”) [Thanks thecandidcastaway!]\n0:23 Blind Melon \"No Rain\" (Audio: Shaker + Video: Band on a grassy hill / Girl in bee costume walks past a rusty wall) [Thanks Jakob Mueller!]\n0:24 ? ? (Guitarist with cream coloured guitar in front of a green wall)\n0:25 Mary J Blige \"Real Love\" (Lyric: “We are lovers through and through and though we made it through the storm…”) [Thanks Jakob Mueller!]\n0:34 ? ? (Drummer)\n0:35 Alice in Chains \"Would?\" (Second drummer) [Thanks The Geecy Project!]\n0:38 Arrested Development \"Tennessee\" (Black and white video of man standing in front of an old house / Two women dancing in front of a palm tree) [Thanks Brayan Puma!]\n0:43 10,000 Maniacs \"These Are The Days\" (Audio: Drum beat) [Thanks Duane Johnson!]\n0:43 The Cure \"Friday I'm In Love\" (DuanGuitarist wears a purple t-shirt) [Thanks Duane Johnson!]\n\n0:45 Mary J Blige \"Real Love\" (Lyric: “Real love….”) [Thanks Legolordfilms!]\n0:45 The Cure \"Friday I'm In Love\" (Audio: Muted guitar Riff + Video: The Cure perform in the snow) [Thanks The Geecy Project and Jakob Mueller!]\n0:46 Paperboy \"Ditty\" (Sepia shot of a crowd from behind) [Thanks thecandidcastaway!]\n0:49 ? ? (5 dancers in white shirts and jorts, for this is 1992)\n0:51 ? ? (A drummer wears a keffiyeh)\n0:54 ? ? (Someone has some sparklers)\n0:55 Annie Lennox \"Why\" (Lyrics: \"Aaaurgh!\", although y'know, more melodic than that  + Woman in an enormous pink head-dress) [Thanks Jakob Mueller!]\n0:56 REM \"Man On The Moon\" (Lyric: \"Yeah yeah, yeah yeah\" + Video: Michael Stipe in a cowboy hat) [Thanks The Geecy Project!]\n0:57 Geto Boys \"Damn It Feels Good To Be A Gangta\" (Rappers drive up in a dark red convertible) [Thanks thecandidcastaway!]\n1:03 Blind Melon \"No Rain\" (Lyric: “Ooh ooh ooo-oooh” + Video: Girl in bee costume) [Thanks Jakob Mueller!]\n\n1:04 King Missile \"Detachable Penis\" (Audio: Tremolo guitar riff) [Thanks The Geecy Project!]\n1:05 Kriss Kross \"Jump\" (Lyric: “Check it out”) [Thanks Jakob Mueller and Brayan Puma!]\n1:06 Dr Dre \"Nuthin But a 'G' Thang\"  (Lyric: “Check this out”) [Thanks Jakob Mueller!]\n\n1:07 En Vogue \"My Lovin' (You're Never Gonna Get It)\" (Lyric: “Never gonna get, never gonna get it.” x 3 1/2) [Thanks Jakob Mueller!]\n1:07 Screaming Trees \"Nearly Lost You\" (Drummer) [Thanks thecandidcastaway!]\n1:10 ? ? (A slinky dress)\n1:14 ? ? (A man in a cap turns around)\n1:15 Digable Planets \"Rebirth of Slick (Cool Like That)\" (A trumpet-like instrument) [Thanks Jakob Mueller!]\n1:17 ? ? (Man in a cap drives a convertible)\n1:17 Dr Dre \"Nuthin But a 'G' Thang\"  (Audio: Whistling) [Thanks Jakob Mueller]\n1:18 L7 \"Pretend We're Dead\" Video: Woman with purple hair says “Aaaaah”) [Thanks thecandidcastaway]\n1:18 ? ? (Head-banging drummer)\n1:25 Wreckx-N-Effect \"Rump Shaker\" (Audio: Saxophone + Video: Woman plays a saxophone in the sea) [Thanks The Geecy Project and Jakob Mueller!]\n\n1:27 ? ? (Black and white video of woman holding her skirt)\n1:27 The Pharacyde \"Passin' Me By\" (Audio: Droning synth sound) [Thanks The Geecy Project!]\n1:27 Stereo MC's \"Connected\" (Two women in blue clap) [Thanks Julio Diaz!]\n1:30 Pete Rock & CL Smooth \"They Reminisce Over You (T.R.O.Y.)\" (Lyric: “Yeah” + Video: Two guys by a chain link fence) [Thansk Jakob Mueller]\n1:31 The Pharcyde \"Passin' Me By\" (Audio: Synth sound + Video: Skateboarder) [Thanks Jakob Mueller]\n1:34 Pete Rock & CL Smooth \"They Reminisce Over You (T.R.O.Y.)\" (Lyric: “I reminisce, I reminisce” + Video: Barber pole) [Thansk Jakob Mueller and Brayan Puma!]\n1:36 Jade \"Don't Walk Away\" (Lyric: \"Don't walk away, boy\" + Video: 3 women by a wall covered in graffiti) [Thanks thecandidcastaway!]\n1:37 Dr Dre \"Nuthin But a 'G' Thang\" (Audio: G-Funk synth + Video: Bouncy cars) [Thanks The Geecy Project!]\n1:44 ? ? (Drums with a golden hue)\n1:45 Us3 \"Cantaloop (Flip Fantasia)\" (Trumpet) [Thanks Julio Diaz!]\n\n1:45 Rage Against The Machine \"Bombtrack\" (Lyric: “It goes a one, two, three…” + Video: Zack de la Rocha on the mic) [Thanks The Geecy Project!]\n1:46 Dr Dre \"Nuthin But a 'G' Thang\" (Lyric: “... two, three and to the four, Snoop Doggy Dogg and Dr Dre is at the door…”) [Thanks Jakob Mueller]\n1:48 Faith No More \"Midlife Crisis\" (Video: Figures run across a park) [Thanks thecandidcastaway!]\n1:50 Snap! \"Rhythm Is A Dancer\" (Lyric: “Aaaah”) [Thanks Julio Diaz!]\n1:51 Rage Against The Machine \"Killing In The Name Of\" (Audio: Guitar riff + Video: Shirtless Tom Morello playing guitar at 1:53) [Thanks The Geecy Project!]\n1:52 En Vogue \"My Lovin' (You're Never Gonna Get It)\" (Lyric: “Bop” + Video: 4 women against a blue background) [Thanks Jakob Mueller]\n1:53 Soul Asylum \"Somebody To Shove\" (Video: Guitarist in denim jacket) [Thanks thecandidcastaway!]\n1:55 ? ? (Two guys on a balcony in black and white)\n\n1:56 Annie Lennox “Walking On Broken Glass” (A party from the 18th century)\n1:56 Aphex Twin \"Xtal\" (Audio: Hi-hats) [Thanks The Geecy Project!]\n1:56 Prince and the New Power Generation \"7\" (Prince appears on the screen) [Thanks Julio Diaz!]\n1:58 Sir Mix-a-Lot “Baby Got Back” (Lyric: “Oh. My. God”)\n1:59 Sophie B Hawkins \"Damn I Wish I Was Your Lover\" (Lyric: “Damn!”) [Thanks The Geecy Project and Jakob Mueller!]\n2:00 Ice Cube \"It Was a Good Day\" (Lyric: “Just waking up in the morning gotta thank god. I don’t know but today seems kinda odd.” + Video: Man with bandana / Dog at 2:04) [Thanks Jakob Mueller!]\n2:04 INXS \"Not Enough Time\" (Woman wearing a net stands in golden light) [Thanks thecandidcastaway!]\n2:05 En Vogue \"Free Your Mind\" (Women on stage bow) [Thanks thecandidcastaway!]\n2:07 ? ? (Woman wearing a black dress spins around)\n\n2:11 House of Pain \"Jump Around\" (Lyric: “I’m the cream of the crop. I rise to the top.”) [Thanks Jakob Mueller!]\n2:13 Def Leppard \"Let's Get Rocked\" (Guitarist in bright white stands on a Union Jack flag) [Thanks Julio Diaz!]\n2:16 House of Pain \"Jump Around\" (Lyric: “Word to your mom. I came to drop bombs.”)\n2:17 ? ? (A bomb explodes)\n2:18 Das EFX \"They Want EFX\" (Lyric: “No Parks sausages mom”)\n2:19 Jade \"Don't Walk Away\" (3 women dance in front of a crowd and graffitied wall) [Thanks nightowl!]\n\n2:20 Beastie Boys \"So What'cha Want\" (Lyric: \"Yeah, you can't front on that\" + Video: Beastie Boys walk through a forest where the background colours are weird) [Thanks Jakob Mueller!] \n2:22 Wu-Tang Clan \"Protect Ya Neck\" (Lyric: \"Ooh ... Ow\") [Thanks Jakob Mueller!]\n2:23 ? ? (Lyric: “Go” + Video: Colourful crowd at the beach)\n2:24 Positive K \"I Got A Man\" (Audio: The general groove + Video: People dance in the garden / Man walks down the stairs at 2:29) [Thanks Julio Diaz]\n2:25 Wreckx-N-Effect \"Rump Shaker\" (Bikini-clad saxophonist) [Thanks Julio Diaz!]\n2:26 House of Pain \"Jump Around\" (Lyric: “Jump! Jump! Everybody Jump”)\n2:27 Kriss Kross \"Jump\" (Lyric: “Jump! Jump!”)\n2:28 Sublime \"Badfish\" (Video: Drum fill. (Note: I can't find the original, but the fill is the same as at this video: https://youtu.be/UA39giCWBo4?t=107) [Thanks The Geecy Project!]\n2:29 ? ? (Man in cap raises his hands)\n2:30 ? ? (legs walk down a sandy road)\n2:32 Arrested Development “Everyday People\" (Lyric: “Woah. Yeah. Woah. Yeah.” x 3)\n2:38 Radiohead \"Creep\" (Guitar grunt) [Thanks davebrubeck!]\n2:38 ? ? (Man jumps into a river)\n\n2:39 Whitney Houston “I Will Always Love You” (Lyric: “And I will always love you….”)\n2:39 Radiohead “Creep” (Audio: Guitar arpeggios)\n2:44 Dream Theatre \"Pull Me Under\" (Black and white video of a book and a desk) [Thanks thecandidcastaway!]\n2:59 Peabo Bryson and Regina Belle “A Whole New World” (Lyric: “I can show you the world…”)\n2:59 Beastie Boys \"So What'cha Want\" (Audio: Massive drums + Video: Three men in a forest) [Thanks The Geecy Project and Jakob Mueller!]\n3:14 4 Non Blondes \"What's Up\" (Lyric: “Yaaa Day”) [Thanks Legolordfilms and Jakob Mueller!]\n3:18 Pearl Jam \"Yellow Ledbetter\" (Guitar riff) [Thanks Raj R!]\n3:22 Opus III \"It's a Fine Day\" (Figure stretches in front of a sky and moon) [Thanks Raj R!] \n3:27 Stone Temple Pilots \"Creep\" (Video: Hallway) [Thanks thecandidcastaway!]\n3:30: Radiohead “Creep” (Lyric: “I don’t belong here”)  \n\nNot Found Yet: Ugly Kid Joe",
                "publishedAt": "2020-10-15T06:24:53.000Z"
              }
            }
          }
        }
      ]
    },
    {
      "contentDetails": {
        "duration": 208
      },
      "id": "x3X7xOzXTbc",
      "snippet": {
        "title": "60 Songs From 1991 Remixed Into 3½ Minutes",
        "description": "Samples of more than 60 songs from 1991 mixed together into one 3½-minute song by The Hood Internet. NEW! Spotify playlist of all the samples used → http://spoti.fi/2Ol2tI4\nWatch the whole ongoing playlist here: http://bit.ly/thi-79-99\n\nFeaturing:\n2 Unlimited, A Tribe Called Quest, Amy Grant, Big Audio Dynamite II, Black Sheep, Blur, Bonnie Raitt, Boyz II Men, Ce Ce Peniston, Chubb Rock, Color Me Badd, Crystal Waters, Cypress Hill, D.J. Jazzy Jeff & The Fresh Prince, De La Soul, Enya, Future Sound Of London, Geto Boys, Guns N' Roses, Heavy D & The Boyz, Jodeci, Lenny Kravitz, Marc Cohn, Mariah Carey, Marky Mark & The Funky Bunch, Massive Attack, Matthew Sweet, Metallica, Michael Jackson, The Mighty Mighty Bosstones, Moby, Mr. Big, My Bloody Valentine, N.W.A., Naughty by Nature, Nirvana, Paula Abdul, Pearl Jam, PM Dawn, Primal Scream, Primus, Prince, R.E.M., Red Hot Chili Peppers, Roxette, Soundgarden, Spin Doctors, Teenage Fanclub, Temple of the Dog, Tom Cochrane, Tom Petty & The Heartbreakers, U2, Van Halen",
        "publishedAt": "2020-10-08T05:00:11Z",
        "thumbnails": {
          "default": {
            "url": "https://i.ytimg.com/vi/x3X7xOzXTbc/default.jpg",
            "width": 120,
            "height": 90
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/x3X7xOzXTbc/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "high": {
            "url": "https://i.ytimg.com/vi/x3X7xOzXTbc/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/x3X7xOzXTbc/sddefault.jpg",
            "width": 640,
            "height": 480
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/x3X7xOzXTbc/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          }
        }
      },
      "comments": [
        {
          "id": "UgzjIo2Tej3lZu5vskN4AaABAg",
          "snippet": {
            "videoId": "x3X7xOzXTbc",
            "topLevelComment": {
              "snippet": {
                "textDisplay": "I really don't know the songs from 1991. Can you help fill in the blanks?\n\n0:00 Jodeci \"Forever My Lady\" (Audio: Wind chimes) [Thanks JB!]\n0:03 Guns N Roses \"November Rain\" (Audio: Piano + Video: Axl Rose plays the piano / Bride) [Thanks Dan C and the candidcastaway!]\n0:07 NWA \"Alwayz Into Somethin\" (Lyric: “The year is 1991” + Video: Black and white video of wall with bullet hole)\n0:08 Big Audio Dynamite “The Globe\" (Audio: Guitar riff over the 1991 title card)\n0:09 Lenny Kravitz \"It Ain't Over Til It's Over\" (Video: Drummer does drum roll)\n\n0:10 Michael Jackson “Black or White” (Audio: Guitar riff + Video: Knob turned up to \"Louder\",  / McCauley Culkin strums a red guitar at 0:14 ) [Thanks Dan C and Jakob Mueller!]\n0:12 Big Audio Dynamite \"The Globe\" (Audio: Sneeze)\n0:11 Prince \"Gett Off\" (Video: Faceless person screams) [Thanks Dan C and candidcastaway!]  \n0:15 Matthew Sweet \"Girlfriend\" (Video: Drum fill, from their appearance on the Dennis Miller Show 1992)\n0:16 ? ? (Video: Woman in pink sings “na na na na”)\n0:17 Mariah Carey \"Emotions\" (Lyric: “You! Got me feeling emotions”) [Thanks Beth Downey!]\n0:21 Marky Mark and the Funky Bunch \"Good Vibration\" (Lyric: “It’s such a good vibration” + Video: Woman looks through blinds) [Thanks Dan C and Jakob Mueller!]\n0:23 Enya \"Book of Days\" (Video: Enya looks at a snow globe) [Thanks Jakob Mueller!]\n0:29 Color Me Badd \"All 4 Love\" (Man in pink shirt dances in front of staircase) [Thanks Jakob Mueller]\n0:31 Van Halen \"Top of the World\" (Audio: Guitar riff (same as the one from the end of \"Jump\") + Video: Guitarist with yellow shirt and dark yellow guitar on a dark stage. ) [Thanks Chris Avery!]\n0:33 Red Hot Chilli Peppers \"Give It Away\" (The Devil Himself plays the drums) [Thanks thecandidcastaway!]\n0:36 Matthew Sweet \"Girlfriend\" reprise (Drummer in black top with dollar signs on it)\n0:37 Marky Mark and the Funky Bunch \"Good Vibration\" reprise (Video: shirtless boxer / dancers behind a fence) [Thanks Jakob Mueller]\n0:49 Tom Cochrane \"Life Is A Highway\" (Audio: Drum fill + Video: Couple with red convertible next to a field of wheat) [Thanks Sara Kaiser!] \n\n0:51 Tom Petty and the Heartbreakers “Learning to Fly” (Lyric: “I’m learning to fly”)\n0:51 Marc Cohn \"Walking in Memphis\" (Audio: Piano riff. Note: it’s the song about being six feet of the beal, whatever the beal is) [Update: It's Beale St, a live music tourist attraction in Memphis. Thanks Beth Downey and Tom Knudsen!]\n0:52 Pearl Jam \"Evenflow\"  (Video: Bass player with yellow bass) [Thanks Dan C and Beth Downey!]\n0:54 Massive Attack \"Unfinished Sympathy\" (Lyric: “Like a soul without a mind”)\n0:59 Mariah Carey \"Emotions\" reprise (Audio: High pitched singing)\n1:06 Spin Doctors \"Two Princes\" (Video: Drum fill in black and white) [Thanks Jakob!]\n1:06 Paula Abdul \"Rush Rush\" (Video: 1950s car race started by woman in a white dress)\n\n1:07 Ce Ce Peniston \"Finally\" (Lyric: “Finally it’s happened to me right in front of face and my lips can’t describe it”)  \n1:07 Paula Abdul \"Rush Rush\" (Faint lyric: \"Na na na ah\")\n1:10 Primal Scream \"Movin' On Up\" (Video: Band plays on a green and white stage with a yellow background) [Thanks thecandidcastaway!]\n1:11 Blur \"There's No Other Way\" (Video: Purple video of a cake + Audio: Drums)\n1:15 Tom Petty and the Heartbreakers \"Learning to Fly\" reprise (Video: 2 necked guitar solo + Audio: Lead electric guitar riff)\n1:17 Red Hot Chilli Peppers “Under the Bridge” (Video: Guitarist wearing a wooly hat + Audio: Bass riff)\n\n1:23 A Tribe Called Quest \"Scenario\" (Lyric: “Here we go yo, here we go yo, so what's the what's the what's the scenario”) [Thanks Dan and Jakob and thecandidcastaway!]\n1:23 Nirvana “Smells Like Teen Spirit” (Audio: Guitar riffs from both the verses and the chorus, at the same time + Video: Foot tapping / Unenthusiastic cheerleaders) [Thanks Jakob!] \n1:30 De La Soul \"A Rollerskating Jam Named Saturdays\" (Audio: Record scratches + Video: Rollerskating) [Thanks Daniel Read!]\n1:32 Naughty By Nature \"O.P.P.\" (Audio: Bass riff ending with two notes on the piano) \n1:39 Primus \"Jerry Was a Racecar Driver\" (Lyric: \"Go\")  \n\n1:40 Black Sheep \"The Choice Is Yours\" (Lyric: “Engine engine number 9 / On the New York transit line / If my train goes off the track / Pick it up, pick it up, pick it up ...”)\n1:42 2 Unlimited \"Get Ready For This\" (Lyric: “Yeah”) [Thanks Jakob!]  \n1:40 Cypress Hill \"How I Could Just Kill A Man\" (Audio: Drum beat + Video: 2 figures briefly against a light blue background) [Thanks thecandidcastaway!]\n1:43 Naughty By Nature \"O.P.P.\" continues (Audio: Two notes on the piano)\n1:44 Nirvana \"Smells Like Teen Spirit\" continues (Audio: Two notes from the guitar riff in the verse)\n\n1:49 Heavy D and the Boyz \"Now That We've Found Love\" (Lyric: “Now that we’ve found love what are we gonna do. With it.”)\n1:49 Prince and the New Power Generation \"Cream\" (Audio: Cowbell / beat + Video: Prince wears a red shirt) [Thanks Jakob!]\n1:49 Boyz II Men \"Motownphilly\" (Lyric: “Laaa”) [Thanks Dan C and Beth Downey!]\n\n1:57 Crystal Waters “Gypsy Woman (La da dee La da da)” (Lyric: “La da dee, la da dow”)\n1:57 Chubb Rock \"Treat Em Right\" (Lyric: “Go. Go. Go. Go.” x 1000) [Thanks Jakob Mueller!] \n2:00 Moby \"Go\" (Lyric: “GO”) [Thanks Jakob Mueller!]\n2:06 Heavy D and the Boyz \"Now The We've Found Love\" reprise (Video: Woman in raincoat leads a troupe of dancers in Hazmat suits) [Thanks Beth Downey!]\n2:07 Metallica \"Enter Sandman\" (Man in white gets out of a bed before a truck hits it) [Thanks Dan C!]\n2:09 Crystal Waters \"Gypsy Woman\" reprise (Video: French mime does French mime things) [Thanks tubasaur!]\n\n2:12 Teenage Fanclub \"The Concept\" (Video: Double denim woman pushes over shelves in a record store / Band with sky blue guitar)\n2:14 Pearl Jam \"Black\" (Lyric: (High pitched) \"Doo doo doo, doo, doo doo doo\" + Video: Singer in brown jacket in front of drummer) [Thanks Chris Avery!] \n2:14 Nirvana \"In Bloom\" (Video: Music video from the 1950s) [Thanks Dan C!]\n2:14 REM \"Losing My Religion\" (Michael Stipe dances in front of a brown wall) [Thanks Dan C!]  \n2:21 Teenage Fanclub \"The Concept\" (Video: Sky blue guitar underwater)\n2:28 Guns n Roses \"November Rain\" reprise (Video: Slash in the desert, Man jumps through a wedding cake) [Thanks Dan C and Jakob M!]\n\n2:30 U2 \"Mysterious Ways\" (Dancer in front of a blue moon + Audio: Drums) [Thanks David Waggonner]  \n2:30 Future Sound of London \"Papua New Guinea\" (Audio: Drums)\n2:30 PM Dawn \"Set Adrift on Memory Bliss\" (Lyric: \"Da dada dada dada\" + Video: Silhouette with blue lines in it in front of orange background) [Thanks thecandidcastaway!]\n2:33 Temple of the Dog \"Hunger Strike\" (Video: Black electric guitar)\n\n2:36 Soundgarden \"Rusty Cage\" (Audio: Guitar riff + Video: Bearded guitar player in white room)\n2:37 Color Me Badd \"I Wanna Sex You Up\" reprise (Lyric: \"Tick tock you don't stop\" + Video: Boy band dances outdoors + Note: Lyric is from  Slick Rick's \"La Di Da Di\") [Thanks Jakob]\n2:38 Big Audio Dynamite \"Rush\" (Video: Guitarist dances with black guitar / Drummer plays imaginary drums at 2:40 ) [Thanks Jon Coen!]\n2:39 Roxette \"Joyride\" (Audio: Whistling + Video: Guitarists drive in red convertible) [Thanks Jakob!]\n2:42 Amy Grant \"Baby Baby\" (Video: Woman with brown curly hair) [Thanks Dan C!]\n2:48 Bonnie Raitt \"Something To Talk About\" (Audio: Faint Oohs + Video: Woman falls into water) [ Thanks Jakob Mueller!]\n2:52 Nirvana “Smells Like Teen Spirit” reprise (Drum fill)\n\n2:54 DJ Jazzy Jeff and the Fresh Prince \"Summertime\" (Woman dances in front of a small crowd) [Thanks Dan C]\n2:55 Naughty By Nature \"O.P.P.\" (Lyric: “You down with OPP?”) [Thanks Dan C!]\n2:55 Geto Boys \"My Mind Playing Tricks On Me\" (Video: Crowd gathered around an orangey-red convertible)\n3:01 U2 “The Fly” (Bono walks down the street) [Thanks David Waggonner!]\n3:03 The Mighty Mighty Bosstones \"Where'd You Go\" (Video: Brass instrument players) [Thanks Jakob Mueller!]\n3:04 U2 \"Even Better Than The Real Thing\" (Man with rings opens his hand) [Thanks David White]\n3:07 Chubb Rock \"Treat Em Right\" (Man in white suit with b-boys in blue)\n\n3:12 Black Sheep \"The Choice Is Yours\" reprise (Video: People clapping in slow motion) [Thanks Jakob Mueller!]\n3:13 PM Dawn \"Set Adrift On Memory Bliss\" reprise (Video: Surfboard shot from underwater) [Thanks Jakob Mueller!]\n3:13 Nirvana \"Smells Like Teen Spirit\" reprise (Audio: 2 note guitar riff) [Thanks Jakob Mueller!]\n\n3:16 My Bloody Valentine “To Here Knows When” (Audio: Ambient chords + Video: Kaleidoscope) [Thanks Mike Brown!]\n3:18 Mr Big \"To Be With You\" (Black acoustic guitar) [Thanks Deb B!]  \n\nNot figured out yet: \nWho is that lady at 0:16 and what song is she singing?",
                "publishedAt": "2020-10-08T05:55:15.000Z"
              }
            }
          }
        }
      ]
    },
    {
      "contentDetails": {
        "duration": 211
      },
      "id": "MwDRyW43T6Y",
      "snippet": {
        "title": "60 Songs From 1990 Remixed Into 3½ Minutes",
        "description": "Samples of more than 60 songs from 1990 mixed together into one 3½-minute song by The Hood Internet. NEW! Spotify playlist of all the samples used → http://spoti.fi/3kJ9IpG\nWatch the whole ongoing playlist here: http://bit.ly/thi-79-99\n\nFeaturing:\n2 In A Room, A Tribe Called Quest, AC/DC, Alice In Chains, Bad Religion, Bell Biv DeVoe, Billy Idol, Black Box, The Black Crowes, Boogie Down Productions, The Breeders, C & C Music Factory, Candyman, The Charlatans, D.N.A. featuring Suzanne Vega, Deee-Lite, Depeche Mode, Digital Underground, Divinyls, DJ Jazzy Jeff & The Fresh Prince, EMF, En Vogue, Enigma, Eric B. & Rakim, The Farm, George Michael, Guns N' Roses, Happy Mondays, Hi-Five, INXS, Jane's Addiction, Keith Sweat, LL Cool J, Londonbeat, Madonna, Main Source, Mariah Carey, MC Hammer, New Kids on the Block, Nick Cave & The Bad Seeds, Pixies, Poison, Primal Scream, Prince, Public Enemy, Queensrÿche, Roxette, Salt-n-Pepa, Scorpions, Seal, Sinéad O'Connor, Sonic Youth, Tara Kemp, Timmy T, Tony! Toni! Tone!, Whitney Houston, Wilson Phillips",
        "publishedAt": "2020-10-01T05:00:11Z",
        "thumbnails": {
          "default": {
            "url": "https://i.ytimg.com/vi/MwDRyW43T6Y/default.jpg",
            "width": 120,
            "height": 90
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/MwDRyW43T6Y/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "high": {
            "url": "https://i.ytimg.com/vi/MwDRyW43T6Y/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/MwDRyW43T6Y/sddefault.jpg",
            "width": 640,
            "height": 480
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/MwDRyW43T6Y/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          }
        }
      },
      "comments": [
        {
          "id": "UgyATWe6DQkqmHpGdUV4AaABAg",
          "snippet": {
            "videoId": "MwDRyW43T6Y",
            "topLevelComment": {
              "snippet": {
                "textDisplay": "Best mashup yet! Here are the songs I've worked out so far. Can you help fill in the blanks?  \n\n0:00 Pixies \"Dig for Fire\" (Audio: Strummed noteless guitar & triangle) [Thanks Alan Hurley!]\n0:00 A Tribe Called Quest \"Push It Along\" (Audio: Wind sound getting louder) [Great work PurplePandaClock!]\n0:01 Deee-Lite “Groove is in the Heart” (Audio: Guitar riff + Video: Woman in pink dancing)\n0:04 Public Enemy \"Brothers Gonna Work It Out\" (Video: Sign that says \"Brothers Gonna Work It Out\" /  Karate guys)  \n0:06 ? ? (Audio: Slow crescendo of electric guitar note)\n0:08 Deee-Lite \"Groove Is In The Heart\" (Lyric: “1 2 3”) [Thanks Beth Downey!]\n0:10 Public Enemy \"911 Is A Joke\" (Lyric: “Hit me”) [Thanks Wallystrom!]\n\n0:11 Suzanne Vega \"Tom's Diner\" (Lyric: “Duh duh duh duh, duh duduh duh ….”)\n0:11 C+C Music Factory “Everybody Dance Now” (Video: Shirtless guys look around then do things with their arms)\n0:17 C+C Music Factory “Everybody Dance Now” (Lyric: “EVERYBODY DANCE NOW”)\n0:19 Tony! Toni! Tone! \"Feels Good\" (Video: Three people dance at the front of the stage)\n0:20 Boogie Down Productions \"Love's Gonna Get'cha (Material Love)\" (Man in shadow sways his arms at the edge of a spotlight)\n0:22 Madonna “Vogue” (Lyric: “Let your body move to the music” + Video: Madonna vogues in black and white)\n0:29 En Vogue \"Hold On\" (Lyric: “Hold on”) [Thanks Wallystrom!]\n\n0:35 Bell Biv DeVoe \"Poison\" (Lyric: “It’s driving me out of my mind”) [Thanks DatHott Gamer!]\n0:38 Black Box \"Everybody Everybody\" (Video: Woman in sepia says “Oh\", but with a man's voice)\n0:41 Hi-Five \"I Like the Way (The Kissing Game)\" (Video: People in purple move in circles)\n0:44 Londonbeat “I’ve Been Thinking About You” (Lyric: “I’ve been thinking about you”)\n0:45 Black Box \"Everybody Everybody\" (Video: Woman dances on a pedestal in black and white)\n0:46 The Black Crowes \"Hard to Handle\" (Video: Drummer) [Well spotted Beth Downey!]\n0:48 Scorpions \"Winds of Change\" (Audio: Whistling + Video: Concert stage in black and white) [Well done David K!]\n0:49 Bell Biv DeVoe \"Poison\" (Audio: Heavy Drum Riff + Video: Purple wall with “Poison” written on it)\n\n0:51 MC Hammer “You Can’t Touch This” (Video: Man in yellow top and parachute pants dances in front of five women)\n0:51 Deee-Lite “Groove Is In The Heart” reprise (Audio: Guitar riff and complex drums)\n0:54 EMF \"Unbelievable\" (Video: Two band members, one of whom wears a black cap and a t-shirt that says “Feet”)\n0:55 Alice In Chains \"Man in the Box\" (Lyric: \"Down down\" + Audio: Tasty guitar riff + Video here and at 1:05 ) [Thanks lneiman!]\n1:03 2 in a Room \"Wiggle It\" (Lyric: “Acid groove”)\n1:07 EMF “Unbelievable” (Lyric: “Unbelievable\")\n1:07 LL Cool J \"Mama Said Knock You Out\" (Video: Boxing ring)\n\n1:08 AC/DC “Thunderstruck” (Audio: Insane guitar riff)\n1:08 Suzanne Vega \"Tom's Diner\" reprise (Lyric: “Duh duh duh duh, duh duduh duh ….”)\n1:09 Enigma \"Sadeness Part 1\" (Sepia woman exhales)\n1:11 Whitney Houston \"I'm Your Baby Tonight\" (Black and white video of a person behind a shower screen) [Thanks Jen S!]\n1:11 Jane's Addiction \"Been Caught Stealing\" (Audio: Dogs barking + Video: Woman in pink skirt dances in front of watermelons)\n1:16 Digital Underground \"The Humpty Dance\" (Lyric: \"Let me hear a little bit of that bass groove right here\")\n1:17 Deee-Lite “Groove Is In The Heart” reprise\n1:19 C+C Music Factory “Everybody Dance Now” reprise\n1:20 Whitney Houston \"I'm Your Baby Tonight\" (Video: Band in berets, tight black pullovers and striped shirts, recreating an Audrey Hepburn movie) [Thanks Wallystrom and Beth Downey!]\n1:21 Jane's Addiction \"Been Caught Stealing\" (Video: Band dance in a supermarket) [Thanks Wallystrom!]\n1:23 Billy Idol \"Rock the Cradle of Love\" (Video: Brunette in white shirt dances in front of picture of Billy Idol)\n1:23 Eric B. and Rakim \"Let the Rhythm Hit Em\" (Lyric: “Let the rhythm hit em”)\n1:25 Salt n Pepa \"Expression\" (Lyric: “Oh yeah Oh yeah”) [Thanks Beth Downey and Jakob Mueller!]\n1:27 LL Cool J \"Mama Said Knock You Out\"  (Lyric: “Listen to the bass go BOOM”)\n1:30 ? ? (Video: 2 MCs on stage in front of a crowd)\n1:30 C+C Music Factory \"Everybody Dance Now\" reprise (Lyric: “EVERYBODY DANCE NOW”)\n\n1:33 DJ Jazzy Jeff and the Fresh Prince \"The Fresh Prince of Bel Air\" (Lyric: “Now this is a story all about how / My life got flipped, turned upside down”)\n1:33 INXS “Suicide Blonde” (Audio: Guitar riff + Video: Blonde walks towards the camera)\n1:37 Digital Underground \"The Humpty Dance\" (Lyric: “Now gather round, I’m the new fool in town, and my sound’s laid down by the underground …”) \n1:40 MC Hammer \"Can't Touch This\" (Lyric: “Break it down”)\n1:41 Black Box \"Everybody Everybody\" reprise (Lyric: “Everybody Everybody”)\n1:41 Sonic Youth \"Kool Thing\" (Lyric: “Hey kool thing” + Video: Lips saying “Hey cool thing”)\n1:43 George Michael \"Freedom 90\" (Video: Woman dances with blue background) [Thanks Beth Downey!]\n1:44 Salt n Pepa “Let’s Talk About Sex” (Lyric: “Let’s talk about sex baby…”)\n1:46 Sonic Youth \"Kool Thing\" (Lyric: “Don’t be shy”)\n1:46 Divinyls \"I Touch Myself\" (Lyric: “Ooh” + Video: Woman next to pink flowers)\n1:47 Sonic Youth \"Kool Thing\" (Lyric: “There’s something I gotta ask you”)\n1:50 ? ? (Lyric: “I’m ready. Uh huh uh huh”)\n1:51 ? ? (Lyric: … (sorry, couldn’t make it out) )\n1:52 Salt n Pepa “Let’s Talk about Sex” reprise (Lyric: “Let’s talk about sex”)\n1:53 Madonna “Justify My Love” (Lyric: “Tell me about your dreams. Am I in them?”) [Thanks Beth Downey and Geoff Bartlett!]\n1:56 Wilson Phillips \"Hold On\" (Video: Mountains)\n1:56 Bell Biv Devoe \"Poison\" reprise (Lyric: “Oh yeah”)\n\n1:57 Seal “Crazy” (Audio: Epic chord progression)\n1:57 New Kids on the Block \"Step By Step\" (Audio: High string riff + Video: 5 member boy band dance in black and white)\n1:58 Depeche Mode \"Policy of Truth\" (Man in sunglasses drives a car) [Thanks Jon Pennington!]\n1:58 Mariah Carey \"Someday\" (Woman dances in front of school lockers)\n1:59 DJ Jazzy Jeff and the Fresh Prince \"The Fresh Prince of Bel Air\" reprise (Video: Will Smith spins on the asphalt, then gets threatened by a policeman)\n\n2:05 Bad Religion “21st Century\" (Lyric: “Cos I'm a 21st century digital boy, I don’t know how to live but I’ve got a lot of toys” + Video: Baby)\n2:05 Seal “Crazy” (Audio: Epic chords continue)\n2:07 Depeche Mode “Enjoy the Silence” (Video: King sits on a beach chair overlooking a lake)\n2:10 Seal \"Crazy\" reprise (An unconscious woman is carried towards the camera) [Thanks Wallystrom!]  \n2:18 Main Source \"Looking At The Front Door\" (Video: Woman walks through revolving door / puts up umbrella in front of an orange sky) [Thanks thecandidcastaway!]\n2:22 Tara Kemp \"Hold You Tight\" (Lyric: “Just wanna hold you tight”)\n2:23 MC Hammer \"Can't Touch This\" (Lyric: “Break it down”) [Thanks Wallystrom!]\n2:24 Tara Kemp \"Hold You Tight\" (Lyric: “All day, all night”)\n\n2:26 Candyman \"Knockin Boots\" (Lyric: “Ooh boy I love you so, never ever ever gonna let you go, once I get my hands on you …”)\n2:27 Sinead O’Connor “Nothing Compares 2 U” (Audio: Synth chords + Video: Disembodied face of short haired woman on black background)\n2:33 Deee-Lite \"Groove Is In The Heart\" reprise (Lyric: “Sing it baby”) [Thanks Wallystrom!]\n2:36 Roxette \"It Must Have Been Love\" (Audio: synth riff + Video: Is that Roxette behind a billowing curtain?)\n2:37 Sinead O'Connor \"Nothing Compares 2 U\" (Video: Person in black walks through a garden in front of a giant crystal urn.) [Thanks Wallystrom!] \n2:39 Guns n Roses \"Live and Let Die\" (Heavy metallurgist plays a guitar with two necks) [Thanks Jen S!]\n\n2:43 Wilson Phillips “Hold On\" (Lyric: “Some day somebody’s gonna make you wanna turn around and say goodbye …”)\n2:43 The Farm \"Groovy Train\" (Audio: Electric guitar riff with delay effect + Video: Orange silhouettes in a sunset)\n2:45 Nick Cave & the Bad Seeds \"The Ship Song\" (Video: Man in white suit plays the piano under purple lights)\n2:48 The Breeders \"When I Was A Painter\" (Lyric: “Ba da duh” + Video: Woman under green lights sings into a microphone)  \n2:51 The Charlatans \"The Only One I Know\" (Audio: 2 note orchestral stab + video: Black and white video of band - reprised at 2:56 with keyboards)\n2:51 Happy Mondays “Step On” (Piano riff that’s twisting my melon, man!)  \n2:56 George Michael \"Freedom 90\" (Video: Woman’s silhouette with light blue background) [Thanks Wallystrom!]\n2:59 The Black Crowes \"Hard to Handle\" reprise [Thanks Beth Downey!]  \n\n2:59 Wilson Phillips \"Hold On\" (Lyric: \"(Don't you know). Don't you know. It's a change... Hold on for one more day...\") \n3:00 Primal Scream \"Loaded\" (Audio: Chord progression + Video: Psychedelic figures, like a purple guitarist spinning around, or purple eyeballs at 3:08) \n3:08 The Black Crowes \"Hard to Handle\" (Video: Singer waves the microphone stand around with both hands)  \n3:08 Primal Scream \"Loaded\" (Faint lyric: \"I don't want to lose your love\")\n\n3:18 Roxette \"It Must Have Been Love\" reprise \n3:20 Candyman \"Knockin Boots\" reprise (Lyric: “Never ever ever gonna let you go”)\n3:21 Guns n Roses \"Knocking on Heaven's Door\" reprise (Guitar riff) [Thanks Wallystrom!]\n3:23 Queensryche \"Silent Lucidity\" (Acoustic guitarist with blue background.) [Thanks LNR and Wallystrom!]  \n3:23 Wilson Phillips \"Hold On\" reprise (Lyric: \"Hold on for one more day\")\n\nNot worked out yet:\nKeith Sweat, Poison, Prince, Timmy T",
                "publishedAt": "2020-10-01T08:08:55.000Z"
              }
            }
          }
        }
      ]
    },
    {
      "contentDetails": {
        "duration": 178
      },
      "id": "H6N1G-z4dCc",
      "snippet": {
        "title": "50 Songs From 1989 Remixed Into 3 Minutes",
        "description": "Samples of more than 50 songs from 1989 mixed together into one 3-minute song by The Hood Internet. NEW! Spotify playlist of all the samples used → http://spoti.fi/3ech2sF\nWatch the whole ongoing playlist here: http://bit.ly/thi-79-99\n\nFeaturing:\n2 Live Crew, Aerosmith, Alice Cooper, B-52s, Babyface, Bad English, Beastie Boys, Biz Markie, Calloway, Chris Isaak, The Cure, De La Soul, Depeche Mode, Faith No More, Jane Child, Janet Jackson, Love & Rockets, Madonna, Milli Vanilli, Mötley Crüe, Nine Inch Nails, Nirvana, Operation Ivy, Phil Collins, Pixies, Public Enemy, Queen, Queen Latifah & Monie Love, Richard Marx, Roy Orbison, Snap!, Soul II Soul (feat. Caron Wheeler), The Stone Roses, The Soup Dragons, Technotronic (feat. Felly), Tina Turner, Tom Petty, Tone-Loc, Young MC",
        "publishedAt": "2020-06-11T04:04:36Z",
        "thumbnails": {
          "default": {
            "url": "https://i.ytimg.com/vi/H6N1G-z4dCc/default.jpg",
            "width": 120,
            "height": 90
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/H6N1G-z4dCc/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "high": {
            "url": "https://i.ytimg.com/vi/H6N1G-z4dCc/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/H6N1G-z4dCc/sddefault.jpg",
            "width": 640,
            "height": 480
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/H6N1G-z4dCc/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          }
        }
      },
      "comments": [
        {
          "id": "UgwiFCPkppxumc5P5jt4AaABAg",
          "snippet": {
            "videoId": "H6N1G-z4dCc",
            "topLevelComment": {
              "snippet": {
                "textDisplay": "Here are the tracks, as far as I've been able to figure out. Please comment with what I've missed.  Update: What an amazing community effort to figure out the track list!  Can you imagine how insanely hard it must have been to create?  \n0:00 Depeche Mode \"Personal Jesus\" (2 note guitar harmonics) [Thanks Peter Dutton & rob h]\n0:02 Madonna \"Like a Prayer\" (Singers \"Oooo\")  \n0:02 Soul II Soul \"Back To Life\" (Lyric \"However do you want me ...\")  \n0:02 Technotronic \"Pump Up The Jam\" (Hi-hats) [via rob h]\n0:08 Janet Jackson \"Rhythm Nation\" (Lyric \"3 2 1\")  \n0:10 Depeche Mode \"Personal Jesus\" (Slide guitar) [Thanks Jakob Mueller]\n0:11 2 Live Crew \"Me So Horny\", or possibly \"Banned in the USA\" (Video of guy getting out of car) [Thanks mack s and Jakob Mueller]\n0:12 Alice Cooper \"Poison\" (Guitar chord leading to distortion) [Thanks rob h! That's a difficult one to recognise!]\n0:17 Queen \"I Want It All\" (Lyric - \"I want it all\")  \n0:18 Young MC \"Bust a Move\" (rhythm section, plus video of woman in \"Delicious\" t-shirt) \n0:19 Aerosmith \"Love in an Elevator\" (Tasty guitar riff)  \n0:28 Soul II Soul \"Back To Life\" (Woman in silhouette shaking her hair round)  [Thanks Angel Jones!]\n\n0:34 Faith No More \"Epic\" (video of eyeball in hand / guitar & horns) \n0:34 Soul II Soul \"Back to Life\" (reprise)  \n0:39 Tom Petty \"Runnin' Down a Dream\" (cartoon of dog and man on cliff) [Thanks Peter Dutton and Carver Cordes!]\n0:41 Phil Collins \"Something happened on the way to heaven\" (Drum riff)  \n\n0:42 Public Enemy \"Fight the Power\" \n0:43 Snap! \"I've got the power\"  \n0:43 Nine Inch Nails \"Head Like a Hole\" (Bass synth part)  \n0:49 De La Soul \"Me Myself and I\" (Drum intro)\n\n0:50 Nine Inch Nails \"Head Like a Hole\" (lyrics \"Head like a hole, black as your soul ... \" )  \n0:51 Jane Child \"Don't Wanna Fall In Love\" (Synth part / video of person with very long hair next to a street drummer)  [Thanks Peter Dutton!]\n0:57 Motley Crue \"Dr Feelgood\" (Lyric \"Guitar!\")  \n0:58 Janet Jackson \"Black Cat\" (Guitar riff, played on a white guitar)  \n1:02 Babyface \"It's No Crime\" (Video of Sexy woman walking past blue building / bending backwards)  \n1:09 Roy Orbison \"You Got It\" (Timpani roll) [Thanks Ryan Munro]  \n1:09 Tom Petty \"Running Down A Dream\"  (Lyric \"Ooooo\" / Cartoon video)  [via Angel Jones]\n\n1:10 The Stone Roses \"Fools Gold\" (Lyric \"Down down down...\")  \n1:12 The Cure \"Lovesong\" (bass guitar part in background)  \n1:13 Chris Isaak \"Wicked Game\" (black and white video of woman's face with sky in the background) [via Peter Dutton]\n1:15 The B-52s \"Love Shack\" (Lyric \"Knock a little louder sugar!\")  \n1:16 Roy Orbison \"You Got It\" (Timpani player) [Thanks Ryan Munro!]\n\n1:24 Technotronic \"Pump Up The Jam\"  \n1:25 Alice Cooper \"Poison\" (Guitar part) [via Ryan Munro]\n1:25 Biz Markie \"Just a friend\" (Piano part played on a piano, played by hands wearing a ring)  \n1:29 Bad English \"When I See You Smile\" (Piano part played on a keyboard, played by hands with no ring) [Great work Jakob Mueller!]\n1:34 Beastie Boys \"Hey Ladies\" (Lyric \"Step to the rhythm, step, step to the rhyme ... \" / cowbell video)  [via mack s]\n1:41 Alice Cooper \"Poison\" (Drum boom)  \n1:42 Queen Latifah \"Ladies First\"   \n1:44 Madonna \"Express Yourself\" (Lyric \"Come on girls, do you believe in love ... \")  \n\n1:53 Soup Dragons \"I'm Free\" (Lyric \"I'm free\")  \n1:56 Janet Jackson \"Escapade\" (Lyric \"Let's go!\")    \n1:57 Tom Petty \"Free-falling\"  \n1:58 Tone Loc \"Wild Thing\" (black and white videos, and drum roll at 2:00)  \n2:01 Stone Roses \"Fools Gold\" (Drummer wearing a hat) [via rob h]\n2:09 Operation Ivy \"Bad Town\" (video of sax player) [via Ryan Munro]   \n2:10 Nirvana \"About a Girl\" (Kurt Cobain playing the guitar) [via Ryan Munro]\n\n2:13 Madonna \"Like a Prayer\" (reprise)  \n2:14 Richard Marx \"Right here waiting for you\" (Piano player) [via rob h]\n2:16 The Pixies \"Here Comes Your Man\"  \n2:17 Love & Rockets \"So Alive\" (Drummer wearing a tuxedo)  \n2:20 Milli Vanilli \"Blame It On The Rain\" (Video: Man with long hair clapping) [Thanks wu3shu4!]\n2:21 Aerosmith \"Janie's Got a Gun\" (Woman running in traffic /  putting on sunglasses) [via Ryan Munro and Angel Jones]\n\n2:30 The B-52s \"Roam\" (Lyric \"Roam if you want to\")  \n2:31 Calloway \"I wanna be rich\" (Drumbeat behind Roam)  \n2:35 Janet Jackson \"Escapade\" (Lyric \"We'll have a good time\")  [via Jakob Mueller]\n2:37 Tone Loc \"Funky Cold Medina\" (women dancing/ man in fur coat) [via mack s]\n2:41 Tone Loc \"Funky Cold Medina\" (Man playing a cross between an electric guitar and a record player.) (Because it's the 80s.) [Thanks Carver Cordes!]\n2:42 ? (Trumpet and sax players)  \n2:48 Janet Jackson \"Love Will Never Do Without You\"\"(Janet Jackson being Janet Jackson / Spinning lady and then man in black and white video) [Thanks mack s and Jon Pennington] \n2:52 B-52s \"Love Shack\" (Keyboard player slides down the keys)  [via Angel Jones]\n2:53 Janet Jackson \"Miss You Much\" (Lyric: \"That's the end?\") \n\nHere are the bands in the video that we haven't yet figured out: Tina Turner (probably \"Simply The Best\"). Can you fill in the gaps?",
                "publishedAt": "2020-06-11T15:56:40.000Z"
              }
            }
          }
        }
      ]
    },
    {
      "contentDetails": {
        "duration": 232
      },
      "id": "yj97-YKtMfo",
      "snippet": {
        "title": "50 Songs From 1988 Remixed Into 3 Minutes",
        "description": "Samples of more than 50 songs from 1988 mixed together into one 3-minute song by The Hood Internet. NEW! Spotify playlist of all the samples used → https://spoti.fi/3uLsr8B\nWatch the whole ongoing playlist here: http://bit.ly/thi-79-99\n\nFeaturing:\nThe Bangles, Big Daddy Kane, Billy Ocean, Bobby Brown, Boogie Down Productions, Boy Meets Girl, Cocteau Twins, Danzig, Enya, Erasure, Escape Club, Fine Young Cannibals, Freddie Jackson, Fugazi, Guns N' Roses, Information Society, Jeffrey Osborne, Joan Jett & The Blackhearts, L'Trimm, The La's, Living Colour, MC Lyte, Metallica, Mike + The Mechanics, Milli Vanilli, N.W.A, Neneh Cherry, New Edition, New Kids On the Block, Paula Abdul, Pixies, Poison, Primitives, Prince, Public Enemy, R.E.M., Rob Base & DJ E-Z Rock, Robert Palmer, Roxette, Slick Rick, Steve Winwood, Talk Talk, They Might Be Giants, Tracy Chapman, U2, Whitney Houston\n\nContact your senators and legislators and let them know you support the National Independent Venue Association: http://saveourstages.com",
        "publishedAt": "2020-05-28T05:01:06Z",
        "thumbnails": {
          "default": {
            "url": "https://i.ytimg.com/vi/yj97-YKtMfo/default.jpg",
            "width": 120,
            "height": 90
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/yj97-YKtMfo/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "high": {
            "url": "https://i.ytimg.com/vi/yj97-YKtMfo/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/yj97-YKtMfo/sddefault.jpg",
            "width": 640,
            "height": 480
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/yj97-YKtMfo/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          }
        }
      },
      "comments": [
        {
          "id": "Ugz9b2yi-hJGEL5LXkZ4AaABAg",
          "snippet": {
            "videoId": "yj97-YKtMfo",
            "topLevelComment": {
              "snippet": {
                "textDisplay": "Here's what I've been able to figure out so far. What have I missed?  \n0:00 Guns n Roses \"Patience\" (Lyric \"1, 2, 1 2 3\")  \n0:04 U2 \"All I want is you\" (Lyric \"You say, you want, diamonds and rings of gold ... \" ) \n0:04 The La's \"There she goes\" (16 note electric guitar riff)  \n0:04 Poison \"Every rose has its thorn\" (Strummed guitar)  \n0:04 Prince \"Alphabet St\" (Drums)  \n0:14 Talk Talk \"I believe in you\" (Video: Cymbals) \n0:15 Poison \"Nothing but a good time\" (Audio: Electric guitar riff. Video: Guitarist on green stage) \n0:20 Living Colour \"Cult of Personality\" (Drummer in red singlet playing a drum fill)   \n\n0:22 The Pixies \"Gigantic\" (Lyric \"Gigantic\")  \n0:22 NWA \"Straight outta Compton\" (Audio: Drums + Video: Legs walking down the street)  \n0:23 Cocteau Twins \"Carolyn's Fingers\" (Video: Screen goes purple) \n\n0:39 L'Trimm \"Cars with the boom\" (Lyric \"We like the cars, the cars that go boom\". Note: Barely a hit in 1988, but went viral on TikTok in 2020. Can you imagine getting world famous when you're 50 for what you did when you were 15?) \n0:44 Boogie Down Productions \"My philosophy\" (Lyric \"Fresh for 88\")  \n0:49 Information Society \"What's on your mind (pure energy)\" (Audio: Electronic drums + Video: Drummer playing cartoon drums)  \n0:52 ? ? (Black and white video - man pointing)  \n0:52 The Bangles \"Eternal Flame\" (Audio: Electric piano chords)  \n0:53 Jeffrey Osborne \"She's on the left\" (Audio: High synth rhythm where the notes are an octave apart. Video: Woman throws glitter into the air)  \n0:54 Big Daddy Kane \"Ain't no half steppin'\" (Two men face each other in a boxing ring)  \n0:54 Tracy Chapman \"Fast Car\" (Video: Singer with black background with a gold light to the right of her head)   \n\n0:56 Neneh Cherry \"Buffalo Stance\" (Lyric: \"We always hang in a buffalo stance ...\")  \n0:56 Mike + the Mechanics \"The Living Years\" (Audio: Guitar chord + keyboard pads. Video: Guitarist with black and white guitar)  \n1:02 ? ? (Keyboardist in a leather jacket with a Yamaha DX7, because it's 1988) \n1:07 Slick Rick \"Children's story\" (Audio: Piano riff + Video: Someone throws a bag of money at an eye-patched rapper)  \n1:07 New Kids on the Block \"The right stuff\" (Audio: Bass drum + Video: A guy wearing a leather jacket and fedora dances)  \n\n1:08 Paula Abdul \"Cold-hearted\" (Lyric: \"He's a cold-hearted snake, look into his eyes \")  \n1:11 ? ? (A couple of mods, one wearing a jacket but not shirt and dancing with a megaphone, stand near a purple pillar with blue neon lights on it)  \n1:19 Escape Club \"Wild wild west\" (A pirate plays the simplest drum beat possible)  \n\n1:26 Bobby Brown \"Don't be cruel\" (Lyric: \"Don't be, don't be. Don't be, don't be, baby ... \")  \n1:26 Public Enemy \"Don't believe the hype\" (Lyric: \"Don't. Don't Don't. Don't believe the hype\")  \n1:26 They Might Be Giants \"Ana Ng\" (Audio: Fuzzy guitar rhythm. Video: Two guys banging on desks at 1:29.)  \n1:30 Slick Rick \"Children's story\" reprise (Piano riff)  \n1:31 MC Lyte \"Lyte as a rock\" (Singer in oversized white coat in a stylised video)  [Thanks Reldnah 123456789 for spotting that!]\n1:33 New Edition \"If it isn't love\" (Backing singers turn around in jumps)  \n\n1:35 Metallica \"One\" (Video: Black and white video of guitar / doctors staring down at patient)  \n1:36 Fugazi \"Waiting room\" (Video: Punk band. Audio: Bass guitar)  \n1:39 Danzig \"Mother\" (Lyric: \"Mother, tell your children not to walk my way...\")   \n1:41 Joan Jett & the Blackhearts \"I hate myself for loving you\" (Audio: Drum beat + Video: Black and white video of a woman / studded boots walking down street)  \n1:44 Billy Ocean \"Get outta my dreams\" (Lyric: \"Hey!\", Video: Man in car shouting \"Hey!\")  \n1:46 Roxette \"She's got the look\" (Video: Woman doing the ironing. But, you know, sexily.  Lyric: \"She's got the look\" at 1:52 )  \n1:47 Roxette \"Listen to your heart\" (Audio: Synth line. Video: people holding sparklers and cigarette lighters)  \n1:55 ? ? (Drummer wearing a purple headband)\n\n1:57 Paula Abdul \"Opposites attract\" (Audio: Synth line + Video: Paula Abdul dances with cartoon characters)   \n2:11 Paula Abdul \"Straight Up\" (Audio: synth flute riff + Video: Black and white video of dancer)  \n2:12 Steve Winwood \"Roll with it\" (Drum fill)   \n\n2:13 Fine Young Cannibals \"She drives me crazy\" (Lyric: \"She drives me crazy. Oh. Oh....\")  \n2:13 Pixies \"Where is my mind\" (Audio: Strummed guitar. Note: This song was used over the closing credits in the movie \"Fight Club\")\n2:17 Enya \"Orinoco Flow\" (Audio: Synth string pizzicato. Video: Stop motion video of short-haired woman in a white shirt)  \n2:24 REM \"Stand\" (Globe spinning with objects attached on chains  + Audio: High synth drone)  \n2:28 Robert Palmer \"Simply Irresistible\" (Video: Five simply irresistible dancers)  \n\n2:31 Rob Base & DJ E-Z Rock \"It takes two\" (Audio: Percussion & \"yeah!\" + Video: Crowd on street, led by rapper in a green and white tracksuit and white cap)  \n2:34 Milli Vanilli \"Girl you know it's true\" (Lyric: \"Girl you know it's true\" + Video: Milli Vanilli lip syncing to someone else singing \"Girl you know it's true\")  \n\n2:43 Primitives \"Crash\" (Blonde singer sings \"Na nana nana, na nana nana, ah\")  \n2:45 ? ? (Grainy black and white video of a guy checking out a girl)  \n2:50 U2 \"Angel of Harlem\" (Black and white video of session musicians in a brass section being looked at by a guitarist in a hat and wearing a cross)  \n2:51 Erasure \"A little respect\" (Blond singer with very high voice and a white t-shirt.)  \n2:52 ? ? (Saxophone player standing next to a guitarist wearing an American flag jacket)  \n2:58 Boy Meets Girl \"Waiting for a star to fall\" (Keyboard riff) \n2:59 Whitney Houston \"One moment in time\" (Singer in front of gold stage-risers and wearing a dark pink blouse and black dress bows. Taken from a 1989 Sammy Davis Jr concert. )\n\nNot worked out yet: Freddie Jackson",
                "publishedAt": "2020-08-11T18:12:10.000Z"
              }
            }
          }
        }
      ]
    },
    {
      "contentDetails": {
        "duration": 181
      },
      "id": "AT1uhV-maZQ",
      "snippet": {
        "title": "50 Songs From 1987 Remixed Into 3 Minutes",
        "description": "Samples of more than 50 songs from 1987 mixed together into one 3-minute song by The Hood Internet. NEW! Spotify playlist of all the samples used → http://spoti.fi/30bFhPs\nWatch the whole ongoing playlist here: http://bit.ly/thi-79-99\n\nFeaturing:\nAerosmith, Audio Two, Belinda Carlisle, Boogie Down Productions, The Cure, Def Leppard, Depeche Mode, Eazy-E, EPMD, Eric B. & Rakim, Eurythmics, George Michael, Guns N Roses, Heart, INXS, Jody Watley, Lisa Lisa & Cult Jam, LL Cool J, Love And Rockets, Madonna, MARRS, Michael Jackson, Midnight Oil, New Order, Pebbles, Prince, Public Enemy, R.E.M., Rick Astley, Salt N Pepa, Sonic Youth, Starship, T'Pau, Taylor Dayne, Tiffany, U2, Was (Not Was), When In Rome, Whitesnake, Whitney Houston",
        "publishedAt": "2020-05-21T04:48:13Z",
        "thumbnails": {
          "default": {
            "url": "https://i.ytimg.com/vi/AT1uhV-maZQ/default.jpg",
            "width": 120,
            "height": 90
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/AT1uhV-maZQ/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "high": {
            "url": "https://i.ytimg.com/vi/AT1uhV-maZQ/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/AT1uhV-maZQ/sddefault.jpg",
            "width": 640,
            "height": 480
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/AT1uhV-maZQ/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          }
        }
      },
      "comments": [
        {
          "id": "Ugxl9-UWSPMgOUvsWK94AaABAg",
          "snippet": {
            "videoId": "AT1uhV-maZQ",
            "topLevelComment": {
              "snippet": {
                "textDisplay": "Here’s what I could work out so far. What have I missed?\n0:00 Prince “If I was your girlfriend” (Fade in of high synth chord)\n0:01 REM “It’s the end of the world as we know it” (Video: Boy with skateboard. Lyric “It’s the end of the world as we know it”)  \n0:03 Whitesnake “Here I go again ’87” (Woman in white doing cartwheels on cars)  \n0:07 Eric B. & Rakim \"I ain't no joke\" (Video: Graffitied wall. Audio: Drums)  [Thanks Reldnah 123456789!]\n0:08 The Cure “Just like heaven” (Audio: synth riff, Video: Keyboardist wearing black in the twilight) \n0:11 REM \"It's the end of the world as we know it\" (Video: Boy with tambourine) [Thanks WDP Music!]  \n\n0:14 Heart “Alone” (Drummer and Exploding piano played by band in pink smoke)\n0:16 Guns n Roses “Paradise City” (Singer wearing white dances around holding microphone stand)\n0:17 Public Enemy “Bring the noise” (Lyric “Here we go again” and at 0:22 “Bring the noise\")\n0:20 Eric B. & Rakim “Paid in Full” (Audio: Drum beat, Video: Stripey wall with man in hat dancing / blonde women @ 0.32)\n0:28 Def Leppard “Pour some sugar on me” (Lyric “Yeah!”)\n0:33 Eazy-E “Boyz-n-the-Hood\" (Arpeggiated synth, & lyric “Cruisin down the street in my 6-4”)  \n\n0:35 George Michael “Faith” (Lyric “Well I guess it would be nice...” + Video: Black and white video except the jeans are coloured blue.) \n0:35 Prince \"Sign o the Times\" (Audio: Synth arpeggio) [Thanks Cedric N!]\n0:35 U2 \"I Still Haven't Found What I'm Looking For\" (Audio: Rhythm guitar + Video: Guitarist with brown hat and waistcoat walks down the street)  \n0:41 ? ? (Street full of dancers shake their heads in time to the arpeggiated synth from a totally different music video, which is really quite impressive)  \n0:43 Eric B. & Rakim \"I know you got soul\" (Video: DJ in white wearing a big gold chain, reprised at 0:53. From their live performance on Soul Train. ) [Thanks Reldnah 123456789]\n0:46 Audio Two “Top Billin’\" (Video: Dancers in front of aqua background move their hands up and down. Lyric “Oh oh! Oh oh!”)   \n\n0:56 Love and Rockets “No New Tale to Tell\" (Three people dressed as bees)\n0:57 Terence Trent D'Arby \"Wishing Well\" (Audio: Whistling) \n0:57 Def Leppard “Pour some sugar on me” reprise (Singer saying “Yeah!”)\n0:58 U2 \"I Still Haven't Found What I'm Looking For\" reprise (Bono does the twist)\n0:59 EPMD “You gots to chill” (Video: Two guys wearing t-shirts that say “EPMD You gots to chill”)\n1:00 T'Pau “Heart and soul\" (Silhouettes against a purple wall)\n1:03 Starship “Nothing’s gonna stop us now” (Audio: Drum fill. Video: Motorcyclist rides down street at night.)  \n\n1:04 Salt n Pepa “Push it” (Lyric “Salt and Pepa’s here and we’re in effect…”)\n1:05 LL Cool J \"Going Back to Cali\" (Black and white video of LL Cool J in a bucket hat standing in front of a diner, while a muted trumpet note plays)\n1:07 Midnight Oil “Beds are burning” (Audio: Big brass sting. Video: Man silhouetted against the moon. Band silhouetted against the Australian Outback.)\n1:08 Aerosmith “Dude looks like a lady” (Video: Singer in red jacket. Audio: Muted “Yeah-air! Yeah-air!”)\n1:11 Taylor Dayne “Tell it to my heart” (Blonde woman with two male dancers in denim)\n1:13 Depeche Mode “Never let me down again” (Man runs down a country road)  \n1:15 INXS \"Never tear us apart\" (Guitar riff, played on a brown guitar) [Well spotted Jakob Mueller!]\n1:18 Michael Jackson “Smooth Criminal” (Audio: Bass line. Video: Bar room full of people dressed like it’s 1940)  \n\n1:20 REM “The one I love” (Lyric: \"This one goes out to the one I love\" + Video: Flower opens up.)\n1:23 Pebbles “Girlfriend” (Woman with curly hair says “Oh”)\n1:24 Lisa Lisa & Cult Jam “Head to toe\" (Woman with curly hair wiggles her shoulders)\n1:24 Jodi Watley “I’m looking for a new love” (Lyric: “My love! Yeah yeah yeah!”)\n1:28 Aerosmith “Dude looks like a lady” reprise (Singer in red jacket)\n1:29 REM “The one I love” reprise (man blows out a candle and disappears in a shower of sparks)  \n\n1:36 Salt n Pepa \"Push It\" reprise (Lyric: \"Push Hard. Squash it\")\n1:39 INXS “Need you tonight” (Lyric “Come over here”) \n1:43 When in Rome “The promise\" (Piano riff)\n1:44 Was Not Was “Walk the Dinosaur” (Lyric “Boom boom, aka laka laka boom”, video of bikinied women in jungle made of cardboard)\n1:46 Tiffany “I think we’re alone now” (Girl waving her arm over her head in a shopping mall) (Tiffany got famous doing concerts in malls)  \n\n1:52 Whitney Houston “I wanna dance with somebody” (Ms Houston would like to announce her intention to dance with somebody)\n1:52 U2 “With or without you” (Backing music to Whitney Houston's lyrics)\n2:00 Rick Astley “Never gonna give you up” (Congratulations! You've been rick rolled!)\n2:00 Guns n Roses “Sweet child o’ mine” (Epic guitar riff behind \"Never gonna give you up\")  \n\n2:07 Belinda Carlisle “Heaven is a place on Earth” (Lyric “Ooh baby do you know what that’s worth?”)\n2:07 INXS “New Sensation” (Audio: Guitar and drum backing music to Belinda Carlisle)  \nKiller fact: Belinda Carlisle and Michael Hutchence from INXS dated in the early 80s, so it’s clever that their songs are together here.  \n\n2:23 MARRS “Pump up the volume” (Video: Green rockets are fired from MARRS to Earth. Note: The sampled lyric \"Pump up the volume\" is from Eric B. & Rakim's \"I know you got soul\", which came out the same year and is in this mashup.) [Thanks Reldnah 1234656789!]  \n2:26 Public Enemy “Bring the noise” reprise (Lyric “Turn it up”, video: Public Enemy high five each other)\n2:28 Eurythmics “I need a man\" (Blonde in blue dress walks away from the camera pumping her arm)  \n\n2:29 Michael Jackson \"Bad\" (5 male dancers + an acrobat, reprised at 2:40)\n2:32 Whitney Houston “I wanna dance with somebody” reprise (Ms Houston would like to reiterate her intention to dance with somebody)\n2:32 U2 “Where the streets have no name” (Backing music to Whitney Houston's lyrics. Same band. Same Chords. Different song)\n2:35 Michael Jackson \"Bad\" (Man moonwalks while wearing roller skates.)\n2:38 New Order “True Faith” (Video: People wearing foam barrels slap each other. Audio: hectic drums.)  \n\n2:47 The Cure “Just like heaven” reprise (Bride dancing on a cliff above a roiling ocean.)\n2:51 Heart “Alone” reprise (Electric piano part at the end. Which is from the beginning of the song. Before their piano exploded at 0:14)\n\nNot figured out yet: Boogie Down Productions (probably \"South Bronx\" or \"The Bridge is Over\"), Madonna, Sonic Youth (Possibly Sonic Youth's cover of Madonna songs)\nIn the video but not in the description: Terence Trent D'Arby",
                "publishedAt": "2020-08-08T07:37:59.000Z"
              }
            }
          }
        },
        {
          "id": "UgzD-RJI0ThfTdQ_Ged4AaABAg",
          "snippet": {
            "videoId": "AT1uhV-maZQ",
            "topLevelComment": {
              "snippet": {
                "textDisplay": "0:40 - George Michael \n0:41 - the fan-girls\n\nX-D",
                "publishedAt": "2021-03-30T04:23:40.000Z"
              }
            }
          }
        }
      ]
    },
    {
      "contentDetails": {
        "duration": 184
      },
      "id": "GklP0ATsEtw",
      "snippet": {
        "title": "50 Songs From 1986 Remixed Into 3 Minutes",
        "description": "Samples of more than 50 songs from 1986 mixed together into one 3-minute song by The Hood Internet. NEW! Spotify playlist of all the samples used → http://spoti.fi/3rj984g\nWatch the whole ongoing playlist here: http://bit.ly/thi-79-99\n\nFeaturing:\nThe Bangles, Beastie Boys, Berlin, Billy Bragg, Billy Joel, Bon Jovi, Boogie Down Productions, Book Of Love, Bruce Hornsby & The Range, Cutting Crew, Cyndi Lauper, Duran Duran, Eric B. & Rakim, Europe, Fingers Inc., Genesis, Gwen Guthrie, Howard Jones, Human League, Janet Jackson, Lionel Richie, Loose Ends, Madonna, Metallica, Midnight Star, New Order, Nu Shooz, Oran Juice Jones, Orchestral Manoeuvres in the Dark, Paul Simon, Peter Gabriel, Robbie Nevil, Run-D.M.C., Run-D.M.C. & Aerosmith, Samantha Fox, Slayer, Smithereens, Stan Bush, Steve Winwood, Whistle",
        "publishedAt": "2020-05-14T04:52:17Z",
        "thumbnails": {
          "default": {
            "url": "https://i.ytimg.com/vi/GklP0ATsEtw/default.jpg",
            "width": 120,
            "height": 90
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/GklP0ATsEtw/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "high": {
            "url": "https://i.ytimg.com/vi/GklP0ATsEtw/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/GklP0ATsEtw/sddefault.jpg",
            "width": 640,
            "height": 480
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/GklP0ATsEtw/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          }
        }
      },
      "comments": [
        {
          "id": "Ugw1QvpsD-mqa9ywuYN4AaABAg",
          "snippet": {
            "videoId": "GklP0ATsEtw",
            "topLevelComment": {
              "snippet": {
                "textDisplay": "Building on the excellent work by Aleksandra Danielewicz, here are the songs with time codes to make it easier to figure out which ones are missing. Can you help fill in the gaps?  \n0:00 ? ? (Sound of distant thunder)\n0:00 Bruce Hornsby and the Range “The Way It Is” (Piano riff)\n0:00 ? ? (Synth rhythm underneath)\n\n0:06 Beastie Boys “(You Gotta) Fight For Your Right (To Party)” (Audio: Heavy guitar chord + Video: Beastie Boy kicks the door down)\n0:06 Paul Simon “You Can Call Me Al” (Audio: Horn section + Video: Paul Simon and Chevy Chase play horns)\n0:09 Book of Love \"Boy\" (Audio: One note played on a synth + Video: Lady in black and white plays one note on a synth)\n0:10 ? ? (Man plays the bongos)\n0:14 Billy Bragg \"Greetings to the New Brunette\" (Subtle acoustic guitar strum) [Thanks Geecy Project!]\n0:15 Peter Gabriel “Sledgehammer” (Lyric: “Yeah” + Video: Stop-motion Peter Gabriel)  \n0:18 Billy Joel \"A Matter of Trust\" (Lyric: “One. Two. One two three…”)\n\n0:21 Run DMC “It’s Tricky\" (Lyric: “Here we go. It’s tricky to rock a rhyme to rock a rhyme that’s right on time it’s tricky …” + Audio: Drumbeat)\n0:21 Paul Simon “You Can Call Me Al” reprise (Audio: Horn section)\n0:29 Bon Jovi “Livin’ on a Prayer” (Screamed Lyric: “Ah AH” + Video: Bon Jovi screaming their lyric)\n0:35 Steve Winwood \"Higher Love\" (Video: Black and white video of man singing “Oh Oh”. Also a quick frame at 0:16 of bongos)\n0:37 Stan Bush \"You've Got The Touch!\" (Lyric “You've got the touch!” + Video: Oversaturated guitarist plays in front of a cartoon mountain)\n\n0:38 Genesis “Invisible Touch” (Lyric: “She seems to have an invisible touch eh” + Video: Phil Collins sings into a ruler)\n0:43 Samantha Fox “Touch Me” (Lyric: “Touch me, touch me…”)\n0:46 Bon Jovi “Livin on a Prayer” reprise (Screamed Lyric: “Ah AH”)\n0:50 Orchestral Manoeuvres in the Dark “If You Leave” (Lyric: “I touch you once, I touch you twice…”)\n0:54 Beastie Boys \"Brass Monkey\" (Audio: Synth saxophone) [Thanks Jakob Mueller!]\n0:54 Midnight Star \"Midas Touch\" (Lyric \"Touch. Touch\" + Video: Drummer wearing a blue camouflaged suit plays in front of a building site) [via RW]\n0:54 Human League \"Human\" (Audio: Deep piano note followed by drum beat + Video: A drop of water hits a still pond)\n1:01 Peter Gabriel “Sledgehammer” reprise (Audio: Chiff-flute riff, played on a synth + Video: Black screen with green-y white dots. Note: This is what it would sound like if an alien attempted to play Abba’s “Gimme gimme gimme a man after midnight\")\n\n1:02 Europe “The Final Countdown” (Audio: Synth brass riff + Video: Clock, concert at 1:10) [Thanks Southpaw Frizzell!]\n1:02 Cutting Crew \"(I Just) Died In Your Arms\" (Audio: Cello melody in the background + Video: Black and white video of a woman pretending to play a cello)\n1:06 Cyndi Lauper \"True Colors\" (Audio: Bass drum beat + Video: Woman with wild blonde hair hits a hand drum)\n1:09 Metallica \"Master of Puppets\" (Audio: 2 lead guitars harmonising each other + Video: Metallica guitarists in front of their Marshall stack at the Roskilde Festival) \n1:10 Beastie Boys \"Brass Monkey\" reprise (Audio: Distorted synth sax) [Thanks Jakob Mueller!]\n1:15 Slayer \"Raining Blood\" (guitarist dressed in black) [Thanks Geecy!]\n1:17 Peter Gabriel “Sledgehammer” reprise (Audio: Horn riff + Video of man’s eye)\n\n1:19 Madonna \"Papa Don't Preach\" (Madonna walks in front of New York Harbour)\n1:19 Genesis “Land of Confusion” (Lyric: “I must have dreamed a thousand dreams …”)\n1:19 Genesis \"Tonight Tonight Tonight\" (Lyric: \"Oh Ho. I'm gonna make it right...\")\n1:19 Fingers Inc \"Mystery of Love\" (Quiet synth riff under “must have dreamed a”)\n1:19 ? ? (Electric hi hats)\n1:28 Madonna \"Papa Don't Preach\" reprise (Madonna wears black and dances backwards across the stage)\n1:32 Duran Duran “Notorious” (Lyric “No no. Notorious” + Video: A black leg swivels in a red background and dancers at 1:39) [Thanks Southpaw Frizzell!]\n1:33 Peter Gabriel “Sledgehammer” reprise (Two stop-motion roast chickens dance with each other. Because this is the 80s.)\n\n1:34 Janet Jackson “Control\" (Lyric: “When I was 17 I did what people told me”) \n1:34 The Smithereens \"Blood and Roses\" (Audio: Bass riff + Video: quick cut of a 3 piece band in a purple video)\n1:34 Janet Jackson “What Have You Done For Me Lately?” (Audio: Synth riff at 1:37 + Video: Dancers at 1:38)\n1:34 Boogie Down Productions \"South Bronx\" (Audio: High synth horns) [Thanks Jakob Mueller!]\n1:39 Bon Jovi “Livin’ on a Prayer” reprise (Guitar vocoder lyric: “oo wah oo wah … WAAAAOW\" + Black and white video of hair metal band)\n1:41 Run DMC \"Peter Piper\" (Audio: Record scratch, followed by complex bell-like drum beat) [Thanks Jakob Mueller!]\n1:51 Janet Jackson “When I Think of You” (Lyric: “Ooooh”)\n1:52 Eric B and Rakim \"Make em Clap To This\" (Lyric: “May may may make em clap to this”)\n1:57 Prince “Kiss\" (Lyric: “Argh!” + Video: As the lights come up on the stage, Prince realises he forgot to put his shirt on.)\n\n1:58 New Order “Bizarre Love Triangle” (Lyric: “Everytime I see you falling, I get down on my knees and pray” + Video: Woman falling)\n1:58 Prince “Kiss” reprise (Audio: Drums & rhythm guitar + Video: Man dances in front of a red backdrop)\n2:04 ? ? (Audio: Guitar riff + Video: Black and white video of band)\n2:05 Genesis “Invisible Touch” reprise (Phil Collins hits a cymbal on a drum machine)\n2:07 Lionel Richie \"Dancing on the Ceiling\" (Lionel Richie wears red. Everyone else wears black, white and silver)\n\n2:13 Run DMC and Aerosmith “Walk This Way” (Lyric: “She told me to … “)\n2:14 The Bangles “Walk Like an Egyptian” (Lyric: “Walk like an Egyptian…”)\n2:14 Nu Shooz \"I Can't Wait\" (Audio: Rubber bass riff + Video: Woman in green dress inspects a microscope slide / unfurls a set of implements.)  [Thanks Jakob Mueller!]\n2:14 ? ? (High guitar riffs)\n2:17 ? ? (Singer in a rainy garden sings a high note. I think it's Gwen Guthrie)  \n2:18 Genesis \"Tonight Tonight Tonight\" (Audio: Drum riff played twice) [Thanks Jakob Mueller!]\n2:20 Peter Gabriel “Big Time” (Lyric: “I’m on my way, I’m making it” + Video: Man in chequered red jacket and bow tie)\n2:26 Beastie Boys \"You've Got To Fight For Your Right to Party\" reprise (Lyric: “Yeah!!” + Video: Beastie Boy smashes a guitar against a wall. Later someone smashes a glass on their head at 2:28) \n2:26 Beastie Boys \"Paul Revere\" (Audio: Cymbal played in reverse. Note: This song is famous for being a hip hop beat played backwards) [Great insight Jakob Mueller!]\n\n2:27 Janet Jackson “Nasty” (Lyric: “Gimme a beat” + Video: Janet Jackson dances in front of a cinema screen.) \n2:28 Lionel Richie \"Dancing On The Ceiling\" reprise \n2:28 Paul Simon “You Can Call Me Al” reprise (Paul Simon looks worried)\n2:31 Peter Gabriel “Big Time” reprise (Lyric: “Yeah!” + Video: The pyramid from a $US1 note sings.)\n2:34 Run DMC and Aerosmith “Walk This Way” reprise (Lyric: “It started with a little kiss, like this”)\n2:35 Berlin “Take My Breath Away” (Audio: Bass riff + Video: A woman standing on Tom Cruise’s F16 from the movie “Top Gun”)\n2:37 The Bangles “Manic Monday” (Audio: High synth riff + Video: Woman in a green dress walking down the street looks back)\n2:37 Eric B and Rakim \"Make em Clap To This\" (Lyric \"May may may make em clap to this”)\n2:44 Berlin “Take My Breath Away” reprise (Woman silhouetted against the late afternoon sky)\n2:45 Beastie Boys “You Gotta Fight For Your Right To Party” (Lyric: “You gotta fight for your right to party”)\n2:46 The Bangles \"Manic Monday\" reprise (A calendar flips through 1986) [Thanks Julio Diaz!]\n2:49 Samantha Fox “Touch Me” (Lyric “This is the night\")\n\n2:53 The Bangles “Walk Like An Egyptian” reprise (Whistling)\n2:53 ? ? (Video: Mannequins in a blue room)\n2:56 Howard Jones \"No One Is To Blame\" (Audio: Light percussion + Video: Some type of machine with a spinning metal pole)\n2:59 Beastie Boys “You Gotta Fight For Your Right To Party” (Video: Parents return to find the house in chaos)\n\nNot figured out yet:  Gwen Guthrie,  Loose Ends, Oran Juice Jones,  Robbie Nevil, Whistle",
                "publishedAt": "2020-09-09T18:15:20.000Z"
              }
            }
          }
        }
      ]
    },
    {
      "contentDetails": {
        "duration": 177
      },
      "id": "Le6RTavyuxI",
      "snippet": {
        "title": "50 Songs From 1985 Remixed Into 3 Minutes",
        "description": "Samples of more than 50 songs from 1985 mixed together into one 3-minute song by The Hood Internet. NEW! Spotify playlist of all the samples used → http://spoti.fi/3qdjPEi\nWatch the whole ongoing playlist here: http://bit.ly/thi-79-99\n\nFeaturing:\nAretha Franklin, Billy Ocean, Cameo, Commodores, The Cult, The Cure, DeBarge, Dire Straits, Doug E. Fresh & The Get Fresh Crew, Dream Academy, Duran Duran, Echo And The Bunnymen, Eddie Murphy, Faith No More, Grace Jones, Huey Lewis & The News, INXS, Jesus & Mary Chain, Kate Bush, Katrina & The Waves, Killing Joke, LL Cool J, Madonna, Miami Sound Machine, Mike + The Mechanics, Minor Threat, Motley Crue, Mr. Mister, New Order, Orchestral Manoeuvres In The Dark, The Outfield, Pat Benatar, Pet Shop Boys, Phil Collins, Prince & The Revolution, The Replacements, Robert Palmer, Run-D.M.C., Schoolly D, Simple Minds, Siouxsie & The Banshees, Stacey Q, Starship, Talking Heads, Tears For Fears, Tom Waits, Whitney Houston, Yello",
        "publishedAt": "2020-05-07T04:40:27Z",
        "thumbnails": {
          "default": {
            "url": "https://i.ytimg.com/vi/Le6RTavyuxI/default.jpg",
            "width": 120,
            "height": 90
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/Le6RTavyuxI/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "high": {
            "url": "https://i.ytimg.com/vi/Le6RTavyuxI/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/Le6RTavyuxI/sddefault.jpg",
            "width": 640,
            "height": 480
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/Le6RTavyuxI/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          }
        }
      },
      "comments": [
        {
          "id": "UgzKJb4eHfrIdSjXdVt4AaABAg",
          "snippet": {
            "videoId": "Le6RTavyuxI",
            "topLevelComment": {
              "snippet": {
                "textDisplay": "Here's what I can figure out so far. What have I missed?  \n0:00 Billy Ocean \"Loverboy\" (Opening chord, and video of a star-filled galaxy)  \n0:04 Siouxsie & The Banshees \"Cities in Dust\" (jaw harp rhythm + video of ... is that blood?)  \n0:08 Prince \"Raspberry Beret\" (Lyric \"1, 2, 1, 2, 3\")  \n0:11 Doug E Fresh and the Get Fresh Crew \"La di da di\" (Lyric: \"Hit it!\") [Thanks for spotting it, Reldnah 123456789!]\n\n0:11 New Order \"The Perfect Kiss\" (Drum fill on electric drums)\n0:12 Killing Joke \"Eighties\" (Lyric \"Nineties\". Note: This song is one of several with the same guitar riff as Nirvana's \"Come as you are\")  \n0:12 Dire Straits \"Money for Nothing\" (Guitar riff)  \n0:14 Yello \"Oh Yeah\" (Lyric: \"Chk Chk Ah\")  \n0:16 Robert Palmer \"Addicted to Love\" (Big drums, + video of simply irresistible women)  \n0:20 Pet Shop Boys \"West End Girls\" (Synth Rhythm in the background, which is from the last minute of the West End Girls song)\n0:23 Stacey Q \"Two of hearts\" (Lyric: \"I need you I need you\" + video later of a woman in a red bikini)  \n0:26 Madonna \"Into the Groove\" (Lyric: \"Come on\". Note: This song featured in the movie \"Desperately Seeking Susan\")  \n0:27 Miami Sound Machine \"Conga\" (Drummer in red vest and white braces) \n0:33 Simple Minds \"Don't you forget about me\" (Lyric: \"Hey hey hey hey\")  \n\n0:36 Yello \"Oh Yeah\" (Lyric: \"Oh Oh\")  \n0:36 INXS \"What you need\" (Guitar riff and synth bass + video of man with messy hair) \n0:38 Cameo \"Word up\" (Lyric: \"Now word up\")  \n0:46 Talking Heads \"And she was\" (Video stills of a man whispering into a telephone)  \n\n0:47 Run DMC \"King of Rock\" (Lyric \"I'm the king of rock, there is none higher, sucker MCs should call me sire ... \")  \n0:48 Schoolly D \"P.S.K. What does it mean?\" (Echoey drums) [Well spotted by Reldnah 123456789!]\n0:48 Tears for Fears \"Head over Heels\" (Synth line)  \n0:55 LL Cool J \"I can't live without my radio\" (Rapper in white and blue tracksuit and blue hat)  \n\n0:56 Katrina and the Waves \"Walking on Sunshine\" (Lyric \"I used to think maybe you loved me, now baby I'm sure...\")  \n0:56 Phil Collins \"Sussudio\" (Synth part + video of Phil Collins clapping)  \n1:01 Whitney Houston \"How will I know\" (Lyric: \"How will I know?\")  \n1:03 Eddie Murphy \"Party all the time\" (video: Eddie Murphy clapping. NB: This song, recorded to win a $1 million bet with Richard Pryor who said Eddie couldn't sing, was voted #7 in the \"Top 50 worst songs of all time\" by VH-1.)  \n1:12 Mr Mister \"Kyrie\" (Guitarist spinning around)  \n1:15 DeBarge \"Rhythm of the night\" (Shoes)  \n\n1:20 Dream Academy \"Life in a northern town\" (Lyric \"Hey um mum mum mah\")   \n1:22 Tears for Fears \"Everybody wants to rule the world\" (Video: 2 guys dancing in front of a petrol station)  \n1:23 The Cure \"Close to me\" (Four-piece band in grey)  \n1:25 Jesus and Mary Chain \"Just like honey\" (Someone hits a snare drum weakly)  \n1:26 The Commodores \"Nightshift\" (Video of hexagonal cymbals. This whole song is a tribute to dead R&B singers, like Marvin Gaye and Jackie Wilson)\n1:28 Huey Lewis and the News \"The Power of Love\" (Intense guy shouts at microphone)  \n1:30 Tom Waits \"Downtown Train\" (Someone casually destroys a ceiling with his hat)  \n1:33 Grace Jones \"Slave to the Rhythm\" (A Grace Jones bot appears over the horizon, ready to eat a car if necessary.)  \n1:38 Motley Crue \"Home Sweet Home\" (Shirtless piano player, and this whole section is the same chord progression as the end of the Motley Cure song)  \n1:39 Duran Duran \"A view to a kill\" (Drummer wearing headphones and a black tank top. This video is from the Live Aid concert.)\n1:40 Starship \"We built this city on rock n roll\" (Audio: Electric guitar solo + Video: Man doing star jumps + weirdly colour-corrected guitar solo player at 1:46)  [ThanksWDP Music!]\n1:44 Phil Collins \"Take me home\" (Phil Collins has a glass of champagne in the back of a car that's also a swimming pool)  \n\n1:48 Mike and the Mechanics \"All I need is a miracle\" (Lyric: \"All I need is a miracle, all I need is you\")   \n1:55 The Cult \"She Sells Sanctuary\" (Guitarist with white hair) [Thanks WDP Music!]\n1:56 The Outfield \"Your Love\" (Video of woman painting a glass wall, and a man looking at a woman holding a clipboard)\n2:06 Kate Bush \"Running Up That Hill\" (urgent drum beat + video of ballet dancer in grey being held back by her partner)   \n2:08 Huey Lewis and the News \"The Power of Love\" reprise [Thanks WDP Music!]\n2:14 Aretha Franklin \"Freeway of Love\" (Black and white video of band pointing at the camera one at a time and saying \"Go\". Or possibly, \"No\". It's hard to tell.)  \n2:19 Pat Benatar \"Invincible\" (Black and white video of booted person walking towards the camera)  \n\n2:20 Tears for Fears \"Head over heels\" (Lyric: \"La lala la la...\" )  \n2:20 Echo and the Bunnymen \"Bring on the Dancing Horses\" (Unicorn head. Note: This song was on the soundtrack of the movie \"Pretty in Pink\".)  \n2:34 The Cult \"She Sells Sanctuary\" (Pirate sings operatically)   \n2:34 Orchestral Manoeuvres in the Dark \"So in love\" (Background vocals) I think. This could be wrong.\n2:41 Faith No More \"We Care a Lot\" (Lyric: \"We care a lot\")  \n2:47 Minor Threat \"Salad Days\" (Low guitar note. I think. Salad Days was released 2 years after Minor Threat split up, so it must be in here somewhere)\n2:47 The Replacements \"Bastards of Young\" (Black and white video of couch and loudspeaker)  \n\nNot figured out yet: \n[Nothing. Well done all!]",
                "publishedAt": "2020-08-02T15:55:05.000Z"
              }
            }
          }
        }
      ]
    },
    {
      "contentDetails": {
        "duration": 184
      },
      "id": "zMg2FF59CMw",
      "snippet": {
        "title": "50 Songs From 1984 Remixed Into 3 Minutes",
        "description": "Samples of more than 50 songs from 1984 mixed together into one 3-minute song by The Hood Internet. NEW! Spotify playlist of all the samples used → http://spoti.fi/3sMyzeV\nWatch the whole ongoing playlist here: http://bit.ly/thi-79-99\n\nFeaturing:\nA-Ha, Animotion, Art of Noise, Billy Ocean, Billy Squier, Bon Jovi, Bruce Springsteen, Bryan Adams, Cabaret Voltaire, Chaka Khan, Cherrelle, Chicago, Dead or Alive, Deniece Williams, Depeche Mode, Don Henley, Echo & The Bunnymen, General Public, Glenn Frey, Harold Faltermeyer, Husker Du, INXS, Kenny Loggins, Laura Branigan, Madonna, Metallica, New Edition, Newcleus, Ollie & Jerry, Pat Benatar, Paul Hardcastle, Philip Bailey with Phil Collins, Prince, Ray Parker Jr., Rebbie Jackson, REO Speedwagon, Run-D.M.C., Sade, Scandal (featuring Patty Smyth), Scorpions, Sheila E., Strafe, Talk Talk, Tears for Fears, The Cars, The Fleshtones, The Go-Gos, The Minutemen, The Ramones, The Replacements, The Sisters Of Mercy, The Smiths, Thompson Twins, Twisted Sister, U2, Van Halen, Wham!",
        "publishedAt": "2020-04-30T04:43:50Z",
        "thumbnails": {
          "default": {
            "url": "https://i.ytimg.com/vi/zMg2FF59CMw/default.jpg",
            "width": 120,
            "height": 90
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/zMg2FF59CMw/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "high": {
            "url": "https://i.ytimg.com/vi/zMg2FF59CMw/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/zMg2FF59CMw/sddefault.jpg",
            "width": 640,
            "height": 480
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/zMg2FF59CMw/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          }
        }
      },
      "comments": [
        {
          "id": "UgxSIdT-h7oIpHA7kxx4AaABAg",
          "snippet": {
            "videoId": "zMg2FF59CMw",
            "topLevelComment": {
              "snippet": {
                "textDisplay": "Here's the song list, as far I can figure out. Feel free to comment about what I've missed & point out corrections.  (Thanks @Denise Landau and @Liquid Light!)\n0:00 Van Halen \"1984\" (Audio: Flanged synth sound) [Thanks Brent Murphy!]\n0:00 The Ramones \"Too Tough To Die\" (Lyric: \"1 2 3 4\")  [Thanks awsummoner!]\n0:02  The Go-Gos \"Head over heels\". (Piano bit. That's Belinda Carlisle at the front btw).  \n0:03  Prince \"Let's go Crazy\" (\"... Dearly beloved ...\" monologue)  \n0:04 Husker Du \"Something I Learned Today\" (Video: Drummer wearing leopard skin shirt)\n0:06 The Smiths \"How Soon Is Now?\" (Video: Black and white video of singer spinning round + Audio: Low down electric guitar riff) [Thanks Jakob Mueller!]\n0:12 General Public \"Tenderness\" (Green and white dancing silhouette / high electric piano) [H/T Denise Landau] \n0:12 Kenny Loggins \"Footloose\" (Man dancing in front of the vertical blinds of some kind of smokey orange factory)\n0:21 Glenn Frey \"The Heat Is On\" (Video: Film editor taps along to music in black and white video) [Thanks awsummoner!]  \n\n0:22  A-ha \"Take On Me\" (Lyric: \"Take on me...\" + Video: Cartoonified man looks across a mirror at a real woman)\n0:22 Kenny Loggins \"Footloose\" (\"You've got to turn it around\" lyric) \n0:22 REO Speedwagon \"Can't fight this feeling\" (electric piano)  \n0:32 Don Henley \"Boys of Summer\" (Drums)  \n0:37 REO Speedwagon \"Can't Fight This Feeling\" (Video: Butterflies flying out of a guy's jacket) [Thanks awsummoner!] \n0:40 The Cars \"Drive\" (Woman drawing on the wall, and 1950s rockers)  [via Denise] \n0:42 ? ? (Someone swings a bat at some shelves, just before it cuts back to the a-ha song)\n0:42 The Fleshtones \"American Beat\" (Video: Drummer does a drum roll) \n\n0:43 The Smiths \"How Soon Is Now?\" (Throbbing guitar.) [via Jakob Mueller]  \n0:49 Van Halen \"Hot For Teacher\" (Video: Teacher waves her clothes around in front of her class) [ThanksJames Hagearty!]\n\n0:49 Tears for Fears \"Shout\" (Lyric: \"Shout, shout, let it all out ...\")\n0:52 Phil Collins & Phil Bailey \"Easy Lover\" (Two guys pretending they're ducks.)  \n0:54 U2 \"Pride (In the name of love)\" (Drum riff) [via Denise Landau] \n\n0:56 Prince \"When Doves Cry\" (Lyric: \"Dig if you will the picture ...\" + Video: Man in bath, with purple flowers in the foreground) \n0:59 Cherelle \"I Didn't Mean To Turn You On\" (Video: King Kong dancing on a building)\n1:00 Dead or Alive \"You spin me right round\" ( Video: Androgynous man next to flag-wavers / Androgynous man wiggling his hips)\n1:02 Bon Jovi \"Runaway\" (Guitar slide) [via Jakob Mueller]\n1:11 Billy Ocean \"No more love on the run\" (Electronic drum transition) [via Jakob Mueller, who is clearly a genius to recognise a whole song from a few drum beats!]\n\n1:12 Depeche Mode \"People are People\" (Lyric: \"People are people so why should it be ...\")\n1:12 Tears for Fears \"Shout\" reprise (Lyric: \"Come on\") \n1:14 Talk Talk \"It's My Life\" (Video: Man in front of flamingoes + Audio: One synth note)\n1:17 Thompson Twins \"Doctor Doctor\" (Video: Hands + Audio: Repeated three-note synth) [Thanks Geoff Bartlett!] \n1:22 Art of Noise \"Close to the edit\" (\"Hey\" lyric, later sampled on Firestarter by the Prodigy) \n1:27 Deneice Williams \"Let's hear it for the boy\" (electronic drums) [via Jakob Mueller] \n\n1:28 Ray Parker Jr \"Ghostbusters\" (Audio: Synth riff + Video: Ghostbusters walking down the street/ Ray Parker Jr levitating at 1:39) \n1:28 Tears for Fears \"Shout\" reprise (Lyric: \"Come on. I'm talking to you. Come on...\")  \n1:31 Deneice Williams \"Let's hear it for the boy\" (Video: Football player)\n1:33 Wham \"Everything She Wants\" (Black and white Andrew Ridgely saying \"la\" a few times.) \n1:34 Ollie & Jerry \"Breakin' ... There's No Stopping Us\" (Audio: Electric high hats)\n1:36 ? ? (Multi-coloured animated drawing on a black background)  \n1:42 Run DMC \"Rock Box\" (High faint twinkling synths) [Thanks K-Dog and Jakob Mueller!]\n\n1:42 Harold Faltemeyer \"Axel F\" (The most important synth record of the late 20th century.) \n1:42 Animotion \"Obsession\" (Other synth part playing at the same time. Not Axel F, so not the most important synth record of the late 20th century) [via Denise]\n1:42 Laura Branigan \"Self Control\" (Lyric: \"oh oh oh\" + Video: Woman walks down a corridor scared of being touched by outstretched arms at 1:52)\n1:46 Billy Squier \"Rock me tonight\" (finger snapping guy) [via The Real Wilfred Dierkes, who would like it known that she is not a fan!]  \n1:48 Rebbie Jackson \"Centipede\" (red lightning woman on balcony) [via James Hagearty]\n1:50 Animotion \"Obsession\" (\"You are an obsession...\" lyric)  \n1:51 Cabaret Voltaire \"Sensoria\" (Complex drums behind the song Obsession, plus dancing ladies) [thanks Nico Langdale!] \n1:52 ? ? (Video: Twilight, with women dressed in deep pink dresses) \n1:53 ? ? (Video: Low resolution video of a bass guitar player)\n1:57 Newcleus \"Jam On It\" (Guy not quite doing a somersault. Update: The move is called a suicide.) [Thanks K-Dog!] \n\n1:58 Echo and the Bunnymen \"The Killing Moon\" (badly lit guy)\n1:58 Madonna \"Like a virgin\" (Audio: Synth harmony to Echo & the Bunnymen + Video: Man with a lion head at 2:05 ) [Thanks Julio Diaz!]  \n1:58 Pat Benatar \"We Belong\" (Slowed down guitar harmonising both Echo and also the Bunnymen) [via Jakob Mueller]  \n2:06 The Go-Gos \"Head over heels\" (reprise)  \n\n2:13 Twisted Sister \"We're not gonna take it\" (Man in pink asserting that we're not, in fact, going to take it) \n2:13 A-ha \"Take on Me\" reprise (Slowed-down Lyric in the background: \"Take on me, take me on, I'll be gone\")\n2:15 Scorpions \"Rock You Like a Hurricane\" (Video: Metal band & woman with stripe on her eyes at 2:19 + Audio: Backbeat to \"We're not gonna take it\") [Well spotted by WDP Music, even though it's not on the list]\n2:16 Scandal ft. Patty Smyth \"The Warrior\"  (\"Bang bang\" lyric) [via Denise]\n2:20 Pat Benatar \"We Belong\" (Lyric: \"We Belong\")  \n2:22 ? ? (Man falls on a red roof)\n2:24 Van Halen \"Panama\" (Guitar riff)  \n2:29 Bruce Springstein \"Dancing in the Dark\" (dancing with a then-unknown Courtney Cox; this was her breakout) [Thanks Denise!]\n2:32 Bryan Adams \"Summer of 69\" (\"Oh yeah!\" lyric)\n2:33 Scandal ft Patty Smyth \"The Warrior\" (ballet dancers) [Thanks James Hagearty!] \n2:35 Bruce Springstein \"Born in the USA\" (The drummer is Max Weinberg) [Thanks Denise!] \n2:41 The Minutemen \"History Lesson Part II\" (Video: Bearded bass player in jacket and tie)  \n\n2:44 Bryan Adams \"Summer of 69\" reprise (Lyric: \"It was the summer of 69 ... Me and my baby in 69 ...\") \n2:45 Twisted Sister \"We're Not Gonna Take It\" reprise (Video: Man lies on concrete while bits of tile fall on him) [Thanks Julio Diaz!] \n2:45 Paul Hardcastle \"19\" (Audio: Complex drums and clapping) [Thanks Casey Plain!]\n2:45 Madonna \"Like a Virgin\" reprise (Lyric: \"Touched for the very first time\")  \n2:46 Sheila E \"Glamorous Life\" [Thanks Denise!]  \n2:51 The Replacements \"I Will Dare\" (Guitarists dressed in white play white guitars)\n2:55 ? ? (Band play in front of a sign that might say \"Whistle Test\")\n2:56 New Edition \"Cool It Now\" (basketball game) [Thanks Liquid Light!] \n\nNot found yet:\nChaka Khan, Chicago, INXS, Metallica, Sade, Strafe, The Sisters Of Mercy",
                "publishedAt": "2020-05-29T04:17:29.000Z"
              }
            }
          }
        }
      ]
    },
    {
      "contentDetails": {
        "duration": 185
      },
      "id": "rCaBfx872PA",
      "snippet": {
        "title": "50 Songs From 1983 Remixed Into 3 Minutes",
        "description": "Samples of more than 50 songs from 1983 mixed together into one 3-minute song by The Hood Internet. NEW! Spotify playlist of all the samples used → http://spoti.fi/3uRo7Vd\nWatch the whole ongoing playlist here: http://bit.ly/thi-79-99\n\nFeaturing:\nBilly Joel, Bonnie Tyler, Corey Hart, Cyndi Lauper, David Bowie, Def Leppard, Dio, Eurythmics, The Fixx, Grandmaster Flash & Melle Mel, Greg Kihn Band, Herbie Hancock, Huey Lewis & The News, Irene Cara, Journey, Kraftwerk, Lionel Richie, Madonna, Mtume, Nena, New Order, Night Ranger, Pat Benatar, The Pointer Sisters, The Police, Quiet Riot, R.E.M., Rick James, Rockwell, The Romantics, Run-DMC, Shannon, The Smiths, Spandau Ballet, Styx, Suicidal Tendencies, Talking Heads, The Tubes, U2, Van Halen, Yes, ZZ Top",
        "publishedAt": "2019-10-31T12:49:49Z",
        "thumbnails": {
          "default": {
            "url": "https://i.ytimg.com/vi/rCaBfx872PA/default.jpg",
            "width": 120,
            "height": 90
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/rCaBfx872PA/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "high": {
            "url": "https://i.ytimg.com/vi/rCaBfx872PA/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/rCaBfx872PA/sddefault.jpg",
            "width": 640,
            "height": 480
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/rCaBfx872PA/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          }
        }
      },
      "comments": [
        {
          "id": "Ugx8wUTzSiFTlF27gLt4AaABAg",
          "snippet": {
            "videoId": "rCaBfx872PA",
            "topLevelComment": {
              "snippet": {
                "textDisplay": "Here's what I've worked out so far. Let me know what I've missed.  \n0:00 Bonnie Tyler \"Total Eclipse of the Heart\" (Introductory piano riff)  \n0:00 Huey Lewis and the News \"The Heart of Rock and Roll\" (Bass drum)  \n0:04 REM \"Radio Free Europe\" (Audio: Flanged rhythmic sound)\n0:08 Yes \"Owner of a Lonely Heart\" (Guitar riff)  \n0:08 New Order \"Blue Monday\" (Audio: Electric bass drum + Video: Band in red light look down at their synthesisers)  \n0:14 Herbie Hancock \"Rockit\" (Audio: Drum fill + Video: TV shudders. Herbie Hancock is a legendary jazz musician, but in this track became a scratch pioneer.)  \n\n0:16 David Bowie \"Let's Dance\" (Lyric \"Let's Dance\" + Video of people dancing in the Australian outback)   \n0:16 Shannon \"Let the music play\" (Lyric: \"We started dancing and love put us into a groove\")   \n0:16 Eurythmics \"Sweet Dreams\" (Audio: Synth riff + Video: Androgynous woman with red hair and a suit glowers at the camera @ 0:21)  \n0:20 Grandmaster Flash \"White Lines\" (Lyric: \"Freeze! Rock!\")  \n0:24 Mtume \"Juicy Fruit (Drums)  \n0:26 Shannon \"Let the music play\" reprise (Lyric: \"What does love want me tooo dooo? Woah oh.\")  \n0:28 Dio \"Rainbow in the Dark\" (Audio: Synth riff + Video: A heavy metallurgist walks on a roof)  \n0:30 Talking Heads \"Burning Down the House\" (Guitarist in white clothes dances in front of white flames with a white guitar)   \n\n0:31 Shannon \"Let the music play\" reprise (Lyric: \"Let the music play, we won't get away...\" + Audio: bass synth riff)  \n0:31 U2 \"New Year's Day\" (Audio: Piano riff + Video: A young Bono marches around the stage at their 1983 Red Rocks concert)\n0:31 U2 \"Sunday Bloody Sunday\" (Audio: Drum riff)   \n\n0:47 Pat Benatar \"Love is a Battlefield\" (Audio: fast rhythm guitar + Video: Woman with a green top) \n0:47 The Fixx \"One Thing Leads to Another\" (Audio: Guitar chord riff + Video: Someone walks down a white tunnel)  \n0:47 Kraftwerk \"Tour de France\" (Audio: Faint panting sounds) [Well spotted Jakob Mueller!]\n0:51 Rockwell \"Somebody's Watching Me\" (Audio: \"Oh oh oh oh\" + Video: Man in shirt and tie backs away from the camera, horrified.)  \n0:52 Greg Kihn Band \"Jeopardy\" (Lyric: \"Oooo oo ooo oo\" + Audio: Drum triple at 0:55)\n1:01 Greg Kihn Band \"Jeopardy\" (Video: Groom at wedding screaming in horror. Note: This song was parodied by Weird Al Yankovic as \"I Lost On Jeopardy\")  \n\n1:04 Corey Hart \"Sunglasses at Night\" (Lyric: \"I wear my sunglasses at night\")  \n1:04 Eurythmics \"Here comes the rain again\" (Audio: High pizzicatto strings / violin riff + Video: Bearded man films a candle through a window)\n1:04 ZZ Top \"Gimme All Your Lovin'\" (Audio: Driving drum beat + Video: Drummer at 1:09 )  [Thanks for spotting that, WDP Music!]  \n1:13 Bonnie Tyler \"Total Eclipse of the Heart\" reprise (Lyric: \"Turn around\")  \n1:13 David Bowie \"Let's Dance\" reprise (Lyric: \"While colour light up your face. Let's Dance.\" + Video: Old guy dancing in a pub)  \n1:19 Suicidal Tendencies \"Institutionalized\" (Drum fill played by guy in flannel shirt and denim cap)   \n\n1:20 Irene Cara \"Flashdance (What a feeling)\" (Lyric: \"I can really have it all...\" + Video: Performance on \"Solid Gold\", for this is 1983.)\n1:20 Journey \"Separate Ways (Worlds Apart)\" (Synth riff + video: Band playing imaginary instruments on a wharf / Legs of a woman who means business)  \n1:23 Quiet Riot \"Cum On Feel the Noise\" (Heavy metal drummer)  [Thanks Jakob Mueller!]\n1:27 Huey Lewis and the News \"Heart and Soul\" (Woman does the eye dance thing)  \n1:27 Def Leppard \"Rock of Ages\" (Video: Drummer wearing Union Jack underpants / Black angular electric guitar, for this is 1983)  \n\n1:33 Run DMC \"It's Like That\" (Lyric: \"One thing I know it's that life is short ...\" + Video: Rappers)  \n1:33 Van Halen \"Jump\" (Audio: Synth brass riff + Video: Hair metal band doing hair metal band things around a stage)  \n1:46 The Tubes \"She's a Beauty\" (Audio: Synth rhythm riff + Video: Women in gold swimsuits) \n1:51 Lionel Richie \"All Night Long\" (Nicole Richie's Dad / the guy who Lionel Messi is named after is shown wearing a red shirt and pretending to be a chicken)   \n1:51 Van Halen \"Jump\" (Lyric: \"Jump!\") \n1:51 The Pointer Sisters \"Jump\" (Lyric: \"Jump in!\") \n1:51 Night Ranger \"Sister Christian\" (Audio: Light piano + Video: Keyboardist at 1:51 who looks like he's playing \"Jump\", but he's not. The Hood Internet know how to mix video!) [Well spotted Jakob Mueller!]  \n2:00 The Smiths \"This Charming Man\" (Lyric: \"Naa na naa\" + Video: Man in grey twirls a bunch of flowers)  \n2:01 Quiet Riot \"Metal Health\" (Lyric: \"Bang! Your! Head!\")  \n\n2:07 Styx \"Mr Roboto\" (Lyric: \"Domo arigato Mr Roboto ...\" + Video: Robot)   \n2:08 Madonna \"Holiday\" (Synth chords & riff + video: Madonna + two dancers @ 2:10 )   \n2:12 The Romantics \"Talking in Your Sleep\" (Robot-sounding Lyric: \"When you're talking in your sleep / the secrets that you keep\")   \n\n2:20 Cyndi Lauper \"Girls Just Wanna Have Fun\" (Lyric: \"Oh girls just wanna have fun\")  \n2:23 Billy Joel \"Uptown Girl\" (Lyric: \"Argh argh argh argh argh argh argh\" + Video: Mechanics dancing with a supermodel)  \n2:23 Madonna \"Borderline\" (Audio: High synth riff + Video: Woman with two toned hair and denim jacket / Mable pillars at 2:35 ) [Thanks WDP Music!]  \n2:23 New Order \"Blue Monday\" reprise (Audio: Electronic drums)  \n\n2:31 Spandau Ballet \"True\" (Video: Drummer and singer silhouetted by fog machine)  \n2:37 Cyndi Lauper \"Girls Just Wanna Have Fun\" reprise (Video: Cyndi Lauper puts wrestler Captain Lou Albano, playing her Dad, in an arm-lock)\n2:40 Nena \"99 Red Balloons\" (Bass synth brass riff + Video: Keyboardist wearing leather jacket and red scarf)  \n2:42 Def Leppard \"Photograph\" (Blonde woman being held by a big man in a trench coat)  \n2:50 The Police \"Every Breath You Take\" (Video: Double bass player)   \n\n2:55 Madonna \"Lucky Star\" (Audio: high shimmering bell sounds + Video: Madonna fiddles with her sunglasses) [Thanks WDP Music!] \n2:55 Billy Joel \"Uptown Girl\" reprise\n2:55 The Police \"Every Breath You Take\" (Guitar Riff + Video: Black and white video of guitarist, and cigarettes at the end) \n\nNot worked out yet:    \nRick James (possibly \"Tell Me What You Want\", an early ballad where the first word spoken is \"Girrrrl....\", paving the way for a decade of boy bands in vests)",
                "publishedAt": "2020-08-23T17:44:24.000Z"
              }
            }
          }
        }
      ]
    },
    {
      "contentDetails": {
        "duration": 182
      },
      "id": "qdypNbWmEOw",
      "snippet": {
        "title": "50 Songs From 1982 Remixed Into 3 Minutes",
        "description": "Samples of more than 50 songs from 1982 mixed together into one 3-minute song by The Hood Internet. NEW! Spotify playlist of all the samples used → http://spoti.fi/3e6BECw\nWatch the whole ongoing playlist here: http://bit.ly/thi-79-99\n\nFeaturing:\nA Flock of Seagulls, Afrika Bambaataa & The Soul Sonic Force, After The Fire, Alan Parsons Project, Asia, Billy Idol, Bow Wow Wow, Chicago, The Clash, Culture Club, Dazz Band, The Descendents, Dexys Midnight Runners, Duran Duran, Eddy Grant, The Fearless Four, Fleetwood Mac, Frida, Gang Of Four, Genesis, George Clinton, Grandmaster Flash & The Furious 5, Hall & Oates, Indeep, INXS, Iron Maiden, John Cougar Mellencamp, Kate Bush, Madness, Malcolm McLaren, Marvin Gaye, Men Without Hats, Michael Jackson, Michael McDonald, Modern English, Naked Eyes, New Order, Orange Juice, Peech Boys, The Pretenders, Prince, R.E.M., Shalamar, Sister Nancy, Survivor, Taco, Thomas Dolby, Toto, Yaz",
        "publishedAt": "2019-10-24T12:02:41Z",
        "thumbnails": {
          "default": {
            "url": "https://i.ytimg.com/vi/qdypNbWmEOw/default.jpg",
            "width": 120,
            "height": 90
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/qdypNbWmEOw/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "high": {
            "url": "https://i.ytimg.com/vi/qdypNbWmEOw/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/qdypNbWmEOw/sddefault.jpg",
            "width": 640,
            "height": 480
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/qdypNbWmEOw/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          }
        }
      },
      "comments": [
        {
          "id": "Ugys3AWpFHnVvgtCY_x4AaABAg",
          "snippet": {
            "videoId": "qdypNbWmEOw",
            "topLevelComment": {
              "snippet": {
                "textDisplay": "Building on the excellent work by Alexandra Danielewicz, here's the list of songs with time codes. Can you help fill in the gaps?  \n0:00 Fleetwood Mac “Hold Me” (Audio: Piano riff + Video: An archaeologist throws a guitar at glass)\n0:03 Grandmaster Flash and the Furious Five “The Message” (Audio: Drum beat + Video: rapper in blue / New York street / broken glass) \n0:06 Orange Juice “Rip It Up” (Audio: Guitar riff + Video: Transparent guitarist with red fender strat at 0:13)\n\n0:08 Prince “1999” (Lyric: “I was dreaming when I wrote this, forgive me if it goes astray…” )\n0:08 Duran Duran “Hungry Like the Wolf” (Audio: Fuzzy guitar lead + Video: Someone upends a salmon-coloured dining table + Jungle scenes)\n0:08 ? ? (Drum, claps & hi hats)\n0:13 Men Without Hats “Safety Dance” (Audio: Synth Octaves + Video: Green fields with mediaeval blonde / mediaeval man / dwarf) [Thanks Jakob Mueller!]\n0:14 Malcolm McLaren \"Buffalo Gals\" (Video: Record scratching, couples in tracksuits dance in a circle at 0:22 + Audio: Drums) [Thanks DatHott Gamer and Jakob Mueller!]\n\n0:29 The Clash “Should I Stay Or Should I Go?” (Audio: Strummed guitar riff + Video: Red guitarist, white guitar)\n0:29 Culture Club “Do You Really Want To Hurt Me\" (Audio: “Ooo ooo ooo” + Video: Man in hat with long white t-shirt with Hebrew writing)\n0:29 John Cougar Mellencamp “Jack and Diane\" (Video: Three picture frames, in the top two, a man in brown punches the camera + Audio: 2 notes on a rhythm guitar)\n0:38 Michael Jackson “Billie Jean” (Audio: Drums + Video: As man walks down the street, the pavement lights up) [Thanks Jakob Mueller!]\n\n0:40 The Clash “Should I Stay Or Should I Go?” (Lyric: “Darling you’ve got to let me know”)\n0:41 Bow Wow Wow “I Want Candy” (Lyric: “I want candy”)\n0:41 Dexy’s Midnight Runners “Come On Eileen” (Lyric: “Come on” + Video: Group wearing overalls)\n0:43 ? ? (Black and white group walk across a city skyline)\n0:45 John Cougar Mellencamp “Jack and Diane” reprise (Audio: Two notes on a guitar + Video: Three picture frames)\n0:49 Sister Nancy “Bam Bam” (Lyric: “Dee bum bum dee um. Bum Bum” + Video: Smoking singer.)\n0:56 Yazoo “Only You” (Synth player with a floppy haircut)\n0:57 Michael Jackson “Wanna Be Starting Something” (Lyric: “Yeah, yeah”)\n0:58 Marvin Gaye “Sexual Healing\" (Video: Consecutive female singers sing something unheard into the camera, which is “Get up” four times or “Wake up” four times.  Singer with a canula in his arm sings “Ooooo” at 1:05.)\n1:04 Gang of Four “I Love A Man In Uniform” (Video: Drummer wearing black. Note: This song was banned in the UK due to the Falklands War.)\n1:06 George Clinton “Atomic Dog\" (Audio: Choir sings “Oooo” + Video: Cartoon of a bulldog a horse and a lizard. Song sampled by Snoop Dogg.)\n\n1:06 Survivor “Eye of the Tiger” (Audio: Guitar power chords + Video: Man in beret looks around a room)\n1:06 Duran Duran \"Rio\" (Audio: Alto Saxophone riff + Video: Man plays a saxophone on a raft in the ocean) [Thanksgo5go!]\n1:06 Alan Parsons Project \"Sirius\" (Audio: Guitar riff introducing the Michael Jordan-era Chicago Bulls.) \n1:12 Genesis “Paperlate” (Phil Collins plays the drum riff from the start of the song) \n\n1:15 Peech Boys “Don’t Make Me Wait” (Lyric: “Don’t make me wait” + Audio: Drums)\n1:15 Hall and Oates “Man-eater” (Lyric “Oh oh here she comes” + Video: Darryl Hall’s blond head in profile singing Maneater) \n1:15 Eddy Grant “Electric Avenue\" (Audio: Synth riff + Video: Yellow stage light on the floor in a blue room)\n1:22 After the Fire “Der Komissar” (Video: Blonde on phone / High heels walk across a lit floor / Hairy spider walks across a desk) \n1:23 Taco “Puttin’ On the Ritz\" (Audio: Wind chimes + Video: Man in a tuxedo dances with a cane in front of homeless people.) [Thanks Jakob Mueller!]\n1:27 ? ? (Tenor Sax)\n1:30 After the Fire \"Der Kommisar\" reprise (Audio: Fuzzy guitar) [Thanks Jakob Mueller!]\n\n1:31 Indeep “Last Night a DJ Saved My Life” (Lyric: “Last night a DJ saved my life”)\n1:31 Michael Jackson “Thriller” (Audio: Bass riff)\n1:31 ? ? (Claps)\n1:35 Michael McDonald “I Keep Forgettin’” (Audio: Electric Piano Riff, later sampled in Warren G’s “Regulate” + Video: 7 piece band)\n1:40 Michael Jackson “Beat It\" (Audio: Sound of an engine increases power + Video: A knife fight between two guys whos wrists are tied together) [Thanks Jakob Mueller!]\n\n1:41 Afrika Bambaataa & The Soul Sonic Force “Planet Rock” (Lyric: “Rock it don’t stop it, you gotta rock it don’t stop …” + Video: break dancers + Audio: Electric high hats)\n1:41 Madness “Our House” (Audio: Piano riff + Video: Man in a cloth cap plays the piano)\n1:41 The Clash “Rock the Casbah” (Lyric: “Rock the casbah” + Video: An Arab and a Jew drive down the road together)\n1:56 Billy Idol “White Wedding” (Video: Women wearing PVC trousers wiggle their bums. Billy Idol strums a guitar while PVC-clad women cover their ears)\n\n1:58 Modern English “I Melt With You\" (Audio: Humming + Video: People wear hats on a dark stage next to pink smoke)\n1:58 Iron Maiden “Run To The Hills” (Audio: Hi hats / drum riff + Video: Drummer in red light)\n1:58 Descendents “Bikeage” (Audio: Bass guitar riff)  \n2:03 ? ? (Video: Grainy fender strat)\n2:06 Michael Jackson “PYT” (Lyric: “I want to love you … “ + Video: Michael Jackson’s dancing feet at 2:09) \n2:06 Shalamar “A Night To Remember\" (Lyric: “Get ready. Tonight” + Video: Barman explains to his patron that he has to get ready. Tonight.)\n2:06 INXS “Don’t Change” (High synth pad riff)\n\n2:11 ? ? (Band on dark stage with lights pointing directly at the camera)\n2:14 Prince “Little Red Corvette” (Video: Prince skips sideways across a stage)\n2:17 New Order “Temptation” (Audio: Driving high pitched bass guitar rhythm + Video: Woman dances in an old house with a view of the garden)\n2:20 The Pretenders “Back On The Chain Gang” (Lyric: “Oh, oh-oh oh oh-oh oh” + Video: A woman in a denim jacket walks along a cliff)\n2:21 A Flock of Seagulls “I Ran” (Audio: Short guitar riff + Video: People stuck in a hall of mirrors)\n2:21 Michael Jackson \"PYT\" reprise (Lyric: \"I want to love you\")\n2:24 The Clash “Rock The Casbah” reprise (Audio: Whistle sound descending, simulating the bombing of the minarets in the song)\n2:24 Dazz Band “Let It Whip\" (Lyric: “Child.” + Video: Man in tan suit and sunglasses with an open shirt)\n\n2:30 Naked Eyes “Always Something There To Remind Me” (Lyric: “And there is always something there to remind me”)\n2:30 A Flock of Seagulls “I Ran” reprise (Audio: Guitar riff + Video: Guitarists in white shirts)\n2:42 Toto “Africa” (Lyric: “Hurry boy it’s waiting there for you” + Video: Band playing on a stage that’s also a book.)\n2:46 ? ? Bride and groom dance\n2:48 Asia “Heat of the Moment” (Audio: Descending Guitar Lick + Video: Drummer in white vest and a large crucifix plays the drums on a 4 x4 matrix of televisions) [Thanks Jakob!]\n2:54  ? ? (Man does a somersault in the sky)\n2:59 A Flock of Seagulls “I Ran” (reprise) (Audio: Echoey guitar riff + Video: More people in a hall of mirrors)\n\nNot Found Yet:  Chicago, The Fearless Four, Frida, Kate Bush, R.E.M., Thomas Dolby",
                "publishedAt": "2020-09-09T11:30:51.000Z"
              }
            }
          }
        }
      ]
    },
    {
      "contentDetails": {
        "duration": 177
      },
      "id": "8BdfGD5ZiiA",
      "snippet": {
        "title": "50 Songs From 1981 Remixed Into 3 Minutes",
        "description": "Samples of more than 50 songs from 1981 mixed together into one 3-minute song by The Hood Internet. NEW! Spotify playlist of all the samples used → http://spoti.fi/2Oi19Gb\nWatch the whole ongoing playlist here: http://bit.ly/thi-79-99\n\nFeaturing:\n.38 Special, AC/DC, Afrika Bambaataa, Billy Idol, Billy Squier, Blue Oyster Cult, Depeche Mode, Duran Duran, Foreigner, Funky Four Plus One, Go-Gos, Hall & Oates, Human League, Joan Jett & The Blackhearts, Journey, Juice Newton, Kim Wilde, Kool & The Gang, Laurie Anderson, Loverboy, Men At Work, Neil Diamond, New Order, Olivia Newton-John, Phil Collins, The Pointer Sisters, The Police, The Psychedelic Furs, Queen & David Bowie, Rick James, Rick Springfield, Rod Stewart, Rush, Soft Cell, Squeeze, Stevie Nicks, Taana Gardner, Teena Marie, Tom Petty & The Heartbreakers, Tom Tom Club, Toni Basil, Treacherous Three, Trio, Vangelis, Yoko Ono\n\nSee last week's video for the year 1980:\nhttps://www.youtube.com/watch?v=g_nToRZOqVo\n\nAnd see the video for the year 1979:\nhttps://www.youtube.com/watch?v=JkBgmzocow4",
        "publishedAt": "2019-10-17T09:00:11Z",
        "thumbnails": {
          "default": {
            "url": "https://i.ytimg.com/vi/8BdfGD5ZiiA/default.jpg",
            "width": 120,
            "height": 90
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/8BdfGD5ZiiA/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "high": {
            "url": "https://i.ytimg.com/vi/8BdfGD5ZiiA/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/8BdfGD5ZiiA/sddefault.jpg",
            "width": 640,
            "height": 480
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/8BdfGD5ZiiA/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          }
        }
      },
      "comments": [
        {
          "id": "UgzCOKUAxnoAFgr-q494AaABAg",
          "snippet": {
            "videoId": "8BdfGD5ZiiA",
            "topLevelComment": {
              "snippet": {
                "textDisplay": "Here's the songs from the video with time codes. (I accidentally deleted the old version as it got too long.) Can you help fill in the gaps?  \n\n0:00 Stevie Nicks “Edge of Seventeen” (Audio: Rhythm guitar + Video: Woman in a flowing white dress)  \n0:04 Yoko Ono \"Walking On Thin Ice\" (Crescendo-ing electric guitar riff from the original version of this song) [Thanks Southpaw Frizzell!]  \n0:05 Phil Collins “In The Air Tonight” (Lyric: “I can feel it coming in the air tonight …”)\n0:10 Afrika Bambaataa and the Jazzy Five \"Jazzy Sensation\" (Lyric: “Can you feel it? Can you feel it?”) [Well spotted DatHott Gamer!]\n0:10 Squeeze \"Tempted\" (Audio: Organ sound) [Thanks h120mc!]\n0:12 Duran Duran \"Girls On Film\" (Audio: Faint rattle sound, which comes from the extended version https://youtu.be/pRbBDXcnt1k?t=22 )\n0:17 Soft Cell \"Say Hello, Wave Goodbye\" (Video: Man sits alone at a restaurant with rain outside) [Thanks\n0:19 Queen and David Bowie “Under Pressure” (Bass guitarist from Queen plays the riff from “Ice Ice Baby” by Vanilla Ice)\n\n0:23 Hall and Oates “I Can’t Go For That” (Lyric: “I can’t go for that, no, no …”)\n0:23 Foreigner “Waiting for a Girl Like You” (High synth riff + video 0:33 - 0:37)\n0:23 Stevie Nicks “Edge of Seventeen” reprise (Lyric “Ooh ooh ooh”)\n0:38 Joan Jett \"I Love Rock n Roll\" (Audio: Drum fill while Stevie Nicks sings)\n0:41 Teena Marie “Square Biz” (Video: Brunette singer in brown dress + Audio: “Heeeeeee\")\n\n0:42 Kool and the Gang “Get Down On It” (Lyric “Get down on it”)\n0:42 Men at Work “Land Down Under” (Audio: Flute riff)\n0:48 Tom Tom Club “Genius of Love” (Audio: Synth sound + Video: Animated children's pictures of three women in jail + Note: The synth sound was famously sampled on Mariah Carey's \"Fantasy\", which appears in the 1995 mix.) [Thanks Nassim T!]\n\n0:53 Billy Squier \"The Stroke\" (Lyric “Everybody… / If you’re in the game...”)  \n0:53 Foreigner \"Urgent\" (Audio: Synth dropping in pitch in the background) [Well done Jakob Mueller!]\n0:54 Olivia Newton-John “Physical” (Audio: Guitar riff + Video: Guitar with loose piano strings) [Thanks Jakob Mueller!]\n\n1:00 Billy Squier “The Stroke” (Audio: All the music + Video: Drummer spins his drum sticks)\n1:03 Joan Jett and the Blackhearts “I Love Rock n Roll” (Metal band in red leather)\n1:08 AC/DC “For Those About to Rock (We Salute You)” (Shirtless guitar player and his band)\n1:09 Treacherous Three “Feel the Heartbeat\" (Lyric: “Huh! Ha!”)\n1:13 Squeeze \"Tempted\" (Lyric “Woo!”)\n1:17 Phil Collins \"In The Air Tonight\" (Audio: Epic drum fill + Video: Yellow and purple face)\n\n1:18 Funky 4 + 1 “That’s the Joint\" (Lyric “It’s the joint”)\n1:19 Tom Petty and the Heartbreakers \"The Waiting\" (Audio: Guitar chord + Video: Guitarist in black at 1:23) \n1:19 TRIO “Da da da” (Lyric: “Aha aha aha”)\n1:19 Taana Gardner \"Heartbeat\" (Audio: Bass drum beating like a heartbeat)\n1:19 Loverboy \"Working for the Weekend\" (Audio: 4 beats of a cowbell + Video: Drummer with a big kit, Singer in red jumps)  \n1:21 Blue Oyster Cult \"Burnin For You\" (Audio: Faint guitar riff, from 2:21 of their live version v=73APVlFAFpQ)\n1:23 The Go-gos “Our Lips are Sealed\" (Vocal Lyric: “Hush my darling don’t you cry” + video: Women dancing in a fountain)\n1:23 Toni Basil \"Mickey\" (Audio: Drums, slowed down from the original recording and missing one snare.) [Thanks Jakob Mueller!]\n1:28 Soft Cell “Tainted Love” (Roman emperor gives the thumbs down + Audio: Electric cymbal sounds)\n1:31 Rush “Tom Sawyer” (Audio: Keyboard riff in 7/4 time + Video: Keyboardist with drums in the background)\n1:34 Juice Newton “Angel of the Morning” (Video: Lady wearing pink opens a window)\n1:35 Kim Wilde \"Kids in America\" (Keyboardist with a receding hairline and a leather jacket) (Note: This is the optimum combination of hairlines and jackets.) [Thanks Geecy Project!]  \n\n1:35 Rick Springfield “Jessie’s Girl” (Lyric: \"You know I wish that I had Jessie’s girl”)\n1:35 The Police \"Spirits In The Material World\" (Audio: Drum roll) [Well spotted Jakob Mueller!]\n1:39 Rick James “Superfreak” (Lyric: “She’s a very kinky girl”)\n1:39 Vangelis “Chariots of Fire” (Video: Piano player in the right panel watching the runners in the movie Chariots of Fire)  \n1:43 The Go-gos \"Our Lips Are Sealed\" (Audio: 6 note guitar riff) [Thanks Jakob Meuller!]\n1:51 The Police \"Spirits In The Material World\" (Video: Drummer in a recording studio who looks a bit like Napoleon Dynamite, but isn't.)  [Thanks Jakob Mueller!]\n1:52 New Order \"Ceremony\" (Male guitarist in grey, with female guitarist behind him.)\n1:56 Rod Stewart \"Young Turks\" (Large band dancing at … is that a train station?)\n1:59 Psychedelic Furs “Pretty In Pink” (Video between 1:59 and 2:03, culminating in someone who looks like Bob Geldof, but isn’t)\n1:59 .38 Special \"Hold On Loosely\" (Audio: Guitar solo + Video: Band that looks like ZZ Top, but isn't) \n\n2:07 Laurie Anderson “O Superman” (Lyric: \"ah, ah, ah, ah ... \"[repeat] + Video: Woman in shadow with a light bulb in her mouth)\n2:07 Queen and David Bowie “Under Pressure” reprise (Audio: bass and piano)\n2:07 Neil Diamond “America” (Audio: high four note riff, repeated + Video: Man in a blue shirt.)\n2:14 The Pointer Sisters “Slow Hand” (Audio: Two beats on the toms + Video: Woman on a bear rug)\n2:14 ? ? (Audio: Two notes of guitar harmonics over the toms)\n\n2:15 ? ? (Electric piano riff)\n2:15 Tanaa Gardner \"Heartbeat\" reprise (Audio: Bass drum beating like a heartbeat)\n2:15 Journey “Don’t Stop Believing” (Guitarist playing a fast riff faster and faster)\n2:19 The Human League “Don’t You Want Me” (Audio: faint repeated synth  note + Video: Woman stares at the camera from her desk as it backs away)\n2:23 Depeche Mode “I Just Can’t Get Enough” (Audio: Keyboard riff + Video: Keyboardists in leather)\n\n2:31 Hall and Oates “Private Eyes” (Band wearing trench coats and fedoras occasionally clap)  \n2:31 Rod Stewart \"Young Turks\" reprise (Audio: high but faint horn line above the rest of the song) [Well spotted Jakob Mueller!]\n2:31 ? ? (Lyric: \"Bom. Bom. Bow\", very faintly, from 2:31 to the end, sung in the root note of the key.)\n2:37 Men at Work “Who Can It Be Now” (Saxophone riff)\n2:41 Journey “Don’t Stop Believing” reprise (Lyric: “Don’t Stop. Be leeee-ving”)\n2:43 .38 Special “Hold On Loosely\" reprise (Lyric: “But don’t let go”)\n\nNot figured out yet, but on the Spotify playlist: \nRick James \"Give It To Me Baby\" (Around 0:41) \nBilly Idol \"Mony Mony\" (At the end, before Men At Work)",
                "publishedAt": "2021-03-06T12:19:14.000Z"
              }
            }
          }
        }
      ]
    },
    {
      "contentDetails": {
        "duration": 182
      },
      "id": "g_nToRZOqVo",
      "snippet": {
        "title": "50 Songs From 1980 Remixed Into 3 Minutes",
        "description": "Samples of more than 50 songs from 1980 mixed together into one 3-minute song by The Hood Internet. NEW! Spotify playlist of all the samples used → http://spoti.fi/3bf76N8\nWatch the whole ongoing playlist here: http://bit.ly/thi-79-99\n\nFeaturing:\nA Taste Of Honey, AC/DC, The B-52s, Billy Joel, Billy Squier, Blondie, Bob Marley & The Wailers, Bruce Springsteen, The Clash, The Cure, Dead Kennedys, Devo, Diana Ross, Dolly Parton, Elvis Costello, The English Beat, Frankie Smith, Generation X & Billy Idol, George Benson, Hall & Oates, J. Geils Band, The Jam, John Lennon, Journey, Joy Division, Kool & The Gang, Kurtis Blow, Lakeside, Martha & The Muffins, Orchestral Manoeuvres In the Dark, Ozzy Osbourne, Pat Benatar, Pete Townshend, The Police, Queen, The Ramones, The Romantics, Rush, The S.O.S. Band, Steely Dan, Stephanie Mills, Talking Heads, U2, Ultravox, The Vapors, Yarbrough & Peoples, Zapp",
        "publishedAt": "2019-10-10T11:24:08Z",
        "thumbnails": {
          "default": {
            "url": "https://i.ytimg.com/vi/g_nToRZOqVo/default.jpg",
            "width": 120,
            "height": 90
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/g_nToRZOqVo/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "high": {
            "url": "https://i.ytimg.com/vi/g_nToRZOqVo/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/g_nToRZOqVo/sddefault.jpg",
            "width": 640,
            "height": 480
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/g_nToRZOqVo/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          }
        }
      },
      "comments": [
        {
          "id": "Ugxfs0I_MYz1jxu-ds94AaABAg",
          "snippet": {
            "videoId": "g_nToRZOqVo",
            "topLevelComment": {
              "snippet": {
                "textDisplay": "List of songs (that I can figure out). Can you spot what I've missed?  \n\n0:00 U2 \"I Will Follow\" (Lyric \"1-2-3-4\" & guitar)  \n0:02 The Police \"Don't Stand So Close to Me\" (Low cello drone)  \n0:08 The Romantics \"What I Like About You\" (Strummed Electric guitar)  \n0:10 B-52s \"Private Idaho\" (Single note electric guitar, harmony) \n0:11 Orchestral Manoeuvres in the Dark \"Enola Gay\" (Weak electric drum sound + Video: Band on Top of the Pops)\n0:14 The Jam \"That's Entertainment\" (Strummed Acoustic Guitar)  \n0:20 Elvis Costello \"I Can't Stand Up For Falling Down\" (Drum fill, accompanying The Romantics shouting \"Hey\", from their appearance on the Kenny Everett show) [Amazing find, Southpaw Frizzell!] \n\n0:21 Devo \"Whip It\" (Hi-hats. Video of drummer wearing a red jelly mold on his head)  \n0:26 Pete Townshend \"Let My Love Open The Door\" (Keyboard riff)  \n0:26 The Ramones \"Do You Remember Rock and Roll Radio\" (Muddy drum sound, and the lyric 'Let's Go!')  \n0:33 Devo \"Whip It\" (Video of Devo, whipping it)  \n0:33 The Cure \"A Forest\" (That's Robert Smith in the red t-shirt, before he went full Goth)  \n0:36 Martha and the Muffins \"Echo Beach\" (Video of woman in red shirt)\n0:36 The Vapors \"Turning Japanese\" (Band in red lighting with yellow circles behind them)  \n\n0:38 Generation X & Billy Idol \"Dancing With Myself\" (Lyric \"Dancing with myself, oh oh oh\" + Billy Idol punching a balloon, striking fear into the hearts of balloons everywhere)  \n0:38 Joy Division \"Love will tear us apart\" (Drummer, plus audio of low rhythm guitar)  \n0:48 Journey \"Any Way You Want It\" (Bassy electric guitar riff) [Thanks Joey Alvestad!]\n\n0:50 Billy Joel \"You May Be Right\" (Greeny-brown video with man in jacket shadow boxing)\n0:55 Ozzy Osbourne \"Crazy Train\" (Black and white fade into man's eye)  \n0:56 Rush \"Spirit of Radio\" (Tasty guitar riff)\n0:58 J Geils Band \"Love Stinks\" (Drummer playing drums with a fish)  \n\n1:00                 (Transition, which is Steely Dan's \"Hey Nineteen\" btw, but I'm adding a space to make this list easier to read)  \n1:02 Queen \"Another One Bites the Dust\" (Lyric \"Let's go!\") \n\n1:03 George Benson \"Give Me the Night\" (Video of roller-skating bass player)  \n1:03 Diana Ross \"Upside Down\" (Lyric \"Upside down, boy you turn me ...\")  \n1:03 Steely Dan \"Hey Nineteen\" (Lyric \"No we can't dance together\") \n1:06 AC/DC \"Back In Black\" (Guitar riff)  \n\n1:11 Bruce Springstein \"Hungry Heart\" (Bruce Springstein putting down his guitar)\n1:12 The Clash \"The Magnificent Seven\" (Drum fill) [Thanks Julio Diaz!]\n1:22 Bob Marley & the Wailers \"Could You Be Loved?\" (Low rhythm guitar riff) \n1:22 Blondie \"Rapture\" (Man in white top hat leading a conga line) \n1:26 Kool and the Gang \"Celebration\" (Lyric \"Wahoo\")  \n1:27 The S.O.S. Band \"Take Your Time To Do It Right\" (Drummer, on the left hand screen)\n1:29 Zapp \"More Bounce to the Ounce\" (Vocoder lyric by man in silver-white shirt. He's actually saying \"More bounce\")\n\n1:30 Kurtis Blow \"The Breaks\"  (Lyric \"Clap your hands everybody ...\")\n1:30 Dolly Parton \"Nine to Five\"  (Piano / bass rhythm) \n1:38 A Taste of Honey \"Sukiyaki\" (Video of geisha in purple kimono, audio of a quick arpeggio on the koto)\n\n1:38 Stephanie Mills \"Never Knew Love Like This Before\" (Electric piano)\n1:38 Diana Ross \"I'm Coming Out\" (Vocal: \"I'm coming out\". Note: Both Diana Ross and Stephanie Mills played Dorothy in The Wiz)  \n1:43 Hall & Oates \"Kiss on my List\" (Electronic drums) [Thanks to Jakob Mueller, one of the few people in the world who could have spotted this]\n1:50 Lakeside \"Fantastic Voyage\" (People dressed as pirates elbow the imaginary people standing next to them.)\n1:53 Ultravox \"Vienna\" (Formal gathering stares at camera. Note: They do NOT say \"woo hoo ooo\", even though it looks like they do. The Hood Internet can mix!)  \n\n1:56 Hall & Oates \"You Make My Dreams\" (Electric piano riff)\n2:01 Yarbrough & Peoples \"Don't Stop the Music\" (Synthy bass sound, later used by Vulfpeck on their song \"Beastly\")\n\n2:05 Pat Benatar \"Hit Me With Your Best Shot\" (Ms Benatar formally requests the pleasure of you hitting her with your best shot)\n2:12 Joy Division \"Atmosphere\" (Black and white video, and occasional high synth sound)   \n2:23 AC/DC \"You Shook Me All Night Long\" (Lead electric guitar riff) [Thanks Joey Alvestad!]\n2:25 Frankie Smith \"Double Dutch Bus\" (Right panel: people dancing in front of a bus. Killer fact: Frankie didn't get paid royalties for this song, as his record company were laundering money for a dentist.)\n2:27 Billy Squier \"The Big Beat\" (Left panel: Lyric \"Woooo!\") \n\n2:37 Talking Heads \"Once in a Lifetime\" (Man in suit removing the water from the bottom of the ocean)  \n2:48 John Lennon \"Woman\" (John & Yoko strolling down a sunlit road in the woods, six weeks before his murder.) \n2:53 Billy Joel \"Still Rock and Roll To Me\" (Audio: Two drumbeats and an electric guitar chord) [Thanks WDP Music]\n2:56 Pat Benatar \"Hit Me With Your Best Shot\" reprise (Audio: Ending guitar riff, drum roll and final chord) [Really well spotted, WDP Music!]\n\nUnidentified so far, but on the playlist:  \nOrchestral Manoeuvres in the Dark  \"Messages\"  (near J Geils Band \"Love Stinks)\nThe English Beat \"Mirror in the Bathroom\"  (near \"Another One Bites the Dust\")\nBlondie \"The Tide Is High\" (near \"Another One Bites The Dust\")\nDead Kennedys \"Holiday In Cambodia\" (near \"Another One Bites The Dust\")",
                "publishedAt": "2020-07-17T13:49:57.000Z"
              }
            }
          }
        }
      ]
    },
    {
      "contentDetails": {
        "duration": 176
      },
      "id": "JkBgmzocow4",
      "snippet": {
        "title": "50 Songs From 1979 Remixed Into 3 Minutes",
        "description": "Samples of more than 50 songs from 1979 mixed together into one 3-minute song by The Hood Internet. NEW! Spotify playlist of all the samples used → http://spoti.fi/3bZCRsp\nWatch the whole ongoing playlist here: http://bit.ly/thi-79-99\n\nFeaturing:\nABBA, AC/DC, Anita Ward, Billy Joel, Blondie, Boomtown Rats, The Buggles, The Cars, Charlie Daniels Band, Cheap Trick, Chic, The Clash, The Cure, Donna Summer, Doobie Brothers, Earth Wind & Fire, Electric Light Orchestra, Fleetwood Mac, The Flying Lizards, Gang of Four, The Gap Band, Gary Numan, Joy Division, Kiss, The Knack, Kool & The Gang, Lipps Inc, M, Michael Jackson, Pat Benatar, Pink Floyd, The Police, The Pretenders, Prince, Queen, Rainbow, Rupert Holmes, Sister Sledge, The Specials, Squeeze, The Sugarhill Gang, Supertramp, Talking Heads, Tom Petty & The Heartbreakers, Van Halen, The Whispers, Wire",
        "publishedAt": "2019-10-03T13:12:51Z",
        "thumbnails": {
          "default": {
            "url": "https://i.ytimg.com/vi/JkBgmzocow4/default.jpg",
            "width": 120,
            "height": 90
          },
          "medium": {
            "url": "https://i.ytimg.com/vi/JkBgmzocow4/mqdefault.jpg",
            "width": 320,
            "height": 180
          },
          "high": {
            "url": "https://i.ytimg.com/vi/JkBgmzocow4/hqdefault.jpg",
            "width": 480,
            "height": 360
          },
          "standard": {
            "url": "https://i.ytimg.com/vi/JkBgmzocow4/sddefault.jpg",
            "width": 640,
            "height": 480
          },
          "maxres": {
            "url": "https://i.ytimg.com/vi/JkBgmzocow4/maxresdefault.jpg",
            "width": 1280,
            "height": 720
          }
        }
      },
      "comments": []
    }
  ]
}
